pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// bl602_demo_at_text_0006.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 230603F2: Register Eq_2 ef_get_env(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg48, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      at_key_value_get
//      at_server_init
Eq_2 ef_get_env(Eq_2 ra, Eq_2 a0, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg48, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_121;
	Eq_353146 a0_16;
	ptr32 s0_25;
	word32 s9_199;
	word32 s11_201;
	word32 s10_200;
	word32 s5_198;
	word32 s2_197;
	ptr32 s1_139;
	ptr32 s3_151;
	ptr32 s4_154;
	Eq_2 ra_137 = ef_get_env_blob(ra, a0, 1107391912, 0x00, s3, mstatus, dwLoc08, dwArg04, dwArg48, dwArg78, dwArgB8, dwArgF8, out s0_25, out s1_139, out a0_16, out s2_197, out s3_151, out s4_154, out s5_198, out s9_199, out s10_200, out s11_201);
	if (a0_16 != 0x00)
	{
		Eq_353146 a4_45 = 0x00;
		do
		{
			up32 a3_52 = (word32) *((word32) a4_45 + (s0_25 + 1448));
			if (a3_52 > ~0x7D)
			{
				word32 s11_214;
				word32 s10_213;
				word32 s9_212;
				word32 s7_211;
				word32 s6_210;
				word32 s5_209;
				word32 s2_208;
				word32 a5_207;
				word32 a2_204;
				word32 a4_206;
				word32 a3_205;
				word32 a1_203;
				word32 a0_202;
				ra_137 = ef_log_info(ra_137, &g_t230C0388, a3_52 + ~0x1F, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_139, out a0_202, out a1_203, out a2_204, out a3_205, out a4_206, out a5_207, out s2_208, out s3_151, out s4_154, out s5_209, out s6_210, out s7_211, out s9_212, out s10_213, out s11_214);
				goto l2306044A;
			}
			a4_45 = (word32) a4_45.u1 + 1;
		} while (a0_16 != a4_45);
		*((word32) a0_16.u0 + (s0_25 + 1448)) = 0x00;
		a0_121 = s0_25 + 1448;
	}
	else
	{
l2306044A:
		a0_121 = 0x00;
	}
	s1Out = s1_139;
	a0Out = a0_121;
	s3Out = s3_151;
	s4Out = s4_154;
	return ra_137;
}

// 2306044E: void ef_del_env(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
// Called from:
//      psm_test_cmd
//      psm_unset_cmd
void ef_del_env(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg9C, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	if ((word32) g_b4200F50A != 0x00)
	{
		if (a0 != 0x00)
		{
			Eq_2 a3_14;
			Eq_2 a4_15;
			Eq_2 a2_18;
			word32 a1_263;
			word32 a5_264;
			if (strlen(a0, out a1_263, out a2_18, out a3_14, out a4_15, out a5_264) <= 64)
			{
				Eq_2 s3_31;
				Eq_2 a4_42;
				word32 s1_284;
				word32 a0_285;
				word32 a1_286;
				word32 a3_287;
				word32 a4_288;
				word32 s2_289;
				word32 s4_290;
				word32 s0_291;
				word32 s1_292;
				word32 a0_293;
				word32 a3_294;
				word32 s2_295;
				word32 s3_296;
				word32 s4_297;
				del_env(ra, ef_port_env_lock(a2_18, a3_14, a4_15, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_284, out a0_285, out a1_286, out a3_287, out a4_288, out s2_289, out s3_31, out s4_290), 0x00, 0x01, s3_31, dwLoc18, s0, dwArg38, out s0_291, out s1_292, out a0_293, out a3_294, out a4_42, out s2_295, out s3_296, out s4_297);
				word32 s1_298;
				word32 a3_299;
				word32 a4_300;
				word32 s2_301;
				word32 s3_302;
				word32 s4_303;
				word32 s5_304;
				ef_port_env_unlock(a4_42, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_298, out a3_299, out a4_300, out s2_301, out s3_302, out s4_303, out s5_304);
				return;
			}
		}
		if (g_t4200F560 == 0x00)
		{
			word32 a5_266;
			xTaskGetTickCount(out a5_266);
		}
		else
		{
			word32 a5_265;
			xTaskGetTickCountFromISR(out a5_265);
		}
		word32 s1_267;
		word32 a0_268;
		word32 a1_269;
		word32 a2_270;
		word32 a3_271;
		word32 a4_272;
		word32 a5_273;
		word32 s2_274;
		word32 s3_275;
		word32 s4_276;
		word32 s5_277;
		word32 s6_278;
		word32 s7_279;
		word32 s8_280;
		word32 s9_281;
		word32 s10_282;
		word32 s11_283;
		bl_printk(ra, &g_t230C0300, 0x230C03C8, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_267, out a0_268, out a1_269, out a2_270, out a3_271, out a4_272, out a5_273, out s2_274, out s3_275, out s4_276, out s5_277, out s6_278, out s7_279, out s8_280, out s9_281, out s10_282, out s11_283);
	}
	else
	{
		word32 s3_255;
		word32 s4_256;
		word32 a5_253;
		word32 s2_254;
		word32 a3_251;
		word32 a4_252;
		word32 a1_249;
		word32 a2_250;
		word32 s1_247;
		word32 a0_248;
		word32 s5_257;
		word32 s6_258;
		word32 s7_259;
		word32 s9_260;
		word32 s10_261;
		word32 s11_262;
		ef_log_info(ra, &g_t230C02DC, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_247, out a0_248, out a1_249, out a2_250, out a3_251, out a4_252, out a5_253, out s2_254, out s3_255, out s4_256, out s5_257, out s6_258, out s7_259, out s9_260, out s10_261, out s11_262);
	}
}

// 230604D2: Register Eq_2 ef_set_env_blob(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s8Out)
// Called from:
//      ef_set_env
//      psm_test_cmd
Eq_2 ef_set_env_blob(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, union Eq_2 & s8Out)
{
	Eq_2 ra_105;
	ptr32 s1_279;
	ptr32 s2_280;
	ptr32 s3_281;
	if ((word32) g_b4200F50A == 0x00)
	{
		word32 s9_681;
		word32 s10_682;
		word32 s11_683;
		word32 a0_671;
		word32 s7_680;
		word32 a3_674;
		word32 a1_672;
		word32 a2_673;
		word32 s5_678;
		word32 a5_676;
		word32 s4_677;
		word32 s6_679;
		word32 a4_675;
		ra_105 = ef_log_info(ra, &g_t230C043C, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_279, out a0_671, out a1_672, out a2_673, out a3_674, out a4_675, out a5_676, out s2_280, out s3_281, out s4_677, out s5_678, out s6_679, out s7_680, out s9_681, out s10_682, out s11_683);
		goto l230604FA;
	}
	struct Eq_274 * a0_311;
	if (a0 == 0x00 || a1 == 0x00)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_684;
			xTaskGetTickCountFromISR(out a5_684);
		}
		else
		{
			word32 a5_699;
			xTaskGetTickCount(out a5_699);
		}
		a0_311 = (struct Eq_274 *) &g_t230C03E4;
l23060548:
		word32 a5_690;
		word32 s7_694;
		word32 s10_697;
		word32 s11_698;
		word32 s9_696;
		word32 s8_695;
		word32 s4_691;
		word32 s5_692;
		word32 s6_693;
		word32 a0_685;
		word32 a3_688;
		word32 a4_689;
		word32 a2_687;
		word32 a1_686;
		ra_105 = bl_printk(ra, a0_311, 0x230C03C8, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_279, out a0_685, out a1_686, out a2_687, out a3_688, out a4_689, out a5_690, out s2_280, out s3_281, out s4_691, out s5_692, out s6_693, out s7_694, out s8_695, out s9_696, out s10_697, out s11_698);
		goto l230604FA;
	}
	Eq_2 a3_30;
	Eq_2 a4_31;
	Eq_2 a2_34;
	word32 a5_701;
	word32 a1_700;
	if (strlen(a0, out a1_700, out a2_34, out a3_30, out a4_31, out a5_701) > 64)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_702;
			xTaskGetTickCountFromISR(out a5_702);
		}
		else
		{
			word32 a5_708;
			xTaskGetTickCount(out a5_708);
		}
		word32 a2_704;
		word32 a5_707;
		word32 a4_706;
		word32 a3_705;
		word32 a1_703;
		strlen(a0, out a1_703, out a2_704, out a3_705, out a4_706, out a5_707);
		a0_311 = (struct Eq_274 *) &g_t230C0414;
		goto l23060548;
	}
	if (a2 > 0x00FFFF8C)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_709;
			xTaskGetTickCountFromISR(out a5_709);
		}
		else
		{
			word32 a5_710;
			xTaskGetTickCount(out a5_710);
		}
		a0_311 = (struct Eq_274 *) &g_t230C04CC;
		goto l23060548;
	}
	Eq_2 s1_47;
	word32 a4_714;
	word32 s4_717;
	word32 s3_716;
	word32 s2_715;
	word32 a1_712;
	word32 a3_713;
	word32 a0_711;
	ef_port_env_lock(a2_34, a3_30, a4_31, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_47, out a0_711, out a1_712, out a3_713, out a4_714, out s2_715, out s3_716, out s4_717);
	word32 a2_719;
	word32 a5_722;
	word32 a4_721;
	word32 a3_720;
	word32 a1_718;
	strlen(s1_47, out a1_718, out a2_719, out a3_720, out a4_721, out a5_722);
	word32 a0_65;
	Eq_2 s1_74;
	word32 s6_729;
	word32 a3_724;
	word32 s4_727;
	word32 s5_728;
	word32 s3_726;
	word32 s2_725;
	word32 a1_723;
	Eq_2 a4_131;
	ra_105 = new_env(ra, 0x42017570, dwLoc18, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg4C, s5, dwArg7C, dwArgB8, dwArgE8, out s1_74, out a0_65, out a1_723, out a3_724, out a4_131, out s2_725, out s3_726, out s4_727, out s5_728, out s6_729);
	if (a0_65 == ~0x00)
	{
l23060664:
		word32 s4_750;
		word32 s5_751;
		word32 a3_748;
		word32 a4_749;
		ef_port_env_unlock(a4_131, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_279, out a3_748, out a4_749, out s2_280, out s3_281, out s4_750, out s5_751);
l230604FA:
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_279;
		s2Out = s2_280;
		s3Out = s3_281;
		s4Out = dwArg78;
		s8Out = s5;
		return ra_105;
	}
	word32 a0_97;
	word32 s10_734;
	word32 s11_735;
	word32 a5_732;
	word32 s9_733;
	word32 s0_730;
	word32 a4_731;
	Eq_2 s3_111;
	Eq_2 s1_107;
	Eq_2 s2_110;
	ra_105 = find_env(ra_105, s1_74, 0x42017498, s0, dwLoc08, dwArg38, dwArgB8, out s0_730, out s1_107, out a0_97, out a4_731, out a5_732, out s2_110, out s3_111, out s9_733, out s10_734, out s11_735);
	if (a0_97 != 0x00)
	{
		word32 a0_154;
		word32 s4_754;
		word32 s0_752;
		word32 a3_753;
		ra_105 = del_env(ra_105, s1_107, (word32) s2_110 + 1176, 0x00, s3_111, s6, s4, dwArg28, out s0_752, out s1_107, out a0_154, out a3_753, out a4_131, out s2_110, out s3_111, out s4_754);
		if (a0_154 != 0x00)
		{
l23060656:
			if ((word32) g_b4200F508 != 0x00)
			{
				word32 s2_746;
				word32 s4_747;
				word32 s1_745;
				ra_105 = gc_collect(ra_105, dwArg10, dwArg14, dwArg38, s3, dwArgC8, out s1_745, out a4_131, out s2_746, out s4_747);
			}
			goto l23060664;
		}
	}
	Eq_2 s1_178;
	word32 s2_181;
	Eq_2 s3_182;
	word32 s6_185;
	word32 a0_196;
	word32 a3_737;
	word32 a1_736;
	ra_105 = create_env_blob(ra_105, s1_107, s1_107, s3_111, s2_110, s4, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg3C, dwArg4C, dwArg78, dwArgA8, out s1_178, out a0_196, out a1_736, out a3_737, out a4_131, out s2_181, out s3_182, out s6_185);
	if (s6_185 != 0x00 && a0_196 == 0x00)
	{
		word32 s3_743;
		word32 s4_744;
		word32 a0_740;
		word32 a3_741;
		word32 s2_742;
		word32 s0_738;
		word32 s1_739;
		ra_105 = del_env(ra_105, s1_178, s2_181 + 1176, 0x01, s3_182, s6, s4, dwArg28, out s0_738, out s1_739, out a0_740, out a3_741, out a4_131, out s2_742, out s3_743, out s4_744);
	}
	goto l23060656;
}

// 23060668: Register Eq_2 ef_set_env(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s4Out)
// Called from:
//      psm_set_cmd
//      at_key_value_set
Eq_2 ef_set_env(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s4Out)
{
	Eq_2 a3_14;
	Eq_2 a1_17;
	word32 a2_91;
	word32 a4_92;
	word32 a5_93;
	strlen(a1, out a1_17, out a2_91, out a3_14, out a4_92, out a5_93);
	ptr32 s0_39;
	ptr32 s1_40;
	ptr32 s4_45;
	word32 s2_94;
	word32 s3_95;
	word32 s8_96;
	Eq_2 ra_38 = ef_set_env_blob(ra, a0, a0, a1_17, dwArg44, a3_14, s2, s3, s4, s5, s6, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg4C, dwArg68, dwArg74, dwArg78, dwArg7C, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0128, dwArg0168, out s0_39, out s1_40, out s2_94, out s3_95, out s4_45, out s8_96);
	s0Out = s0_39;
	s1Out = s1_40;
	s4Out = s4_45;
	return ra_38;
}

