pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23060688: void ef_save_env()
// Called from:
//      psm_unset_cmd
//      psm_set_cmd
void ef_save_env()
{
}

// 2306068C: Register Eq_2 ef_env_set_default(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out)
// Called from:
//      ef_load_env
//      psm_erase_cmd
//      restory
Eq_2 ef_env_set_default(Eq_2 ra, Eq_2 s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out)
{
	if (g_t4200F4FC != 0x00)
	{
		if (g_dw4200F500 != 0x00)
		{
			word32 s4_424;
			word32 s3_423;
			word32 s1_422;
			Eq_2 s2_142;
			Eq_2 a4_133;
			Eq_2 a3_108;
			Eq_2 a0_100;
			Eq_2 a1_106;
			ef_port_env_lock(a2, a3, a4, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, out s1_422, out a0_100, out a1_106, out a3_108, out a4_133, out s2_142, out s3_423, out s4_424);
			Eq_332972 s1_43 = g_t4200F504;
			union Eq_353988 * s3_45 = &g_t4200F504;
			Eq_353918 s4_46 = 0x08000000;
			ra_128 = ra;
			while (true)
			{
				Eq_2 ra_128;
				if (s1_43 >=u Mem19[s3_45 + 0x00:int32] + s4_46)
					break;
				word32 s1_64;
				word32 s5_75;
				ra_128 = format_sector.constprop.16(ra_128, s1_43, s2_142, s4, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg2C, dwArg3C, out s1_64, out a0_100, out a1_106, out a3_108, out a4_133, out s2_142, out s3_45, out s4_46, out s5_75);
				if (a0_100 != 0x00)
					goto l23060734;
				s1_43 = s1_64 + s5_75;
			}
			Eq_353964 s1_139 = 0x00;
			while (s1_139 < *s2_142)
			{
				if (a3_108 == 0x00)
				{
					word32 a5_446;
					word32 a4_445;
					word32 a3_444;
					word32 a2_443;
					a3_108 = strlen(a0_100, out a1_106, out a2_443, out a3_444, out a4_445, out a5_446);
				}
				word32 s3_441;
				word32 s6_442;
				ra_128 = create_env_blob(ra_128, (word32) s1_139.u1 + 1, a1_106, a3_108, s2_142, dwLoc44, dwLoc40, dwLoc3C, dwLoc38, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwArg1C, dwArg2C, dwArg58, dwArg88, out s1_139, out a0_100, out a1_106, out a3_108, out a4_133, out s2_142, out s3_441, out s6_442);
			}
l23060734:
			ptr32 a4_171;
			word32 s3_438;
			word32 s4_439;
			word32 s5_440;
			word32 s2_437;
			word32 a3_436;
			word32 s1_435;
			ef_port_env_unlock(a4_133, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1_435, out a3_436, out a4_171, out s2_437, out s3_438, out s4_439, out s5_440);
			a2Out = dwLoc0C;
			a3Out = s2;
			a4Out = a4_171;
			return dwLoc08;
		}
		else
		{
			word32 s1_425;
			word32 a0_426;
			word32 a1_427;
			word32 a3_428;
			word32 s5_433;
			word32 s6_434;
			word32 a4_429;
			word32 s2_430;
			word32 s4_432;
			word32 s3_431;
			ef_log_debug(ra, &g_t230C0664, 0x230C0370, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_425, out a0_426, out a1_427, out a3_428, out a4_429, out s2_430, out s3_431, out s4_432, out s5_433, out s6_434);
			while (true)
				;
		}
	}
	else
	{
		word32 s6_421;
		word32 s5_420;
		word32 s3_418;
		word32 a4_416;
		word32 a1_414;
		word32 s1_412;
		word32 s4_419;
		word32 s2_417;
		word32 a3_415;
		word32 a0_413;
		ef_log_debug(ra, &g_t230C0664, 0x230C0360, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_412, out a0_413, out a1_414, out a3_415, out a4_416, out s2_417, out s3_418, out s4_419, out s5_420, out s6_421);
		while (true)
			;
	}
}

// 23060780: void ef_print_env(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
// Called from:
//      psm_dump_cmd
void ef_print_env(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	if ((word32) g_b4200F50A == 0x00)
	{
		word32 s1_215;
		word32 a0_216;
		word32 a1_217;
		word32 a2_218;
		word32 a3_219;
		word32 a4_220;
		word32 a5_221;
		word32 s2_222;
		word32 s3_223;
		word32 s4_224;
		word32 s5_225;
		word32 s6_226;
		word32 s7_227;
		word32 s9_228;
		word32 s10_229;
		word32 s11_230;
		ef_log_info(ra, &g_t230C043C, a3, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_215, out a0_216, out a1_217, out a2_218, out a3_219, out a4_220, out a5_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s9_228, out s10_229, out s11_230);
	}
	else
	{
		Eq_2 s2_23;
		struct Eq_351071 * s4_25;
		word32 s1_231;
		word32 a0_232;
		word32 a1_233;
		word32 a3_234;
		word32 a4_235;
		word32 s3_236;
		ef_port_env_lock(a2, a3, a4, mstatus, dwLoc68, dwLoc4C, dwArg34, dwArgA8, dwArgE8, out s1_231, out a0_232, out a1_233, out a3_234, out a4_235, out s2_23, out s3_236, out s4_25);
		Eq_2 a3_36;
		Eq_2 a3_67;
		Eq_2 a4_95;
		word32 s0_237;
		word32 a4_238;
		word32 a5_239;
		word32 s2_240;
		word32 s3_241;
		word32 s5_242;
		word32 s10_243;
		word32 s11_244;
		word32 s1_245;
		word32 a0_246;
		word32 a1_247;
		word32 a4_248;
		word32 a5_249;
		word32 s2_250;
		word32 s3_251;
		word32 s4_252;
		word32 s6_253;
		word32 s7_254;
		word32 s1_255;
		word32 a0_256;
		word32 a1_257;
		word32 a3_258;
		word32 a5_259;
		word32 s2_260;
		word32 s3_261;
		word32 s4_262;
		word32 s6_263;
		word32 s7_264;
		ef_print(ef_print(env_iterator(ra, fp + -0x0068, s2_23, s4_25, dwLoc54, dwArg28, dwArg68, dwArgE8, out s0_237, out a3_36, out a4_238, out a5_239, out s2_240, out s3_241, out s5_242, out s10_243, out s11_244), &g_t230C0498, a3_36, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_245, out a0_246, out a1_247, out a3_67, out a4_248, out a5_249, out s2_250, out s3_251, out s4_252, out s6_253, out s7_254), &g_t230C04B4, a3_67, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_255, out a0_256, out a1_257, out a3_258, out a4_95, out a5_259, out s2_260, out s3_261, out s4_262, out s6_263, out s7_264);
		word32 s1_265;
		word32 a3_266;
		word32 a4_267;
		word32 s2_268;
		word32 s3_269;
		word32 s4_270;
		word32 s5_271;
		ef_port_env_unlock(a4_95, mstatus, dwLoc68, dwLoc4C, dwArg34, dwArgA8, dwArgE8, dwArg0128, out s1_265, out a3_266, out a4_267, out s2_268, out s3_269, out s4_270, out s5_271);
	}
}

// 230607D4: Register Eq_2 ef_load_env(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      ef_env_init
Eq_2 ef_load_env(Eq_2 ra, Eq_2 s0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a3Out)
{
	g_b4200F509 = 0x01;
	word32 s0_32;
	word32 s5_343;
	word32 s3_341;
	word32 a5_339;
	word32 a0_337;
	word32 s6_344;
	word32 s4_342;
	word32 s2_340;
	word32 a1_338;
	word32 s1_336;
	Eq_2 a4_108;
	Eq_2 a3_109;
	Eq_2 ra_135 = sector_iterator(ra, fp + -0x0080, dwArg98, out s0_32, out s1_336, out a0_337, out a1_338, out a3_109, out a4_108, out a5_339, out s2_340, out s3_341, out s4_342, out s5_343, out s6_344);
	Eq_2 a2_110 = ra;
	if (a4_108 == 0x08)
	{
		Eq_2 a2_58;
		Eq_2 a3_59;
		Eq_2 a4_60;
		Eq_2 s2_67;
		Eq_2 s4_69;
		Eq_2 s5_70;
		word32 a5_367;
		word32 a1_366;
		word32 a0_365;
		word32 s1_364;
		word32 s3_368;
		word32 s6_369;
		word32 s7_370;
		word32 s9_371;
		word32 s10_372;
		word32 s11_373;
		ra_135 = ef_env_set_default(ef_log_info(ra_135, &g_t230C0458, a3_109, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, dwArg2C, out s1_364, out a0_365, out a1_366, out a2_58, out a3_59, out a4_60, out a5_367, out s2_67, out s3_368, out s4_69, out s5_70, out s6_369, out s7_370, out s9_371, out s10_372, out s11_373), s0_32 + 0x0509, a2_58, a3_59, a4_60, s2_67, s4_69, s5_70, mstatus, dwLoc88, dwLoc78, dwLoc74, dwLoc70, dwLoc6C, dwLoc64, dwLoc54, dwLoc38, dwLoc24, dwLoc08, dwArg38, dwArg78, dwArgB8, out a2_110, out a3_109, out a4_108);
	}
	word32 s3_351;
	word32 s2_350;
	word32 a4_349;
	word32 a1_347;
	word32 s1_345;
	word32 s4_352;
	word32 a3_348;
	word32 a0_346;
	ef_port_env_lock(a2_110, a3_109, a4_108, mstatus, dwLoc88, dwLoc6C, dwArg14, dwArg88, dwArgC8, out s1_345, out a0_346, out a1_347, out a3_348, out a4_349, out s2_350, out s3_351, out s4_352);
	word32 s6_363;
	word32 s5_362;
	word32 s3_361;
	word32 a5_359;
	word32 a3_357;
	word32 a0_355;
	word32 s1_354;
	word32 s0_353;
	word32 s2_360;
	word32 a4_358;
	word32 a1_356;
	struct Eq_351071 * s4_151;
	Eq_2 ra_144 = sector_iterator(ra_135, fp + -0x0080, dwArg98, out s0_353, out s1_354, out a0_355, out a1_356, out a3_357, out a4_358, out a5_359, out s2_360, out s3_361, out s4_151, out s5_362, out s6_363);
	Eq_2 s2_165 = 0x4200F000;
	while (true)
	{
		Eq_2 a4_179;
		byte * s0_182;
		struct Eq_354385 * s2_184;
		word32 a3_382;
		word32 a5_383;
		word32 s3_384;
		word32 s5_385;
		word32 s10_386;
		word32 s11_387;
		Eq_2 ra_193 = env_iterator(ra_144, fp + -0x0068, s2_165, s4_151, dwLoc74, dwArg08, dwArg48, dwArgC8, out s0_182, out a3_382, out a4_179, out a5_383, out s2_184, out s3_384, out s5_385, out s10_386, out s11_387);
		if ((word32) s2_184->b0508 == 0x00)
			break;
		word32 s1_380;
		word32 a4_381;
		ra_144 = gc_collect(ra_193, s2, s0, dwLoc28, dwLoc04, dwArg68, out s1_380, out a4_381, out s2_165, out s4_151);
	}
	*s0_182 = 0x00;
	ptr32 a3_210;
	word32 s1_374;
	word32 a4_375;
	word32 s2_376;
	word32 s3_377;
	word32 s4_378;
	word32 s5_379;
	s0Out = ef_port_env_unlock(a4_179, mstatus, dwLoc88, dwLoc6C, dwArg14, dwArg88, dwArgC8, dwArg0108, out s1_374, out a3_210, out a4_375, out s2_376, out s3_377, out s4_378, out s5_379);
	a0Out = 0x00;
	a3Out = a3_210;
	return ra_193;
}

// 23060868: Register Eq_2 ef_env_init(Register Eq_2 ra, Register Eq_348496 a0, Register int32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a0Out, Register out Eq_348496 a3Out)
// Called from:
//      easyflash_init
Eq_2 ef_env_init(Eq_2 ra, Eq_348496 a0, int32 a1, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a0Out, union Eq_348496 & a3Out)
{
	if (a0 != 0x00)
	{
		Eq_348496 a3_11 = a0;
		ptr32 a0_13 = 0x00;
		if ((word32) g_b4200F50A == 0x00)
		{
			((union Eq_2 *) ~0x00)->u0 = 1107391880;
			((union Eq_2 *) 0x07)->u0 = 1107391880;
			((union Eq_2 *) 0x0F)->u0 = 1107391880;
			((union Eq_2 *) 0x17)->u0 = 1107391880;
			Eq_2 a5_22 = 0x420174F0;
			do
			{
				*(union Eq_2 *) 0x03 = a5_22;
				a5_22 = (word32) a5_22 + 8;
			} while (a5_22 != 0x42017570);
			g_t4200F504.u0 = 0x00;
			g_t4200F4FC = a0;
			g_dw4200F500 = a1;
			Eq_2 s2_59;
			byte * s0_82;
			word32 s1_236;
			word32 a0_237;
			word32 a1_238;
			word32 a3_239;
			word32 a4_240;
			word32 s3_241;
			word32 s4_242;
			word32 s5_243;
			word32 s6_244;
			ra = ef_load_env(ef_log_debug(ra, &g_t230C032C, 0x00, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_236, out a0_237, out a1_238, out a3_239, out a4_240, out s2_59, out s3_241, out s4_242, out s5_243, out s6_244), 0x4200F50A, s2_59, mstatus, dwLoc08, dwArg04, dwArg1C, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgF8, out s0_82, out a0_13, out a3_11);
			if (a0_13 == 0x00)
				*s0_82 = 0x01;
		}
		a0Out = a0_13;
		a3Out = a3_11;
		return ra;
	}
	else
	{
		word32 s1_226;
		word32 a0_227;
		word32 a1_228;
		word32 a3_229;
		word32 a4_230;
		word32 s2_231;
		word32 s3_232;
		word32 s4_233;
		word32 s5_234;
		word32 s6_235;
		ef_log_debug(ra, &g_t230C0664, 0x230C0320, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_226, out a0_227, out a1_228, out a3_229, out a4_230, out s2_231, out s3_232, out s4_233, out s5_234, out s6_235);
		while (true)
			;
	}
}

