pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23060918: Register Eq_2 ef_port_read(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register out (ptr32 Eq_349242) a0Out, Register out (ptr32 Eq_349243) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      read_env
//      print_env_cb
//      get_next_env_addr
//      read_sector_meta_data
//      find_env
//      del_env
//      move_env
//      ef_get_env_blob
Eq_2 ef_port_read(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, struct Eq_349242 & a0Out, struct Eq_349243 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	int32 a0_14;
	struct Eq_349243 * a1_15;
	ptr32 a3_17;
	ptr32 a4_18;
	Eq_2 ra_20 = bl_mtd_read(ra, g_ptr4200F510, a0, a2, a1, out a0_14, out a1_15, out a3_17, out a4_18);
	a0Out = (word32) (a0_14 < 0) << 1;
	a1Out = a1_15;
	a3Out = a3_17;
	a4Out = a4_18;
	return ra_20;
}

// 23060938: Register Eq_2 ef_port_write(Register Eq_2 ra, Register Eq_2 s1, Register Eq_332972 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      write_status
//      format_sector.constprop.16
//      move_env
//      create_env_blob
Eq_2 ef_port_write(Eq_2 ra, Eq_2 s1, Eq_332972 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg4C, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a0_43;
	int32 a0_16;
	ptr32 a1_17;
	ptr32 a3_19;
	ptr32 a4_20;
	ptr32 a5_21;
	ptr32 s0_24;
	ptr32 s1_25;
	ptr32 s2_26;
	ptr32 s5_27;
	ptr32 s3_33;
	ptr32 s4_34;
	ptr32 s6_35;
	ptr32 s7_36;
	Eq_2 ra_23 = bl_mtd_write(ra, s1, a0, a2, a1, s2, dwArg00, dwArg04, dwArg28, dwArg4C, out s0_24, out s1_25, out a0_16, out a1_17, out a3_19, out a4_20, out a5_21, out s2_26, out s3_33, out s4_34, out s5_27, out s6_35, out s7_36);
	if (a0_16 < 0x00)
		a0_43 = 0x03;
	else
		a0_43 = 0x00;
	s0Out = s0_24;
	s1Out = s1_25;
	a0Out = a0_43;
	a1Out = a1_17;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_21;
	s2Out = s2_26;
	s3Out = s3_33;
	s4Out = s4_34;
	s5Out = s5_27;
	s6Out = s6_35;
	s7Out = s7_36;
	s10Out = s10_31;
	s11Out = s11_32;
	return ra_23;
}

// 2306095C: Register Eq_2 ef_port_env_lock(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      ef_env_set_default
//      ef_load_env
//      psm_dump_cmd
Eq_2 ef_port_env_lock(Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a0_5 = g_t4200F50C;
	ptr32 a0_11;
	ptr32 a1_12;
	ptr32 a3_14;
	ptr32 a4_15;
	ptr32 s1_19;
	ptr32 s2_20;
	ptr32 s3_21;
	ptr32 s4_22;
	word32 a2_39;
	word32 a5_40;
	word32 s8_41;
	Eq_2 s0_18 = xQueueSemaphoreTake(a0_5, ~0x00, a2, a3, a4, 0x4200F000, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, out s1_19, out a0_11, out a1_12, out a2_39, out a3_14, out a4_15, out a5_40, out s2_20, out s3_21, out s4_22, out s8_41);
	s1Out = s1_19;
	a0Out = a0_11;
	a1Out = a1_12;
	a3Out = a3_14;
	a4Out = a4_15;
	s2Out = s2_20;
	s3Out = s3_21;
	s4Out = s4_22;
	return s0_18;
}

// 2306096A: Register Eq_2 ef_port_env_unlock(Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      ef_env_set_default
//      ef_load_env
//      psm_dump_cmd
Eq_2 ef_port_env_unlock(Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a0_5 = g_t4200F50C;
	ptr32 a3_14;
	ptr32 a4_15;
	ptr32 s1_20;
	ptr32 s2_21;
	ptr32 s3_22;
	ptr32 s4_23;
	ptr32 s5_24;
	word32 a0_47;
	word32 a1_48;
	word32 a2_49;
	word32 a5_50;
	word32 a7_51;
	word32 s6_52;
	word32 s8_53;
	Eq_2 s0_19 = xQueueGenericSend(a0_5, 0x00, 0x00, a4, 0x4200F000, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_20, out a0_47, out a1_48, out a2_49, out a3_14, out a4_15, out a5_50, out a7_51, out s2_21, out s3_22, out s4_23, out s5_24, out s6_52, out s8_53);
	s1Out = s1_20;
	a3Out = a3_14;
	a4Out = a4_15;
	s2Out = s2_21;
	s3Out = s3_22;
	s4Out = s4_23;
	s5Out = s5_24;
	return s0_19;
}

// 2306097C: Register Eq_2 ef_log_debug(Register Eq_2 ra, Register (ptr32 Eq_274) a2, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      write_status
//      read_env
//      format_sector.constprop.16
//      read_sector_meta_data
//      alloc_env
//      gc_collect
//      new_env
//      del_env
//      move_env
//      check_and_recovery_env_cb
//      do_gc
//      create_env_blob
//      ef_env_set_default
//      ef_env_init
//      ef_port_erase
Eq_2 ef_log_debug(Eq_2 ra, struct Eq_274 * a2, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_21;
	ptr32 a1_22;
	ptr32 a3_24;
	ptr32 a4_25;
	ptr32 s1_28;
	ptr32 s2_31;
	ptr32 s3_32;
	ptr32 s4_33;
	ptr32 s5_34;
	ptr32 s6_35;
	word32 a2_68;
	word32 a5_69;
	word32 a7_70;
	word32 s7_71;
	word32 s8_72;
	word32 s9_73;
	word32 s10_74;
	word32 s11_75;
	word32 t4_76;
	Eq_2 ra_27 = vprint(ra, a2, fp + -20, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_28, out a0_21, out a1_22, out a2_68, out a3_24, out a4_25, out a5_69, out a7_70, out s2_31, out s3_32, out s4_33, out s5_34, out s6_35, out s7_71, out s8_72, out s9_73, out s10_74, out s11_75, out t4_76);
	s1Out = s1_28;
	a0Out = a0_21;
	a1Out = a1_22;
	a3Out = a3_24;
	a4Out = a4_25;
	s2Out = s2_31;
	s3Out = s3_32;
	s4Out = s4_33;
	s5Out = s5_34;
	s6Out = s6_35;
	return ra_27;
}

// 2306099A: Register Eq_2 ef_port_erase(Register Eq_2 ra, Register Eq_332972 a0, Register Eq_2 a1, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_349642 a0Out, Register out ptr32 a1Out, Register out ptr32 a4Out)
// Called from:
//      format_sector.constprop.16
Eq_2 ef_port_erase(Eq_2 ra, Eq_332972 a0, Eq_2 a1, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_349642 & a0Out, ptr32 & a1Out, ptr32 & a4Out)
{
	if (a0 << 0x14 == 0x00)
	{
		uint32 a0_13;
		ptr32 a1_14;
		ptr32 a4_16;
		Eq_2 ra_18 = bl_mtd_erase(ra, g_ptr4200F510, a0, a1, out a0_13, out a1_14, out a4_16);
		a0Out = a0_13 >> 31;
		a1Out = a1_14;
		a4Out = a4_16;
		return ra_18;
	}
	else
	{
		word32 s1_64;
		word32 a0_65;
		word32 a1_66;
		word32 a3_67;
		word32 a4_68;
		word32 s2_69;
		word32 s3_70;
		word32 s4_71;
		word32 s5_72;
		word32 s6_73;
		ef_log_debug(ra, &g_t230C0664, 587990780, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_64, out a0_65, out a1_66, out a3_67, out a4_68, out s2_69, out s3_70, out s4_71, out s5_72, out s6_73);
		while (true)
			;
	}
}

// 230609E6: Register Eq_2 ef_log_info(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 ptr32) a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_348620) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      easyflash_init
//      check_sec_hdr_cb
//      read_sector_meta_data
//      check_and_recovery_env_cb
//      create_env_blob
//      ef_get_env_blob
//      ef_get_env
//      ef_del_env
//      ef_set_env
//      ef_load_env
//      ef_port_init
//      psm_dump_cmd
Eq_2 ef_log_info(Eq_2 ra, struct Eq_274 * a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_348620 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_348620 * a5_23;
	ptr32 a0_24;
	ptr32 * a1_25;
	ptr32 a2_26;
	ptr32 a3_27;
	ptr32 a4_28;
	ptr32 s1_31;
	ptr32 s10_32;
	ptr32 s11_33;
	ptr32 s2_34;
	ptr32 s3_35;
	ptr32 s4_36;
	ptr32 s5_37;
	ptr32 s6_38;
	ptr32 s7_39;
	ptr32 s9_41;
	word32 a7_79;
	word32 s8_80;
	word32 t4_81;
	Eq_2 ra_30 = vprint(ra, a0, fp + -28, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_31, out a0_24, out a1_25, out a2_26, out a3_27, out a4_28, out a5_23, out a7_79, out s2_34, out s3_35, out s4_36, out s5_37, out s6_38, out s7_39, out s8_80, out s9_41, out s10_32, out s11_33, out t4_81);
	s1Out = s1_31;
	a0Out = a0_24;
	a1Out = a1_25;
	a2Out = a2_26;
	a3Out = a3_27;
	a4Out = a4_28;
	a5Out = a5_23;
	s2Out = s2_34;
	s3Out = s3_35;
	s4Out = s4_36;
	s5Out = s5_37;
	s6Out = s6_38;
	s7Out = s7_39;
	s9Out = s9_41;
	s10Out = s10_32;
	s11Out = s11_33;
	return ra_30;
}

// 23060A06: Register Eq_2 ef_port_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out)
// Called from:
//      easyflash_init
Eq_2 ef_port_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out)
{
	int32 a0_27;
	Eq_2 a3_30;
	Eq_2 s0_34;
	union Eq_2 * s2_36;
	word32 s5_227;
	word32 s6_228;
	Eq_2 ra_43 = bl_mtd_open(ra, 587990888, a3, a4, a5, s3, mstatus, s2, s0, dwArg10, dwArg14, dwArg38, dwArg5C, dwArg84, dwArg98, dwArgD8, dwArgF8, dwArg0118, out s0_34, out a0_27, out a3_30, out s2_36, out s5_227, out s6_228);
	if (a0_27 >= 0x00)
	{
		Eq_2 a3_60;
		word32 t1_229;
		word32 a0_230;
		word32 a1_231;
		word32 a2_232;
		word32 a4_233;
		word32 a5_234;
		Eq_2 ra_63 = memset(ra_43, fp + -44, 0x00, 0x1C, out t1_229, out a0_230, out a1_231, out a2_232, out a3_60, out a4_233, out a5_234);
		bl_mtd_info(*s2_36, fp + -44);
		Eq_2 a3_82;
		word32 s1_87;
		word32 a0_235;
		word32 a1_236;
		word32 a2_237;
		word32 a4_238;
		word32 a5_239;
		word32 s2_240;
		word32 s3_241;
		word32 s4_242;
		word32 s5_243;
		word32 s6_244;
		word32 s7_245;
		word32 s9_246;
		word32 s10_247;
		word32 s11_248;
		Eq_2 ra_86 = ef_log_info(ra_63, &g_t230C07E4, a3_60, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_87, out a0_235, out a1_236, out a2_237, out a3_82, out a4_238, out a5_239, out s2_240, out s3_241, out s4_242, out s5_243, out s6_244, out s7_245, out s9_246, out s10_247, out s11_248);
		g_dw230C06F0 = s1_87;
		*(union Eq_2 *) 0x01 = s0_34;
		Eq_2 a5_110;
		Eq_2 a3_114;
		Eq_2 a4_115;
		word32 s1_249;
		word32 a0_250;
		word32 a1_251;
		word32 a2_252;
		word32 a7_253;
		word32 s2_254;
		word32 s3_255;
		word32 s4_256;
		word32 s5_257;
		word32 s6_258;
		word32 s7_259;
		word32 s8_260;
		word32 s9_261;
		word32 s10_262;
		word32 s11_263;
		word32 t4_264;
		Eq_2 ra_117 = printf(ra_86, &g_t230C0828, a3_82, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_249, out a0_250, out a1_251, out a2_252, out a3_114, out a4_115, out a5_110, out a7_253, out s2_254, out s3_255, out s4_256, out s5_257, out s6_258, out s7_259, out s8_260, out s9_261, out s10_262, out s11_263, out t4_264);
		ptr32 a1_132;
		ptr32 a3_134;
		Eq_2 a0_145;
		word32 a4_265;
		word32 a5_266;
		word32 s2_267;
		word32 s3_268;
		xQueueCreateMutex(ra_117, a3_114, a4_115, a5_110, mstatus, s2, s0, ra, dwArgD8, dwArg0118, dwArg0158, out a0_145, out a1_132, out a3_134, out a4_265, out a5_266, out s2_267, out s3_268);
		g_t4200F50C = a0_145;
		0x00 = (int8) dwArg0128;
		a0Out = 0x00;
		a1Out = a1_132;
		a3Out = a3_134;
		return ra_117;
	}
	else
	{
		word32 s1_269;
		word32 a0_270;
		word32 a1_271;
		word32 a2_272;
		word32 a3_273;
		word32 a4_274;
		word32 a5_275;
		word32 s2_276;
		word32 s3_277;
		word32 s4_278;
		word32 s5_279;
		word32 s6_280;
		word32 s7_281;
		word32 s9_282;
		word32 s10_283;
		word32 s11_284;
		ef_log_info(ra_43, &g_t230C076C, a3_30, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_269, out a0_270, out a1_271, out a2_272, out a3_273, out a4_274, out a5_275, out s2_276, out s3_277, out s4_278, out s5_279, out s6_280, out s7_281, out s9_282, out s10_283, out s11_284);
		word32 a0_285;
		word32 a1_286;
		word32 a2_287;
		word32 a4_288;
		word32 a5_289;
		word32 s4_290;
		word32 s8_291;
		puts(0x230C07A0, out a0_285, out a1_286, out a2_287, out a4_288, out a5_289, out s4_290, out s8_291);
		while (true)
			;
	}
}

// 23060AAA: Register Eq_2 ef_print(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_349932 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_349935 s6Out, Register out ptr32 s7Out)
// Called from:
//      print_env_cb
//      psm_dump_cmd
Eq_2 ef_print(Eq_2 ra, struct Eq_274 * a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_349932 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_349935 & s6Out, ptr32 & s7Out)
{
	ptr32 a5_23;
	ptr32 a0_24;
	ptr32 a1_25;
	ptr32 a3_27;
	ptr32 a4_28;
	ptr32 s1_31;
	Eq_349932 s2_34;
	ptr32 s3_35;
	ptr32 s4_36;
	Eq_349935 s6_38;
	ptr32 s7_39;
	word32 a2_74;
	word32 a7_75;
	word32 s5_76;
	word32 s8_77;
	word32 s9_78;
	word32 s10_79;
	word32 s11_80;
	word32 t4_81;
	Eq_2 ra_30 = vprint(ra, a0, fp + -28, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_31, out a0_24, out a1_25, out a2_74, out a3_27, out a4_28, out a5_23, out a7_75, out s2_34, out s3_35, out s4_36, out s5_76, out s6_38, out s7_39, out s8_77, out s9_78, out s10_79, out s11_80, out t4_81);
	s1Out = s1_31;
	a0Out = a0_24;
	a1Out = a1_25;
	a3Out = a3_27;
	a4Out = a4_28;
	a5Out = a5_23;
	s2Out = s2_34;
	s3Out = s3_35;
	s4Out = s4_36;
	s6Out = s6_38;
	s7Out = s7_39;
	return ra_30;
}

// 23060ACA: Register (ptr32 Eq_348801) ef_calc_crc32(Register (ptr32 Eq_348801) a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a2Out, Register out (ptr32 Eq_348808) a4Out, Register out Eq_348809 a5Out)
// Called from:
//      update_env_cache
//      read_env
//      find_env
//      create_env_blob
struct Eq_348801 * ef_calc_crc32(struct Eq_348801 * a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a2Out, struct Eq_348808 & a4Out, union Eq_348809 & a5Out)
{
	uint32 a0_15 = ~a0;
	word32 a2_8 = a2 + a1;
	while (a1 != a2_8)
	{
		a1 = (word32) a1 + 1;
		a5 = *((char *) g_a230C0854 + (((word32) (*((word32) a1 - 1)) ^ a0_15) & 0x00FF) * 0x04);
		a0_15 = a0_15 >> 8 ^ a5;
	}
	a2Out = a2_8;
	a4Out = (struct Eq_348808 *) g_a230C0854;
	a5Out = a5;
	return ~a0_15;
}

