pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23060AFA: void psm_get_cmd()
void psm_get_cmd()
{
}

// 23060AFC: void psm_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void psm_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s7, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	word32 a6_1145;
	word32 a1_1143;
	word32 a7_1146;
	word32 a2_1144;
	Eq_2 a5_36;
	Eq_2 a3_367;
	Eq_2 a4_35;
	memcpy(fp + -88, 0x230C0C54, 0x18, out a1_1143, out a2_1144, out a3_367, out a4_35, out a5_36, out a6_1145, out a7_1146);
	Eq_2 s0_34 = fp + -88;
	Eq_2 s5_142 = 0x230C1000;
	s1_247 = s1;
	do
	{
		Eq_2 a2_242;
		Eq_2 a5_238;
		Eq_2 s2_250;
		Eq_2 s1_247;
		Eq_2 s6_55 = *s0_34;
		Eq_2 a0_66;
		Eq_2 a3_69;
		Eq_2 a4_70;
		Eq_2 a5_71;
		Eq_2 s3_76;
		word32 s1_1184;
		word32 a1_1185;
		word32 a2_1186;
		word32 s2_1188;
		word32 s8_1190;
		word32 s4_1189;
		word32 a6_1187;
		pvPortMalloc(ra, s1_247, (word32) s6_55 + 1, a3_367, a4_35, a5_36, mstatus, dwLoc20, dwLoc1C, dwArg2C, dwArgD8, dwArg0118, out s1_1184, out a0_66, out a1_1185, out a2_1186, out a3_69, out a4_70, out a5_71, out a6_1187, out s2_1188, out s3_76, out s4_1189, out s8_1190);
		Eq_2 a0_83;
		Eq_2 s1_91;
		Eq_2 s3_93;
		Eq_2 s4_94;
		word32 s8_95;
		word32 a4_1194;
		word32 a5_1195;
		word32 a6_1196;
		word32 s2_1197;
		word32 a2_1192;
		word32 a3_1193;
		word32 a1_1191;
		Eq_2 s0_407 = pvPortMalloc(ra, a0_66, s3_76, a3_69, a4_70, a5_71, mstatus, dwLoc20, dwLoc1C, dwArg2C, dwArgD8, dwArg0118, out s1_91, out a0_83, out a1_1191, out a2_1192, out a3_1193, out a4_1194, out a5_1195, out a6_1196, out s2_1197, out s3_93, out s4_94, out s8_95);
		if (s1_91 != 0x00 && a0_83 != 0x00)
		{
			word32 a5_1159;
			word32 a0_1155;
			word32 a3_1151;
			word32 t1_1147;
			word32 a1_1156;
			word32 a2_1157;
			word32 a4_1158;
			word32 a4_1152;
			word32 a5_1153;
			word32 t1_1154;
			word32 a0_1148;
			word32 a1_1149;
			word32 a2_1150;
			Eq_2 a3_117;
			Eq_2 ra_120 = memset(memset(ra, s1_91, 0x00, s3_93, out t1_1147, out a0_1148, out a1_1149, out a2_1150, out a3_1151, out a4_1152, out a5_1153), a0_83, 0x00, s3_93, out t1_1154, out a0_1155, out a1_1156, out a2_1157, out a3_117, out a4_1158, out a5_1159);
			Eq_2 s10_123 = 0x00;
			while (s10_123 != s6_55)
			{
				a3_117 = s1_91 + s10_123;
				*a3_117 = 118;
				s10_123 = (word32) s10_123 + 1;
			}
			struct Eq_274 * a0_276;
			ptr32 s2_160;
			Eq_2 s3_161;
			word32 s8_166;
			Eq_2 a0_180;
			Eq_2 s1_190;
			Eq_2 s10_191;
			word32 s11_192;
			Eq_2 s2_193;
			struct Eq_355363 * s4_195;
			word32 s5_196;
			word32 s9_200;
			word32 s1_1199;
			word32 s0_1201;
			word32 s3_1202;
			word32 s4_1200;
			word32 s0_1198;
			Eq_2 ra_188 = ef_get_env_blob(ef_set_env_blob(ra_120, s0_407, s8_95 + -0x0334, s1_91, s10_123, a3_117, a0_83, s3_93, s4_94, s5_142, s6_55, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc50, dwLoc4C, s10, s2, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc20, dwLoc1C, dwLoc14, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg2C, s1, dwArg58, dwArg68, dwArg88, dwArgC8, dwArg0108, out s0_1198, out s1_1199, out s2_160, out s3_161, out s4_1200, out s8_166), s8_166 + -0x0334, s2_160, fp + -92, s3_161, mstatus, dwLoc58, dwLoc4C, dwLoc08, dwArg28, dwArg68, dwArgA8, out s0_1201, out s1_190, out a0_180, out s2_193, out s3_1202, out s4_195, out s5_196, out s9_200, out s10_191, out s11_192);
			if (s9_200 == 0x00 && s10_191 == a0_180)
			{
				word32 a3_1205;
				word32 a4_1206;
				word32 a5_1207;
				word32 a1_1203;
				word32 a2_1204;
				Eq_2 a0_212 = memcmp(s2_193, s1_190, a0_180, out a1_1203, out a2_1204, out a3_1205, out a4_1206, out a5_1207);
				int32 a5_218 = s4_195->dw0560;
				if (a0_212 != 0x00)
				{
					if (a5_218 != 0x00)
					{
						word32 a5_1211;
						xTaskGetTickCountFromISR(out a5_1211);
					}
					else
					{
						word32 a5_1210;
						xTaskGetTickCount(out a5_1210);
					}
					a0_276 = (struct Eq_274 *) &g_t230C0D5C;
					goto l23060C38;
				}
				if (a5_218 != 0x00)
				{
					word32 a5_1225;
					xTaskGetTickCountFromISR(out a5_1225);
				}
				else
				{
					word32 a5_1224;
					xTaskGetTickCount(out a5_1224);
				}
				word32 a4_1229;
				word32 s3_1230;
				word32 s4_1231;
				word32 s6_1232;
				word32 s8_1234;
				word32 s10_1236;
				word32 s11_1237;
				word32 s9_1235;
				word32 s7_1233;
				word32 a1_1227;
				word32 a3_1228;
				word32 a0_1226;
				ra = bl_printk(ra_188, s11_192 + -592, s5_196 + -884, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_247, out a0_1226, out a1_1227, out a2_242, out a3_1228, out a4_1229, out a5_238, out s2_250, out s3_1230, out s4_1231, out s5_142, out s6_1232, out s7_1233, out s8_1234, out s9_1235, out s10_1236, out s11_1237);
			}
			else
			{
				if (s4_195->dw0560 != 0x00)
				{
					word32 a5_1209;
					xTaskGetTickCountFromISR(out a5_1209);
				}
				else
				{
					word32 a5_1208;
					xTaskGetTickCount(out a5_1208);
				}
				a0_276 = (struct Eq_274 *) &g_t230C0D10;
l23060C38:
				word32 s3_1216;
				word32 s4_1217;
				word32 s6_1218;
				word32 s7_1219;
				word32 s8_1220;
				word32 s9_1221;
				word32 s11_1223;
				word32 s10_1222;
				word32 a3_1214;
				word32 a4_1215;
				word32 a0_1212;
				word32 a1_1213;
				ra = bl_printk(ra_188, a0_276, s5_196 + -884, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_247, out a0_1212, out a1_1213, out a2_242, out a3_1214, out a4_1215, out a5_238, out s2_250, out s3_1216, out s4_1217, out s5_142, out s6_1218, out s7_1219, out s8_1220, out s9_1221, out s10_1222, out s11_1223);
			}
			goto l23060B82;
		}
		if (*((word32) s4_94 + 0x0560) != 0x00)
		{
			word32 a5_1161;
			xTaskGetTickCountFromISR(out a5_1161);
		}
		else
		{
			word32 a5_1160;
			xTaskGetTickCount(out a5_1160);
		}
		word32 s4_1170;
		word32 s6_1171;
		word32 s7_1172;
		word32 s8_1173;
		word32 s10_1175;
		word32 s11_1176;
		word32 s9_1174;
		word32 a1_1168;
		word32 s3_1169;
		word32 a0_1167;
		ra = bl_printk(ra, &g_t230C0C9C, (word32) s5_142 - 884, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_247, out a0_1167, out a1_1168, out a2_242, out a3_367, out a4_35, out a5_238, out s2_250, out s3_1169, out s4_1170, out s5_142, out s6_1171, out s7_1172, out s8_1173, out s9_1174, out s10_1175, out s11_1176);
		if (s1_247 != 0x00)
		{
l23060B82:
			word32 a0_1162;
			word32 a6_1164;
			word32 t3_1166;
			word32 s4_1165;
			word32 a1_1163;
			vPortFree(s1_247, a2_242, a5_238, mstatus, dwArgF8, dwArg0138, out s0_407, out s1_247, out a0_1162, out a1_1163, out a2_242, out a3_367, out a4_35, out a5_238, out a6_1164, out s4_1165, out t3_1166);
		}
		if (s2_250 != 0x00)
		{
			word32 a6_1181;
			word32 s4_1182;
			word32 t3_1183;
			word32 a2_1179;
			word32 a5_1180;
			word32 a0_1177;
			word32 a1_1178;
			vPortFree(s2_250, a2_242, a5_238, mstatus, dwArgF8, dwArg0138, out s0_407, out s1_247, out a0_1177, out a1_1178, out a2_1179, out a3_367, out a4_35, out a5_1180, out a6_1181, out s4_1182, out t3_1183);
		}
		s0_34 = (word32) s0_407 + 4;
		a5_36 = fp + -64;
	} while (s0_34 != fp + -64);
	ef_del_env(ra, s0_34, 0x230C0CCC, a3_367, mstatus, dwLoc5C, dwLoc58, dwLoc28, dwLoc10, dwLoc0C, dwArg18, dwArg24, s7, dwArg98, dwArgD8, dwArg0118);
}

// 23060CB6: void psm_erase_cmd(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void psm_erase_cmd(Eq_2 ra, Eq_2 s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 a2_54;
	word32 a3_55;
	word32 a4_56;
	ef_env_set_default(ra, s0, a2, a3, a4, s2, s4, s5, mstatus, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg2C, dwArg3C, dwArg58, dwArg6C, dwArg88, dwArgC8, dwArg0108, dwArg0148, out a2_54, out a3_55, out a4_56);
}

// 23060CBA: void psm_dump_cmd(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
void psm_dump_cmd(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	ef_print_env(ra, a2, a3, a4, mstatus, dwArg00, dwArg04, dwArg28, dwArg34, dwArg4C, dwArg68, dwArgA8, dwArgE8, dwArg0128);
}

// 23060CBE: void psm_unset_cmd(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void psm_unset_cmd(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	if (a2 == 0x02)
	{
		ef_del_env(ra, s0, a0, *((word32) a0 + 4), mstatus, dwLoc0C, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg68, ra, dwArg8C, dwArgE8, dwArg0128, dwArg0168);
		ef_save_env();
	}
	else
	{
		word32 s1_120;
		word32 a0_121;
		word32 a1_122;
		word32 a2_123;
		word32 a3_124;
		word32 a4_125;
		word32 a5_126;
		word32 a7_127;
		word32 s2_128;
		word32 s3_129;
		word32 s4_130;
		word32 s5_131;
		word32 s6_132;
		word32 s7_133;
		word32 s8_134;
		word32 s9_135;
		word32 s10_136;
		word32 s11_137;
		word32 t4_138;
		printf(ra, &g_t230C0E00, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_120, out a0_121, out a1_122, out a2_123, out a3_124, out a4_125, out a5_126, out a7_127, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134, out s9_135, out s10_136, out s11_137, out t4_138);
	}
}

// 23060CE2: void psm_set_cmd(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void psm_set_cmd(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if (a2 == 0x03)
	{
		word32 s0_141;
		word32 s1_142;
		word32 s4_143;
		ef_set_env(ra, a0, a1, s2, s3, s4, s5, s6, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg3C, dwArg58, dwArg64, dwArg68, dwArg6C, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArg0118, dwArg0158, out s0_141, out s1_142, out s4_143);
		ef_save_env();
	}
	else
	{
		word32 s1_144;
		word32 a0_145;
		word32 a1_146;
		word32 a2_147;
		word32 a3_148;
		word32 a4_149;
		word32 a5_150;
		word32 a7_151;
		word32 s2_152;
		word32 s3_153;
		word32 s4_154;
		word32 s5_155;
		word32 s6_156;
		word32 s7_157;
		word32 s8_158;
		word32 s9_159;
		word32 s10_160;
		word32 s11_161;
		word32 t4_162;
		printf(ra, &g_t230C0C6C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_144, out a0_145, out a1_146, out a2_147, out a3_148, out a4_149, out a5_150, out a7_151, out s2_152, out s3_153, out s4_154, out s5_155, out s6_156, out s7_157, out s8_158, out s9_159, out s10_160, out s11_161, out t4_162);
	}
}

// 23060D08: void easyflash_cli_init()
// Called from:
//      aos_loop_proc
void easyflash_cli_init()
{
}

