pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23060D0C: Register (ptr32 Eq_125394) xEventGroupCreateStatic(Register (ptr32 Eq_125394) a0, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a4Out, Register out (ptr32 Eq_125398) a5Out)
// Called from:
//      cmd_mgr_queue
struct Eq_125394 * xEventGroupCreateStatic(struct Eq_125394 * a0, Eq_2 a4, ptr32 mstatus, union Eq_2 & a4Out, struct Eq_125398 & a5Out)
{
	struct Eq_125398 * a5_14;
	if (a0 != null)
	{
		if (a4 != 32)
		{
			word32 a5_57;
			user_vAssertCalled(a4, mstatus, out a5_57);
		}
		a0->dw0000 = 0x00;
		a4 = vListInitialise(&a0->dw0000 + 1);
		a0->b001C = 0x01;
		a5_14 = (struct Eq_125398 *) 0x01;
	}
	else
	{
		word32 a5_56;
		user_vAssertCalled(a4, mstatus, out a5_56);
		a5_14 = (struct Eq_125398 *) 32;
		if (a4 != 32)
			user_vAssertCalled(a4, mstatus, out a5_14);
	}
	a4Out = a4;
	a5Out = a5_14;
	return a0;
}

// 23060D58: Register (ptr32 int32) xEventGroupWaitBits(Register (ptr32 int32) a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_125501 a5Out, Register out Eq_2 s3Out)
// Called from:
//      cmd_mgr_queue
int32 * xEventGroupWaitBits(int32 * a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_125501 & a5Out, union Eq_2 & s3Out)
{
	Eq_2 s3_146 = a4;
	if (a0 == null)
	{
		word32 a5_467;
		user_vAssertCalled(a4, mstatus, out a5_467);
	}
	Eq_2 a3_165;
	Eq_125501 a5_167;
	Eq_2 a4_160;
	int32 * s0_201;
	int32 s0_229;
	Eq_2 a4_114;
	Eq_2 a5_203;
	if ((a1 & 0xFF000000) == 0x00 && a1 != 0x00)
	{
		word32 a5_470;
		if (xTaskGetSchedulerState(out a5_470) != 0x00)
			goto l23060D84;
	}
	else
	{
		word32 a5_468;
		user_vAssertCalled(a4, mstatus, out a5_468);
		word32 a5_469;
		if (xTaskGetSchedulerState(out a5_469) != 0x00)
			goto l23060D84;
	}
	if (a4 != 0x00)
	{
		word32 a5_490;
		user_vAssertCalled(a4, mstatus, out a5_490);
		word32 a5_491;
		a4_114 = vTaskSuspendAll(a4, out a5_491);
		s0_229 = *a0;
		a5_203 = a1 & s0_229;
		if (a3 == 0x00)
		{
l23060D94:
			if (a5_203 != 0x00)
			{
l23060D96:
				if (a2 != 0x00)
				{
					*a0 = ~a1 & s0_229;
					word32 s1_478;
					word32 t3_483;
					word32 a0_479;
					word32 s4_482;
					word32 a2_480;
					word32 a6_481;
					xTaskResumeAll(a3, a4_114, a5_203, mstatus, dwArg0128, dwArg0168, out s0_201, out s1_478, out a0_479, out a2_480, out a3_165, out a4_160, out a5_167, out a6_481, out s4_482, out t3_483);
					goto l23060DA8;
				}
l23060E1E:
				word32 s1_472;
				word32 a0_473;
				word32 s4_476;
				word32 a2_474;
				word32 t3_477;
				word32 a6_475;
				xTaskResumeAll(a3, a4_114, a5_203, mstatus, dwArg0128, dwArg0168, out s0_201, out s1_472, out a0_473, out a2_474, out a3_165, out a4_160, out a5_167, out a6_475, out s4_476, out t3_477);
				goto l23060DA8;
			}
l23060DCC:
			if (a4 == 0x00)
				goto l23060E1E;
			ui32 a1_89 = (word32) (a2 != 0x00);
			ui32 a1_90 = a1_89 << 24;
			if (a3 != 0x00)
				a1_90 = a1_89 << 24 | 0x04000000;
			Eq_2 a5_141;
			int32 * s2_145;
			ui32 s1_155;
			word32 s4_156;
			struct Eq_355915 * a3_159;
			word32 s0_484;
			word32 a5_486;
			word32 a2_485;
			word32 a6_487;
			word32 t3_488;
			int32 a0_150;
			xTaskResumeAll(a3, vTaskPlaceOnUnorderedEventList(a0 + 1, a1_90 | a1, a4, a3, a4_114, mstatus, dwLoc0C, dwArg18, out a5_141, out s2_145, out s3_146), a5_141, mstatus, dwArg0128, dwArg0168, out s0_484, out s1_155, out a0_150, out a2_485, out a3_159, out a4_160, out a5_486, out a6_487, out s4_156, out t3_488);
			if (a0_150 == 0x00)
				__syscall();
			a3_165 = uxTaskResetEventItemValue(a3_159, a4_160);
			a5_167 = a0_150 << 0x06;
			if (a0_150 << 0x06 < 0x00)
			{
l23060DFC:
				s0_201 = (word32) (word24) a0_150;
l23060DA8:
				0x00 = (int8) dwArg0128;
				a2Out = dwArg0100;
				a3Out = a3_165;
				a4Out = a4_160;
				a5Out = a5_167;
				s3Out = s3_146;
				return s0_201;
			}
			word32 a5_489;
			vTaskEnterCritical(a4_160, mstatus, out a5_489);
			a0_150 = *s2_145;
			ui32 a5_175 = s1_155 & a0_150;
			if (s4_156 == 0x00)
			{
				if (a5_175 == 0x00)
					goto l23060E52;
			}
			else if (s1_155 != a5_175)
				goto l23060E52;
			if (a2 != 0x00)
				*s2_145 = ~s1_155 & a0_150;
l23060E52:
			a3_165 = vTaskExitCritical(a3_165, mstatus, out a4_160, out a5_167);
			goto l23060DFC;
		}
l23060DC8:
		if (a1 == a5_203)
			goto l23060D96;
		goto l23060DCC;
	}
l23060D84:
	word32 a5_471;
	a4_114 = vTaskSuspendAll(a4, out a5_471);
	s0_229 = *a0;
	a5_203 = a1 & s0_229;
	if (a3 == 0x00)
		goto l23060D94;
	goto l23060DC8;
}

// 23060E62: Register Eq_2 xEventGroupSetBits(Register Eq_2 s0, Register ptr32 a0, Register Eq_124698 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack (ptr32 Eq_124604) dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_2) s1Out, Register out (ptr32 (ptr32 Eq_2)) a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_2) a4Out, Register out (ptr32 Eq_124710) a5Out, Register out Eq_124698 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_124604) s4Out)
// Called from:
//      cmd_complete.isra.1
//      cmd_mgr_drain
Eq_2 xEventGroupSetBits(Eq_2 s0, ptr32 a0, Eq_124698 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_124604 * dwArg04, Eq_2 dwArg24, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, struct Eq_124710 & a5Out, union Eq_124698 & s2Out, ptr32 & s3Out, struct Eq_124604 & s4Out)
{
	Eq_124698 s2_156 = a1;
	if (a0 == 0x00)
	{
		word32 a5_270;
		user_vAssertCalled(a4, mstatus, out a5_270);
	}
	if ((a1 & 0xFF000000) != 0x00)
	{
		word32 a5_271;
		user_vAssertCalled(a4, mstatus, out a5_271);
	}
	word32 s1_101;
	Eq_2 a5_119;
	Eq_2 a4_126 = vTaskSuspendAll(a4, out a5_119);
	word32 s1_44 = *((word32) s0 + 16);
	Eq_2 a3_110 = a1 | a3;
	*a3_110 = s1_44;
	s1_101 = s1_44;
	if (s1_44 + 0x0C != s0)
	{
		ui32 s5_106 = 0x00;
		s2_156.u0 = 0x00FFFFFF;
		ui32 s4_155 = 0x02000000;
		s1_101 = s1_44;
		do
		{
			Eq_2 a2_61 = a4_126 & s2_156;
			ui32 a1_59 = a3_110 | s4_155;
			a5_119 = a4_126 << 0x05;
			Eq_2 a6_63 = a2_61 & a3_110;
			struct Eq_124604 * s0_105 = *((word32) *a4_126 + 4);
			if (a5_119 >= 0x00)
			{
				if (a6_63 != 0x00)
					goto l23060EC2;
			}
			else
			{
				if (a2_61 != a6_63)
				{
					if (s1_44 + 0x0C == s0_105)
						break;
					continue;
				}
l23060EC2:
				if (a4_126 << 0x07 < 0x00)
					s5_106 |= a2_61;
				word32 s1_278;
				word32 a0_279;
				word32 a2_280;
				s0_105 = vTaskRemoveFromUnorderedEventList(s0_105, a1_59, a2_61, a3_110, a4_126, mstatus, dwArg04, dwArg24, out s1_278, out a0_279, out a2_280, out a3_110, out a4_126, out a5_119, out s2_156, out s4_155);
				s1_101 = (word32) *a3_110;
			}
		} while (s1_44 + 0x0C != s0_105);
		a3_110 &= ~s5_106;
	}
	*a3_110 = s1_101;
	union Eq_2 ** a0_134;
	struct Eq_124710 * a5_136;
	ptr32 a3_143;
	union Eq_2 * a4_144;
	word32 s4_276;
	word32 t3_277;
	word32 s0_272;
	word32 s1_273;
	word32 a2_274;
	word32 a6_275;
	xTaskResumeAll(a3_110, a4_126, a5_119, mstatus, dwArg0138, dwArg0178, out s0_272, out s1_273, out a0_134, out a2_274, out a3_143, out a4_144, out a5_136, out a6_275, out s4_276, out t3_277);
	s1Out = (union Eq_2 *) *a0_134;
	a0Out = a0_134;
	a3Out = a3_143;
	a4Out = a4_144;
	a5Out = a5_136;
	s2Out = s2_156;
	s3Out = s1_44 + 0x0C;
	s4Out = dwArg04;
	return s1;
}

// 23060F10: void vEventGroupDelete(Register (ptr32 Eq_125482) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack (ptr32 Eq_124604) dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198)
// Called from:
//      cmd_mgr_queue
void vEventGroupDelete(struct Eq_125482 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_124604 * dwArg14, Eq_2 dwArg34, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0188, Eq_2 dwArg0198)
{
	struct Eq_356144 * a5_14;
	Eq_2 a4_13 = vTaskSuspendAll(a4, out a5_14);
	Eq_2 s0_15 = a5_14->t0004;
	struct Eq_125482 * s1_16 = (word32) s0_15 + 0x0C;
	if (a5_14 != null)
	{
		do
		{
			struct Eq_124604 * s0_19 = a0->ptr0010;
			if (a0 == s1_16)
			{
				struct Eq_356189 * a5_50;
				word32 a5_161;
				word32 s2_162;
				word32 s4_163;
				vTaskRemoveFromUnorderedEventList(a0->ptr0010, 0x02000000, user_vAssertCalled(a4_13, mstatus, out a5_161), a3, a4_13, mstatus, dwArg14, dwArg34, out s1_16, out a0, out a2, out a3, out a4_13, out a5_50, out s2_162, out s4_163);
				s0_15 = a5_50->t0004;
				if (a5_50 == null)
					break;
				continue;
			}
			struct Eq_356170 * a5_32;
			word32 s4_160;
			word32 s2_159;
			vTaskRemoveFromUnorderedEventList(s0_19, 0x02000000, a2, a3, a4_13, mstatus, dwArg14, dwArg34, out s1_16, out a0, out a2, out a3, out a4_13, out a5_32, out s2_159, out s4_160);
			s0_15 = a5_32->t0004;
		} while (a5_32 != null);
	}
	Eq_2 a5_61 = (word32) *((word32) s0_15 + 28);
	if (a5_61 == 0x00)
	{
		Eq_2 a3_69;
		Eq_2 a4_70;
		Eq_2 a5_71;
		word32 s0_164;
		word32 s1_165;
		word32 a0_166;
		word32 a1_167;
		word32 a2_168;
		word32 a6_169;
		word32 s4_170;
		word32 t3_171;
		vPortFree(s0_15, a2, a5_61, mstatus, dwArg0148, dwArg0188, out s0_164, out s1_165, out a0_166, out a1_167, out a2_168, out a3_69, out a4_70, out a5_71, out a6_169, out s4_170, out t3_171);
		word32 s0_182;
		word32 s1_183;
		word32 a0_184;
		word32 a2_185;
		word32 a3_186;
		word32 a4_187;
		word32 a5_188;
		word32 a6_189;
		word32 s4_190;
		word32 t3_191;
		xTaskResumeAll(a3_69, a4_70, a5_71, mstatus, dwArg0158, dwArg0198, out s0_182, out s1_183, out a0_184, out a2_185, out a3_186, out a4_187, out a5_188, out a6_189, out s4_190, out t3_191);
	}
	else
	{
		word32 s0_172;
		word32 s1_173;
		word32 a0_174;
		word32 a2_175;
		word32 a3_176;
		word32 a4_177;
		word32 a5_178;
		word32 a6_179;
		word32 s4_180;
		word32 t3_181;
		xTaskResumeAll(a3, a4_13, a5_61, mstatus, dwArg0158, dwArg0198, out s0_172, out s1_173, out a0_174, out a2_175, out a3_176, out a4_177, out a5_178, out a6_179, out s4_180, out t3_181);
	}
}

// 23060F70: Register word32 vListInitialise(Register Eq_2 a0)
// Called from:
//      xEventGroupCreateStatic
//      xQueueGenericReset
//      prvAddNewTaskToReadyList
//      prvCheckForValidListAndQueue
word32 vListInitialise(Eq_2 a0)
{
	*((word32) a0 + 0x0C) = a0;
	*(union Eq_2 *) 0x07 = a0;
	*((word32) a0 + 20) = a0;
	*((word32) a0 + 24) = a0;
	*a0 = 0x00;
	return ~0x00;
}

