pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23060F84: void vListInitialiseItem(Register (ptr32 Eq_356300) a0)
// Called from:
//      prvInitialiseNewTask.isra.2
//      xTimerCreate
//      xTimerCreateStatic
void vListInitialiseItem(struct Eq_356300 * a0)
{
	a0->dw0010 = 0x00;
}

// 23060F8A: Register word32 vListInsertEnd(Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register out (ptr32 Eq_356309) a5Out)
// Called from:
//      prvAddNewTaskToReadyList
//      vTaskDelete
//      xTaskIncrementTick
//      xTaskResumeAll
//      vTaskPlaceOnEventList
//      vTaskPlaceOnUnorderedEventList
//      vTaskPlaceOnEventListRestricted
//      xTaskRemoveFromEventList
//      vTaskRemoveFromUnorderedEventList
//      xTaskPriorityInherit
//      xTaskPriorityDisinherit
//      vTaskPriorityDisinheritAfterTimeout
//      xTaskGenericNotify
//      xTaskGenericNotifyFromISR
//      vTaskNotifyGiveFromISR
word32 vListInsertEnd(Eq_2 a1, Eq_2 a4, Eq_2 a5, struct Eq_356309 & a5Out)
{
	Eq_2 a0_5 = *((word32) a5 + 4);
	*((word32) a5 + 4) = a1;
	Eq_2 a5_9 = *((word32) a4 + 8);
	*((word32) a4 + 8) = a1;
	*((word32) a1 + 4) = a4;
	*((word32) a1 + 8) = a5_9;
	*((word32) a0_5 + 16) = a1;
	word32 a0_14 = *a5_9;
	*((word32) a5_9 + 1) = a0_14;
	a5Out = (word32) a5_9 + 1;
	return a0_14;
}

// 23060FA0: Register Eq_2 vListInsert(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_2 a4Out, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      vTaskPlaceOnEventList
//      prvInsertTimerInActiveList
//      prvSwitchTimerLists
Eq_2 vListInsert(Eq_2 a0, Eq_2 a2, Eq_2 a3, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a4_11;
	Eq_2 a1_5 = *a2;
	struct Eq_356351 * a5_13 = (struct Eq_356351 *) ~0x00;
	if (a2 == ~0x00)
	{
		a0 = *((word32) a0 + 24);
		a4_11 = *(union Eq_2 *) 0x03;
	}
	else
	{
		do
		{
			a4_11 = a5_13->t0004;
			a5_13 = (struct Eq_356351 *) *a3;
		} while (a2 >= a3);
	}
	a5_13->t0004 = a1_5;
	*((word32) a1_5 + 8) = a5_13;
	*((word32) a4_11 + 8) = a1_5;
	*((word32) a1_5 + 4) = a4_11;
	*((word32) a0 + 16) = a1_5;
	Eq_2 a0_29 = a5_13->t0000;
	union Eq_2 * a5_30 = (char *) &a5_13->t0000 + 1;
	*a5_30 = (union Eq_2 *) a0_29;
	a4Out = a4_11;
	a5Out = a5_30;
	return a0_29;
}

// 23060FD0: Register Eq_2 uxListRemove(Register Eq_2 a3, Register Eq_2 a4, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      prvIdleTask
//      vTaskDelete
//      xTaskIncrementTick
//      xTaskResumeAll
//      vTaskPlaceOnEventList
//      xTaskRemoveFromEventList
//      vTaskRemoveFromUnorderedEventList
//      xTaskPriorityInherit
//      xTaskPriorityDisinherit
//      vTaskPriorityDisinheritAfterTimeout
//      xTaskGenericNotify
//      xTaskGenericNotifyFromISR
//      vTaskNotifyGiveFromISR
//      prvSwitchTimerLists
//      prvTimerTask
Eq_2 uxListRemove(Eq_2 a3, Eq_2 a4, union Eq_2 & a4Out, ptr32 & a5Out)
{
	*((word32) a4 + 8) = a3;
	Eq_2 a0_11 = *((word32) a3 + 4);
	*((word32) a3 + 4) = a4;
	word32 a5_13 = *((word32) a4 + 4);
	if (a4 == a0_11)
	{
		Eq_2 a0_14 = *((word32) a4 + 8);
		*((word32) a4 + 4) = a5_13;
		*((word32) a0_14 + 16) = 0x00;
		*((word32) a4 - 1) = *a4;
		ptr32 a5_20 = *a0_14;
		a4Out.u0 = <invalid>;
		a5Out = a5_20;
		return a0_14;
	}
	else
	{
		*((word32) a0_11 + 16) = 0x00;
		*((word32) a4 - 1) = *a4;
		ptr32 a5_25 = *a0_11;
		a4Out.u0 = <invalid>;
		a5Out = a5_25;
		return a0_11;
	}
}

// 23061002: Register Eq_2 prvCopyDataToQueue(Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out)
// Called from:
//      xQueueGenericSend
//      xQueueGenericSendFromISR
Eq_2 prvCopyDataToQueue(Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out)
{
	ptr32 a0_126;
	Eq_2 a0_14 = *((word32) s1 + 56);
	Eq_2 s0_102 = a0_14;
	if (a5 == 0x00)
	{
		s1 = (word32) s1 + 1;
		a0_126 = 0x00;
		if (a5 == 0x00)
		{
			s0_102 = *(union Eq_2 *) 0x08;
			s1 = xTaskPriorityDisinherit(0x00, a1, a3, a4, mstatus, out a0_126, out a1, out a4, out a5);
			*((word32) s0_102 + 8) = 0x00;
		}
	}
	else
	{
		s2 = a2;
		if (a2 == 0x00)
		{
			word32 a5_61;
			word32 a2_187;
			word32 a6_188;
			memcpy(*((word32) a0_14 + 4), a1, a5, out a1, out a2_187, out a3, out a4, out a5_61, out a6_188, out a7);
			s0_102 = *((word32) a4 + 8);
			a5 = (word32) a3 + a5_61;
			*((word32) a5 + 4) = s0_102;
			s1 = (word32) s1 + 1;
			a0_126 = 0x00;
			if (a5 >= a4)
			{
				Eq_2 s0_79 = *a5;
				*((word32) s1 + 57) = s0_79;
				*((word32) a5 + 4) = s0_79;
				0x00 = (int8) dwArg38;
				a0Out = 0x00;
				a1Out = a1;
				a2Out.u0 = <invalid>;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5;
				a7Out = a7;
				s2Out = a2;
				return (word32) s1 + 1;
			}
		}
		else
		{
			word32 a4_21;
			word32 a5_22;
			word32 a6_186;
			word32 a2_185;
			memcpy(*((word32) a0_14 + 0x0C), a1, a5, out a1, out a2_185, out a3, out a4_21, out a5_22, out a6_186, out a7);
			a4 = 0x00 - a4_21;
			s0_102 = *a3;
			Eq_2 a5_38 = (word32) a4 + a5_22;
			*((word32) a5_38 + 0x0C) = s0_102;
			if (a5_38 < a3)
			{
				s0_102 = *((word32) a5_38 + 8);
				a4 += a5_38;
				*((word32) a4 + 0x0C) = s0_102;
			}
			a5.u0 = 0x02;
			if (a2 != 0x02)
			{
				*((word32) s1 + 57) = s0_102;
				0x00 = (int8) dwArg38;
				a0Out = 0x00;
				a1Out = a1;
				a2Out.u0 = <invalid>;
				a3Out = a3;
				a4Out = a4;
				a5Out.u0 = 0x02;
				a7Out = a7;
				s2Out = a2;
				return (word32) s1 + 1;
			}
			a0_126 = 0x00;
			if (s1 == 0x00)
				s1.u0 = 0x01;
		}
	}
	*((word32) s1 + 56) = s0_102;
	0x00 = (int8) dwArg38;
	a0Out = a0_126;
	a1Out = a1;
	a2Out.u0 = <invalid>;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a7Out = a7;
	s2Out = s2;
	return s1;
}

// 230610A6: Register Eq_2 prvCopyDataFromQueue(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      xQueueReceive
Eq_2 prvCopyDataFromQueue(Eq_2 a1, Eq_2 a2, Eq_2 a4, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a2 == 0x00)
	{
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a1;
		return a1;
	}
	else
	{
		word32 a1_11 = a1 + a2;
		*((word32) a1_11 + 0x0C) = *((word32) a4 + 8);
		if (a1_11 >= a4)
			*((word32) a1_11 + 0x0C) = *a1_11;
		Eq_2 a4_19;
		Eq_2 a5_20;
		Eq_2 a1_22;
		Eq_2 a2_23;
		ptr32 a3_24;
		word32 a6_61;
		word32 a7_62;
		memcpy(a1, a1_11, a2, out a1_22, out a2_23, out a3_24, out a4_19, out a5_20, out a6_61, out a7_62);
		a2Out = a2_23;
		a3Out = a3_24;
		a4Out = a4_19;
		a5Out = a5_20;
		return a1_22;
	}
}

// 230610C4: Register Eq_2 prvUnlockQueue(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      vQueueWaitForMessageRestricted
Eq_2 prvUnlockQueue(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38, ptr32 & a4Out, ptr32 & a5Out)
{
	struct Eq_356645 * a5_16;
	Eq_2 a4_123 = vTaskEnterCritical(a4, mstatus, out a5_16);
	Eq_2 s1_100 = a0;
	Eq_2 s0_122 = (int32) (byte) (word32) *((word32) a0 + 69);
	if (s0_122 > 0x00)
	{
		s1_100 = a5_16->t0024;
		if (a5_16 != null)
		{
			do
			{
				word32 a0_31;
				word32 a5_176;
				s1_100 = xTaskRemoveFromEventList(s0_122, a1, a2, a3, a4_123, mstatus, out a0_31, out a1, out a2, out a3, out a4_123, out a5_176);
				if (a0_31 != 0x00)
				{
					int32 s0_43 = (word32) s0_122 - 1;
					a4_123 = vTaskMissedYield();
					s0_122 = (int32) (byte) (s0_43 & 0x00FF);
					if ((s0_43 & 0x00FF) == 0x00)
						break;
				}
				else
				{
					int32 s0_39 = (word32) s0_122 - 1;
					s0_122 = (int32) (byte) (s0_39 & 0x00FF);
					if ((s0_39 & 0x00FF) == 0x00)
						break;
				}
				struct Eq_356760 * a5_49 = (word32) s0_122 - 1 & 0x00FF;
				s1_100 = a5_49->t0024;
			} while (a5_49 != null);
		}
	}
	*((word32) s1_100 + 69) = ~0x00;
	Eq_2 a4_63;
	word32 a5_175;
	Eq_2 a3_114 = vTaskExitCritical(a3, mstatus, out a4_63, out a5_175);
	struct Eq_356671 * a5_64;
	Eq_2 a4_130 = vTaskEnterCritical(a4_63, mstatus, out a5_64);
	Eq_2 s0_129 = (int32) (byte) (word32) *((word32) s1_100 + 0x0044);
	if (s0_129 > 0x00)
	{
		s1_100 = a5_64->t0010;
		if (a5_64 != null)
		{
			do
			{
				word32 a0_79;
				word32 a5_177;
				s1_100 = xTaskRemoveFromEventList(s0_129, a1, a2, a3_114, a4_130, mstatus, out a0_79, out a1, out a2, out a3_114, out a4_130, out a5_177);
				if (a0_79 != 0x00)
				{
					int32 s0_91 = (word32) s0_129 - 1;
					a4_130 = vTaskMissedYield();
					s0_129 = (int32) (byte) (s0_91 & 0x00FF);
					if ((s0_91 & 0x00FF) == 0x00)
						break;
				}
				else
				{
					int32 s0_87 = (word32) s0_129 - 1;
					s0_129 = (int32) (byte) (s0_87 & 0x00FF);
					if ((s0_87 & 0x00FF) == 0x00)
						break;
				}
				struct Eq_356797 * a5_97 = (word32) s0_129 - 1 & 0x00FF;
				s1_100 = a5_97->t0010;
			} while (a5_97 != null);
		}
	}
	((word32) s1_100 + 0x0044)->u0 = ~0x00;
	0x00 = (int8) dwArg38;
	ptr32 a5_118;
	ptr32 a4_120;
	Eq_2 a3_119 = vTaskExitCritical(a3_114, mstatus, out a4_120, out a5_118);
	a4Out = a4_120;
	a5Out = a5_118;
	return a3_119;
}

