pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306117A: Register Eq_2 xQueueGenericReset(Register (ptr32 Eq_123278) a0, Register Eq_2 a1, Register (ptr32 Eq_123278) a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_356814 a5Out)
// Called from:
//      xQueueGenericCreateStatic
//      xQueueGenericCreate
Eq_2 xQueueGenericReset(struct Eq_123278 * a0, Eq_2 a1, struct Eq_123278 * a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_356814 & a5Out)
{
	Eq_2 s1_106 = a1;
	if (a0 == null)
	{
		word32 a5_113;
		user_vAssertCalled(a4, mstatus, out a5_113);
	}
	word32 a5_20;
	Eq_2 a4_21 = vTaskEnterCritical(a4, mstatus, out a5_20);
	struct Eq_356827 * s0_27 = *a4_21;
	s0_27->dw0038 = 0x00;
	s0_27->b0044 = ~0x00;
	*((word32) a4_21 + 4) = s0_27;
	s0_27->b0045 = ~0x00;
	word32 a5_29 = a3 + a5_20 / 84;
	Eq_2 a3_34 = a5_29 - a3;
	struct Eq_356850 * a5_35 = (word32) a4_21 + a5_29;
	a5_35->ptr0008 = s0_27;
	word32 a4_36 = a4_21 + a3_34;
	*((word32) a4_36 + 0x0C) = s0_27;
	if (a1 != 0x00)
	{
		vListInitialise((char *) s0_27 + 16);
		vListInitialise((char *) s0_27 + 36);
		Eq_356814 a5_46;
		ptr32 a4_48;
		Eq_2 a3_47 = vTaskExitCritical(a3_34, mstatus, out a4_48, out a5_46);
		a1Out = a1;
		a3Out = a3_47;
		a4Out = a4_48;
		a5Out = a5_46;
		return a1;
	}
	else
	{
		Eq_2 s0_55 = a5_35->t0010;
		if (a5_35 != null)
		{
			word32 a0_58;
			word32 a2_114;
			word32 a4_115;
			word32 a5_116;
			s1_106 = xTaskRemoveFromEventList(s0_55, a1, ~0x00, a3_34, a4_36, mstatus, out a0_58, out a1, out a2_114, out a3_34, out a4_115, out a5_116);
			if (a0_58 != 0x00)
			{
				__syscall();
				Eq_356814 a5_66;
				ptr32 a4_68;
				Eq_2 a3_67 = vTaskExitCritical(a3_34, mstatus, out a4_68, out a5_66);
				a1Out = a1;
				a3Out = a3_67;
				a4Out = a4_68;
				a5Out = a5_66;
				return s1_106;
			}
		}
		Eq_356814 a5_76;
		ptr32 a4_78;
		Eq_2 a3_77 = vTaskExitCritical(a3_34, mstatus, out a4_78, out a5_76);
		a1Out = a1;
		a3Out = a3_77;
		a4Out = a4_78;
		a5Out = a5_76;
		return s1_106;
	}
}

// 2306120C: Register word32 xQueueGenericCreateStatic(Register ptr32 a0, Register (ptr32 Eq_123277) a1, Register (ptr32 Eq_123278) a2, Register (ptr32 Eq_123278) a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_123277) s1Out, Register out (ptr32 Eq_123278) a0Out, Register out ptr32 a2Out, Register out (ptr32 Eq_123278) a3Out, Register out Eq_2 a4Out, Register out Eq_333559 a5Out, Register out (ptr32 Eq_123278) s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out)
// Called from:
//      __bl_ble_sync_task
//      pro_trans_init
//      xQueueCreateMutexStatic
//      prvCheckForValidListAndQueue
word32 xQueueGenericCreateStatic(ptr32 a0, struct Eq_123277 * a1, struct Eq_123278 * a2, struct Eq_123278 * a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0128, struct Eq_123277 & s1Out, struct Eq_123278 & a0Out, ptr32 & a2Out, struct Eq_123278 & a3Out, union Eq_2 & a4Out, union Eq_333559 & a5Out, struct Eq_123278 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out)
{
	struct Eq_123277 * s1_100 = a1;
	struct Eq_123278 * s2_198 = a2;
	if (a0 != 0x00)
	{
		if (a3 != null)
			goto l23061228;
	}
	else
	{
		word32 a5_210;
		user_vAssertCalled(a4, mstatus, out a5_210);
		if (a3 != null)
			goto l23061228;
	}
	word32 a5_211;
	user_vAssertCalled(a4, mstatus, out a5_211);
l23061228:
	if (a2 != null)
	{
		if (a1 != null)
			goto l2306122E;
	}
	else if (a1 == null)
		goto l2306122E;
	word32 a5_212;
	user_vAssertCalled(a4, mstatus, out a5_212);
l2306122E:
	Eq_333559 a5_195 = 80;
	if (a4 != 80)
		user_vAssertCalled(a4, mstatus, out a5_195);
	struct Eq_123278 * a3_193;
	Eq_2 a4_194;
	a4_194 = a4;
	a3_193 = a3;
	if (a3 != null)
	{
		a3->b0046 = 0x01;
		if (a1 == null)
			s2_198 = a3;
		a3->ptr0000 = s2_198;
		a3->ptr003C = a0;
		a1->ptr0040 = a3;
		word32 a1_213;
		s1_100 = xQueueGenericReset(a3, 0x01, a3, a4, mstatus, out a1_213, out a3_193, out a4_194, out a5_195);
		a3->b004C = (byte) a4;
	}
	0x00 = (int8) dwArg0128;
	s1Out = s1_100;
	a0Out = a3;
	a2Out = dwArg0100;
	a3Out = a3_193;
	a4Out = a4_194;
	a5Out = a5_195;
	s2Out = s2_198;
	s3Out = a0;
	s4Out = a4;
	return dwArgE4;
}

// 2306128C: Register (ptr32 Eq_123278) xQueueGenericCreate(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_123277) s1Out, Register out (ptr32 Eq_123278) a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_123278) a3Out, Register out Eq_2 a4Out, Register out Eq_123283 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out)
// Called from:
//      wifi_mgmr_all_ap_scan
//      ble_controller_init
//      k_queue_init
//      xQueueCreateCountingSemaphore
//      xQueueCreateMutex
//      sys_mbox_new
//      sys_sem_new
//      at_server_init
//      http_url_req
struct Eq_123278 * xQueueGenericCreate(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158, struct Eq_123277 & s1Out, struct Eq_123278 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, struct Eq_123278 & a3Out, union Eq_2 & a4Out, union Eq_123283 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out)
{
	if (a0 == 0x00)
		user_vAssertCalled(a4, mstatus, out a5);
	ptr32 a1_149;
	struct Eq_123278 * a3_152;
	Eq_2 a4_154;
	Eq_123283 a5_156;
	struct Eq_123277 * s1_160;
	ptr32 s2_162;
	ptr32 s3_103;
	struct Eq_123278 * s0_51;
	if (a1 != 0x00)
	{
		struct Eq_123278 * a0_56;
		word32 a2_185;
		word32 a6_186;
		word32 s4_187;
		word32 s8_188;
		pvPortMalloc(ra, a0, (word32) a0 + a1 + 80, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_160, out a0_56, out a1_149, out a2_185, out a3_152, out a4_154, out a5_156, out a6_186, out s2_162, out s3_103, out s4_187, out s8_188);
		s0_51 = a0_56;
		if (a0_56 != null)
		{
			a0_56->b0046 = 0x00;
			a0_56->ptr0050 = a0_56;
			goto l230612D2;
		}
	}
	else
	{
		struct Eq_123278 * a0_36;
		word32 a2_181;
		word32 a6_182;
		word32 s4_183;
		word32 s8_184;
		pvPortMalloc(ra, a0, 80, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_160, out a0_36, out a1_149, out a2_181, out a3_152, out a4_154, out a5_156, out a6_182, out s2_162, out s3_103, out s4_183, out s8_184);
		s0_51 = a0_36;
		if (a0_36 != null)
		{
			a0_36->b0046 = 0x00;
			a0_36->ptr0000 = a0_36;
l230612D2:
			s1_160->ptr003C = s0_51;
			s0_51->ptr0040 = s2_162;
			struct Eq_123278 * a3_97;
			Eq_2 a4_98;
			Eq_123283 a5_99;
			ptr32 a1_102;
			struct Eq_123277 * s1_100 = xQueueGenericReset(s0_51, 0x01, a3_152, a4_154, mstatus, out a1_102, out a3_97, out a4_98, out a5_99);
			s0_51->b004C = (byte) s3_103;
			s1Out = s1_100;
			a0Out = s0_51;
			a1Out = a1_102;
			a2Out.u0 = <invalid>;
			a3Out = a3_97;
			a4Out = a4_98;
			a5Out = a5_99;
			s2Out = s2_162;
			s3Out = s3_103;
			s4Out.u0 = <invalid>;
			return s0_51;
		}
	}
	s1Out = s1_160;
	a0Out = null;
	a1Out = a1_149;
	a2Out.u0 = <invalid>;
	a3Out = a3_152;
	a4Out = a4_154;
	a5Out = a5_156;
	s2Out = s2_162;
	s3Out = s3_103;
	s4Out.u0 = <invalid>;
	return null;
}

// 2306130C: Register (ptr32 Eq_123301) xQueueCreateCountingSemaphore(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      k_sem_init
//      aos_sem_new
struct Eq_123301 * xQueueCreateCountingSemaphore(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	if (a0 != 0x00)
	{
		if (a0 >= a1)
			goto l2306131A;
	}
	else
	{
		user_vAssertCalled(a4, mstatus, out a5);
		if (a0 >= a1)
			goto l2306131A;
	}
	user_vAssertCalled(a4, mstatus, out a5);
l2306131A:
	ptr32 a0_39;
	ptr32 a1_40;
	ptr32 a3_42;
	ptr32 a4_43;
	ptr32 s1_47;
	ptr32 s2_48;
	ptr32 s3_49;
	ptr32 s4_50;
	word32 a2_105;
	word32 a5_106;
	struct Eq_123301 * s0_46 = xQueueGenericCreate(ra, a0, 0x00, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out s1_47, out a0_39, out a1_40, out a2_105, out a3_42, out a4_43, out a5_106, out s2_48, out s3_49, out s4_50);
	if (a0_39 != 0x00)
		s0_46->ptr0038 = a0_39;
	s1Out = s1_47;
	a0Out = a0_39;
	a1Out = a1_40;
	a3Out = a3_42;
	a4Out = a4_43;
	s2Out = s2_48;
	s3Out = s3_49;
	s4Out = s4_50;
	s8Out = dwLoc1C;
	return s0_46;
}

// 23061344: Register Eq_2 xQueueGenericSend(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out Eq_2 s1Out, Register out (ptr32 (ptr32 Eq_123301)) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 word32) a4Out, Register out (ptr32 Eq_121751) a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      cb_scan_complete
//      cmd_mgr_print
//      cmd_mgr_msgind
//      cmd_mgr_llind
//      cmd_mgr_queue
//      cmd_mgr_drain
//      rw_main_task_post
//      k_queue_prepend
//      k_sem_give
//      wifi_state_get_cb
//      write_data
//      pro_trans_ack
//      ef_port_env_unlock
//      xQueueCreateMutexStatic
//      xQueueGiveMutexRecursive
//      xQueueCreateMutex
//      xTimerGenericCommand
//      sys_mbox_post
//      sys_mbox_trypost
//      sys_sem_new
//      sys_mutex_unlock
//      aos_open
//      aos_close
//      aos_stat
//      aos_opendir
//      aos_closedir
//      aos_register_driver
//      aos_register_fs
//      aos_mutex_unlock
//      aos_sem_signal
//      at_server_notify_with_ctx
//      cb_httpc_result
//      tcp_connected_callback
//      tcp_receive_callback
//      tcp_err_callback
//      tcp_accept_callback
//      bl_cipstart
//      bl_cipclose
//      bl_cipsslcconf_path
//      bl_cipsslcsni
//      bl_cipsslcalpn
//      bl_sha_mutex_give
Eq_2 xQueueGenericSend(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, union Eq_2 & s1Out, struct Eq_123301 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, word32 & a4Out, struct Eq_121751 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	Eq_2 s2_137 = a3;
	if (a0 == 0x00)
		user_vAssertCalled(a4, mstatus, out a5);
	if (a1 == 0x00 && a5 != 0x00)
	{
		word32 a5_675;
		user_vAssertCalled(a4, mstatus, out a5_675);
	}
	if (a3 == 0x02 && a4 != 0x01)
	{
		word32 a5_674;
		user_vAssertCalled(a4, mstatus, out a5_674);
	}
	word32 a5_52;
	if (xTaskGetSchedulerState(out a5_52) == 0x00 && a5_52 != 0x00)
	{
		word32 a5_644;
		user_vAssertCalled(a4, mstatus, out a5_644);
	}
	Eq_2 a1_124;
	struct Eq_121751 * a5_151;
	word32 * a4_159;
	Eq_2 a3_158;
	struct Eq_123301 ** a0_160;
	Eq_2 a5_228;
	Eq_2 a4_229 = vTaskEnterCritical(a4, mstatus, out a5_228);
	Eq_2 s0_233 = *((word32) a5_228 + 60);
	ptr32 s6_326 = 0x00;
	Eq_2 s3_179 = 0x02;
	Eq_2 s1_105 = ~0x00;
	a1_124 = a1;
	if (a4_229 >= a5_228)
	{
		while (s2_137 != s3_179)
		{
			if (a5_228 == 0x00)
			{
				a3_158 = vTaskExitCritical(a3, mstatus, out a4_159, out a5_151);
				a0_160 = null;
				goto l23061414;
			}
			if (s6_326 == 0x00)
				vTaskInternalSetTimeOutState(fp + -40);
			Eq_2 a4_93;
			word32 a5_645;
			Eq_2 a3_92 = vTaskExitCritical(a3, mstatus, out a4_93, out a5_645);
			word32 a5_646;
			word32 a5_647;
			vTaskEnterCritical(vTaskSuspendAll(a4_93, out a5_646), mstatus, out a5_647);
			if ((int32) (byte) (word32) *((word32) s0_233 + 0x0044) == s1_105)
				((word32) s0_233 + 0x0044)->u0 = 0x00;
			if ((int32) (byte) (word32) *((word32) s0_233 + 69) == s1_105)
				*((word32) s0_233 + 69) = 0x00;
			word32 a5_118;
			Eq_2 a4_120;
			vTaskExitCritical(a3_92, mstatus, out a4_120, out a5_118);
			a1_124 = fp + -52;
			word32 a0_129;
			Eq_2 a2_130;
			Eq_2 a3_131;
			Eq_2 a4_132;
			Eq_2 s4_138;
			word32 s1_648;
			word32 a5_649;
			Eq_2 s0_135 = xTaskCheckForTimeOut(fp + -40, fp + -52, dwArgA4, a4_120, a5_118, mstatus, out s1_648, out a0_129, out a2_130, out a3_131, out a4_132, out a5_649, out s2_137, out s4_138);
			if (a0_129 != 0x00)
			{
				Eq_2 a4_145;
				Eq_2 a5_146;
				word32 a2_652;
				word32 a6_653;
				word32 s0_650;
				word32 a0_651;
				word32 s4_654;
				word32 t3_655;
				xTaskResumeAll(prvUnlockQueue(s0_135, fp + -52, a2_130, a3_131, a4_132, mstatus, dwLoc08, out a4_145, out a5_146), a4_145, a5_146, mstatus, dwArg0118, dwArg0158, out s0_650, out s1_105, out a0_651, out a2_652, out a3_158, out a4_159, out a5_151, out a6_653, out s4_654, out t3_655);
				a0_160 = null;
				goto l23061414;
			}
			Eq_2 a4_200;
			Eq_2 a1_171;
			Eq_2 a5_161;
			Eq_2 a4_162 = vTaskEnterCritical(a4_132, mstatus, out a5_161);
			Eq_2 s0_164 = *((word32) a5_161 + 60);
			if (a4_162 != a5_161)
			{
				Eq_2 a4_204;
				Eq_2 a4_208;
				Eq_2 a5_209;
				word32 a5_663;
				word32 s0_664;
				word32 a0_665;
				word32 a5_667;
				word32 a2_666;
				word32 s4_669;
				word32 t3_670;
				word32 a6_668;
				xTaskResumeAll(prvUnlockQueue(s0_164, fp + -52, a2_130, vTaskExitCritical(a3_131, mstatus, out a4_204, out a5_663), a4_204, mstatus, dwLoc08, out a4_208, out a5_209), a4_208, a5_209, mstatus, dwArg0118, dwArg0158, out s0_664, out s1_105, out a0_665, out a2_666, out a3, out a4_200, out a5_667, out a6_668, out s4_669, out t3_670);
				goto l230613F0;
			}
			Eq_2 a4_167;
			word32 a5_656;
			Eq_2 a3_166 = vTaskExitCritical(a3_131, mstatus, out a4_167, out a5_656);
			Eq_2 a2_172;
			Eq_2 a4_173;
			Eq_2 a4_186;
			Eq_2 a5_187;
			word32 a0_190;
			word32 a6_660;
			word32 s4_661;
			word32 s0_657;
			word32 a2_658;
			word32 a5_659;
			word32 t3_662;
			xTaskResumeAll(prvUnlockQueue(vTaskPlaceOnEventList(s4_138, fp + -52, dwArg24, a3_166, a4_167, mstatus, dwLoc1C, dwArg08, out a1_171, out a2_172, out a4_173, out s2_137, out s3_179), a1_171, a2_172, a3_166, a4_173, mstatus, dwLoc08, out a4_186, out a5_187), a4_186, a5_187, mstatus, dwArg0118, dwArg0158, out s0_657, out s1_105, out a0_190, out a2_658, out a3, out a4_200, out a5_659, out a6_660, out s4_661, out t3_662);
			a1_124 = a1_171;
			if (a0_190 == 0x00)
			{
				__syscall();
				a1_124 = a1_171;
			}
			else
			{
l230613F0:
			}
			a4_229 = vTaskEnterCritical(a4_200, mstatus, out a5_228);
			s6_326 = 0x01;
			s0_233 = *((word32) a5_228 + 60);
			if (a4_229 < a5_228)
				break;
		}
	}
	word32 a0_272;
	Eq_2 a2_274;
	Eq_2 a4_276;
	struct Eq_357175 * a5_277;
	Eq_2 a3_275;
	s1_105 = prvCopyDataToQueue(s1_105, a1, s2_137, a3, a4_229, a5_228, mstatus, dwLoc08, out a0_272, out a1_124, out a2_274, out a3_275, out a4_276, out a5_277, out a7, out s2_137);
	Eq_2 s0_289 = a5_277->t0024;
	if (a5_277 == null)
	{
		if (a0_272 == 0x00)
			goto l2306140E;
	}
	else
	{
		word32 a0_291;
		word32 a4_672;
		word32 a5_673;
		word32 a2_671;
		s1_105 = xTaskRemoveFromEventList(s0_289, a1_124, a2_274, a3_275, a4_276, mstatus, out a0_291, out a1_124, out a2_671, out a3_275, out a4_672, out a5_673);
		if (a0_291 == 0x00)
			goto l2306140E;
	}
	__syscall();
l2306140E:
	a3_158 = vTaskExitCritical(a3_275, mstatus, out a4_159, out a5_151);
	a0_160 = (struct Eq_123301 **) 0x01;
l23061414:
	0x00 = (int8) dwArg0198;
	s1Out = s1_105;
	a0Out = a0_160;
	a1Out = a1_124;
	a2Out = dwArg0138;
	a3Out = a3_158;
	a4Out = a4_159;
	a5Out = a5_151;
	a7Out = a7;
	s2Out = s2_137;
	s3Out = s3_179;
	s4Out = dwArgF4;
	s5Out = a1;
	s6Out = s6_326;
	s8Out = dwArgD4;
	return dwArg0158;
}

// 2306149C: Register word32 xQueueCreateMutexStatic(Register Eq_2 a0, Register (ptr32 Eq_123278) a1, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out)
// Called from:
//      bl_sec_init
//      vfs_init
word32 xQueueCreateMutexStatic(Eq_2 a0, struct Eq_123278 * a1, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out)
{
	Eq_2 a0_16;
	Eq_2 a5_18;
	word32 a2_112;
	word32 s2_113;
	word32 s3_114;
	word32 s4_115;
	ptr32 a3_28;
	Eq_2 a4_29;
	word32 s1_20;
	xQueueGenericCreateStatic(0x01, null, null, a1, a0, mstatus, dwArg0118, out s1_20, out a0_16, out a2_112, out a3_28, out a4_29, out a5_18, out s2_113, out s3_114, out s4_115);
	Eq_2 s0_30 = a0_16;
	if (a0_16 != 0x00)
	{
		*((word32) a0_16 + 8) = 0x00;
		*a0_16 = 0x00;
		*((word32) a0_16 + 0x0C) = 0x00;
		word32 a0_116;
		word32 a1_117;
		word32 a2_118;
		word32 a5_119;
		word32 a7_120;
		word32 s2_121;
		word32 s3_122;
		word32 s4_123;
		word32 s5_124;
		word32 s6_125;
		word32 s8_126;
		s0_30 = xQueueGenericSend(a0_16, 0x00, 0x00, a4_29, a5_18, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1_20, out a0_116, out a1_117, out a2_118, out a3_28, out a4_29, out a5_119, out a7_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s8_126);
	}
	a0Out = s0_30;
	a2Out = dwArg10;
	a3Out = a3_28;
	a4Out = a4_29;
	return s1_20;
}

// 230614D4: Register ptr32 xQueueGiveMutexRecursive(Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_357568) a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      at_serial_unlock
//      at_data_output
//      at_dump_noend
ptr32 xQueueGiveMutexRecursive(Eq_2 a0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, struct Eq_357568 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	if (a0 == 0x00)
	{
		word32 a5_149;
		user_vAssertCalled(a4, mstatus, out a5_149);
	}
	Eq_2 s2_105 = *((word32) a0 + 8);
	ptr32 s1_23 = 0x00;
	struct Eq_357568 * a5_22;
	if (s2_105 == xTaskGetCurrentTaskHandle(out a5_22))
	{
		Eq_2 s0_24 = a5_22->t000C;
		a5_22->t000B = s0_24;
		s1_23 = 0x01;
		a5_22 = (struct Eq_357568 *) ((char *) a5_22 - 1);
		if (a5_22 == (struct Eq_357568 *) ~0x00)
		{
			word32 a0_150;
			word32 a1_151;
			word32 a2_152;
			word32 a7_153;
			word32 s8_154;
			xQueueGenericSend(s0_24, 0x00, 0x00, a4, (char *) a5_22 - 1, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1_23, out a0_150, out a1_151, out a2_152, out a3, out a4, out a5_22, out a7_153, out s2_105, out s3, out s4, out s5, out s6, out s8_154);
		}
	}
	0x00 = (int8) dwArg38;
	a0Out = s1_23;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_22;
	s2Out = s2_105;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	return s1_23;
}

