pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306151C: Register word32 xQueueCreateMutex(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      bl_cmd_mgr_init
//      ef_port_init
//      mem_init
//      aos_mutex_new
//      at_server_init
//      at_cmd_impl_init
word32 xQueueCreateMutex(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_2 a0_16;
	word32 a2_114;
	word32 s4_115;
	ptr32 a3_19;
	ptr32 a1_17;
	Eq_2 a4_20;
	Eq_2 a5_21;
	word32 s1_24;
	ptr32 s2_25;
	ptr32 s3_26;
	xQueueGenericCreate(ra, 0x01, 0x00, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s1_24, out a0_16, out a1_17, out a2_114, out a3_19, out a4_20, out a5_21, out s2_25, out s3_26, out s4_115);
	Eq_2 s0_31 = a0_16;
	if (a0_16 != 0x00)
	{
		*((word32) a0_16 + 8) = 0x00;
		*a0_16 = 0x00;
		*((word32) a0_16 + 0x0C) = 0x00;
		word32 a0_116;
		word32 a2_117;
		word32 a7_118;
		word32 s4_119;
		word32 s5_120;
		word32 s6_121;
		word32 s8_122;
		s0_31 = xQueueGenericSend(a0_16, 0x00, 0x00, a4_20, a5_21, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1_24, out a0_116, out a1_17, out a2_117, out a3_19, out a4_20, out a5_21, out a7_118, out s2_25, out s3_26, out s4_119, out s5_120, out s6_121, out s8_122);
	}
	a0Out = s0_31;
	a1Out = a1_17;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_21;
	s2Out = s2_25;
	s3Out = s3_26;
	return s1_24;
}

// 23061550: Register Eq_2 xQueueGenericSendFromISR(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      rw_main_task_post_from_fw
//      xTimerGenericCommand
Eq_2 xQueueGenericSendFromISR(Eq_2 a0, Eq_2 a1, union Eq_2 * a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	if (a0 == 0x00)
		user_vAssertCalled(a4, mstatus, out a5);
	if (a1 == 0x00 && a5 != 0x00)
		user_vAssertCalled(a4, mstatus, out a5);
	Eq_2 s0_55;
	Eq_2 a4_39 = 0x02;
	if (a3 != 0x02)
	{
		s0_55 = *(union Eq_2 *) 0x3A;
		if (a5 <= 0x02)
		{
			0x00 = (int8) dwArg0128;
			s1Out = s1;
			a0Out = 0x00;
			a1Out = a1;
			a3Out = a3;
			a4Out.u0 = 0x02;
			a5Out = a5;
			s2Out = a3;
			s3Out.u0 = <invalid>;
			return <invalid>;
		}
	}
	else
	{
		a4_39.u0 = 0x01;
		if (a5 != 0x01)
			user_vAssertCalled(0x01, mstatus, out a5);
		s0_55 = *((word32) a5 + 56);
	}
	Eq_2 a2_79;
	Eq_2 s2_85;
	word32 a5_273;
	word32 a7_274;
	word32 a0_271;
	word32 a4_272;
	Eq_2 a3_102;
	Eq_2 a1_100;
	Eq_2 s1_105 = prvCopyDataToQueue((word32) *((word32) s0_55 + 69), a1, a3, a3, a4_39, a5, mstatus, dwArg08, out a0_271, out a1_100, out a2_79, out a3_102, out a4_272, out a5_273, out a7_274, out s2_85);
	Eq_2 a4_103 = (int32) (byte) s1_105;
	Eq_2 a5_104 = ~0x00;
	if (a4_103 != ~0x00)
	{
		int32 s1_125 = (word32) s1_105 + 1 << 24;
		*((word32) s0_55 + 69) = (byte) (s1_125 >> 24);
		0x00 = (int8) dwArg0128;
		s1Out = s1_125 >> 24;
		a0Out = 0x01;
		a1Out = a1_100;
		a3Out = a3_102;
		a4Out = a4_103;
		a5Out.u0 = ~0x00;
		s2Out = s2_85;
		s3Out.u0 = <invalid>;
		return <invalid>;
	}
	Eq_2 s0_97 = *(union Eq_2 *) 0x23;
	if (true)
	{
		word32 a0_99;
		word32 a2_275;
		s1_105 = xTaskRemoveFromEventList(s0_97, a1_100, a2_79, a3_102, a4_103, mstatus, out a0_99, out a1_100, out a2_275, out a3_102, out a4_103, out a5_104);
		if (a0_99 != 0x00 && a2 != null)
		{
			*a2 = (union Eq_2 *) 0x01;
			a5_104.u0 = 0x01;
l230615DA:
			0x00 = (int8) dwArg0128;
			s1Out = s1_105;
			a0Out = 0x01;
			a1Out = a1_100;
			a3Out = a3_102;
			a4Out = a4_103;
			a5Out = a5_104;
			s2Out = s2_85;
			s3Out.u0 = <invalid>;
			return <invalid>;
		}
	}
	goto l230615DA;
}

// 2306160A: Register Eq_2 xQueueGiveFromISR(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      aos_sem_signal
Eq_2 xQueueGiveFromISR(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
		a2 = user_vAssertCalled(a4, mstatus, out a5);
	if (a5 == 0x00)
	{
		if (a5 != 0x00)
			goto l23061620;
	}
	else
	{
		a2 = user_vAssertCalled(a4, mstatus, out a5);
		if (a5 != 0x00)
			goto l23061620;
	}
	if (a5 != 0x00)
		a2 = user_vAssertCalled(a4, mstatus, out a5);
l23061620:
	Eq_2 s0_39 = *((word32) a4 + 60);
	if (a5 < a4)
	{
		Eq_2 a4_41 = (word32) *((word32) s0_39 + 69);
		*((word32) a5 + 57) = s0_39;
		a3 = (int32) (byte) a4_41;
		a5.u0 = ~0x00;
		if (a3 != ~0x00)
		{
			*((word32) s0_39 + 69) = (byte) (int32) (byte) ((word32) a4_41 + 1);
			goto l23061648;
		}
		Eq_2 s0_47 = *(union Eq_2 *) 0x23;
		if (false)
			goto l23061648;
		word32 a4_125;
		word32 a0_57;
		word32 a2_124;
		word32 a1_123;
		Eq_2 s1_63 = xTaskRemoveFromEventList(s0_47, a1, a2, a3, a4_41, mstatus, out a0_57, out a1_123, out a2_124, out a3, out a4_125, out a5);
		if (a0_57 == 0x00 || s1_63 == 0x00)
		{
l23061648:
			goto l2306164A;
		}
		*(union Eq_2 *) 0x01 = s1_63;
		a5.u0 = 0x01;
	}
l2306164A:
	a5Out = a5;
	return a3;
}

// 23061684: Register Eq_2 xQueueReceive(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s8Out)
// Called from:
//      blecontroller_main
//      ble_controller_deinit
//      k_queue_get
//      __bl_ble_sync_task
//      prvTimerTask
//      sys_arch_mbox_fetch
//      sys_arch_mbox_tryfetch
//      at_async_event
Eq_2 xQueueReceive(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s8Out)
{
	Eq_2 s0_132 = a0;
	Eq_2 s3_153 = a1;
	if (a0 == 0x00)
		a2 = user_vAssertCalled(a4, mstatus, out a5);
	if (a1 == 0x00)
	{
		s0_132 = *((word32) a5 + 64);
		if (a5 != 0x00)
		{
			word32 a5_575;
			a2 = user_vAssertCalled(a4, mstatus, out a5_575);
		}
	}
	word32 a5_36;
	if (xTaskGetSchedulerState(out a5_36) == 0x00)
	{
		a2 = dwArgA4;
		if (a5_36 != 0x00)
		{
			word32 a5_574;
			a2 = user_vAssertCalled(a4, mstatus, out a5_574);
		}
	}
	word32 a5_47;
	Eq_2 a4_178 = vTaskEnterCritical(a4, mstatus, out a5_47);
	Eq_2 s2_107 = *((word32) s0_132 + 56);
	if (s2_107 != 0x00)
	{
l2306175C:
		Eq_2 s2_217 = (word32) s2_107 - 1;
		struct Eq_357921 * a5_225;
		Eq_2 a2_227;
		Eq_2 a4_229;
		Eq_2 a3_228;
		Eq_2 a1_226 = prvCopyDataFromQueue(s3_153, a2, a4_178, out a2_227, out a3_228, out a4_229, out a5_225);
		*((word32) s0_132 + 56) = s2_217;
		Eq_2 s0_239 = a5_225->t0010;
		if (a5_225 != null)
		{
			word32 a4_550;
			word32 a5_551;
			word32 a2_549;
			word32 a0_242;
			s1 = xTaskRemoveFromEventList(s0_239, a1_226, a2_227, a3_228, a4_229, mstatus, out a0_242, out a1_226, out a2_549, out a3_228, out a4_550, out a5_551);
			if (a0_242 != 0x00)
				__syscall();
		}
		ptr32 a5_252;
		ptr32 a4_254;
		Eq_2 a3_253 = vTaskExitCritical(a3_228, mstatus, out a4_254, out a5_252);
		s1Out = s1;
		a0Out = 0x01;
		a1Out = a1_226;
		a2Out.u0 = <invalid>;
		a3Out = a3_253;
		a4Out = a4_254;
		a5Out = a5_252;
		s2Out = s2_217;
		s3Out = s3_153;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		if (a5_47 != 0x00)
		{
			vTaskInternalSetTimeOutState(fp + -40);
			s1.u0 = ~0x00;
			do
			{
				Eq_2 a4_65;
				word32 a5_570;
				Eq_2 a3_64 = vTaskExitCritical(a3, mstatus, out a4_65, out a5_570);
				word32 a5_572;
				word32 a5_571;
				vTaskEnterCritical(vTaskSuspendAll(a4_65, out a5_571), mstatus, out a5_572);
				if ((int32) (byte) (word32) *((word32) s0_132 + 0x0044) == s1)
					((word32) s0_132 + 0x0044)->u0 = 0x00;
				if ((int32) (byte) (word32) *((word32) s0_132 + 69) == s1)
					*((word32) s0_132 + 69) = 0x00;
				word32 a5_177;
				Eq_2 a4_135;
				Eq_2 a1_145;
				word32 a5_88;
				Eq_2 a4_90;
				vTaskExitCritical(a3_64, mstatus, out a4_90, out a5_88);
				a1 = fp + -52;
				word32 a0_99;
				Eq_2 a2_100;
				Eq_2 a3_101;
				Eq_2 a4_102;
				Eq_2 s4_108;
				word32 s1_547;
				word32 a5_548;
				Eq_2 s0_105 = xTaskCheckForTimeOut(fp + -40, fp + -52, dwArgA4, a4_90, a5_88, mstatus, out s1_547, out a0_99, out a2_100, out a3_101, out a4_102, out a5_548, out s2_107, out s4_108);
				if (a0_99 == 0x00)
				{
					struct Eq_358067 * a5_136;
					vTaskEnterCritical(a4_102, mstatus, out a5_136);
					Eq_2 s0_138 = a5_136->t0038;
					if (a5_136 != null)
					{
						word32 a0_565;
						Eq_2 a4_184;
						Eq_2 a4_188;
						Eq_2 a5_189;
						Eq_2 a4_202;
						word32 a5_564;
						word32 a6_567;
						word32 s4_568;
						word32 a5_566;
						word32 t3_569;
						xTaskResumeAll(prvUnlockQueue(s0_138, fp + -52, a2_100, vTaskExitCritical(a3_101, mstatus, out a4_184, out a5_564), a4_184, mstatus, dwLoc08, out a4_188, out a5_189), a4_188, a5_189, mstatus, dwArg0118, dwArg0158, out s0_132, out s1, out a0_565, out a2, out a3, out a4_202, out a5_566, out a6_567, out s4_568, out t3_569);
						a4_178 = vTaskEnterCritical(a4_202, mstatus, out a5_177);
						s2_107 = *((word32) s0_132 + 56);
						if (s2_107 != 0x00)
							goto l2306175C;
						goto l23061720;
					}
					word32 a5_558;
					Eq_2 a4_141;
					Eq_2 a3_140 = vTaskExitCritical(a3_101, mstatus, out a4_141, out a5_558);
					word32 s2_559;
					word32 t3_563;
					Eq_2 a2_146;
					Eq_2 a4_147;
					Eq_2 a4_160;
					Eq_2 a5_161;
					word32 a0_164;
					word32 s4_562;
					word32 a5_560;
					word32 a6_561;
					xTaskResumeAll(prvUnlockQueue(vTaskPlaceOnEventList(s4_108, fp + -52, dwArg24, a3_140, a4_141, mstatus, dwLoc1C, dwArg08, out a1_145, out a2_146, out a4_147, out s2_559, out s3_153), a1_145, a2_146, a3_140, a4_147, mstatus, dwLoc08, out a4_160, out a5_161), a4_160, a5_161, mstatus, dwArg0118, dwArg0158, out s0_132, out s1, out a0_164, out a2, out a3, out a4_135, out a5_560, out a6_561, out s4_562, out t3_563);
					a1 = a1_145;
					if (a0_164 == 0x00)
					{
						__syscall();
						a1 = a1_145;
					}
				}
				else
				{
					word32 s4_556;
					word32 s0_552;
					word32 a6_555;
					word32 a5_554;
					word32 t3_557;
					word32 a0_553;
					Eq_2 a4_115;
					Eq_2 a5_116;
					Eq_2 a4_129;
					xTaskResumeAll(prvUnlockQueue(s0_105, fp + -52, a2_100, a3_101, a4_102, mstatus, dwLoc08, out a4_115, out a5_116), a4_115, a5_116, mstatus, dwArg0118, dwArg0158, out s0_552, out s1, out a0_553, out a2, out a3, out a4_129, out a5_554, out a6_555, out s4_556, out t3_557);
					struct Eq_358058 * a5_130;
					vTaskEnterCritical(a4_129, mstatus, out a5_130);
					s0_132 = a5_130->t0038;
					if (a5_130 == null)
						break;
					word32 a5_573;
					a3 = vTaskExitCritical(a3, mstatus, out a4_135, out a5_573);
				}
				a4_178 = vTaskEnterCritical(a4_135, mstatus, out a5_177);
				s2_107 = *((word32) s0_132 + 56);
				if (s2_107 != 0x00)
					goto l2306175C;
l23061720:
			} while (a5_177 != 0x00);
		}
		ptr32 a5_280;
		ptr32 a4_282;
		Eq_2 a3_281 = vTaskExitCritical(a3, mstatus, out a4_282, out a5_280);
		s1Out = s1;
		a0Out = 0x00;
		a1Out = a1;
		a2Out.u0 = <invalid>;
		a3Out = a3_281;
		a4Out = a4_282;
		a5Out = a5_280;
		s2Out = s2_107;
		s3Out = s3_153;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
}

// 230617D0: Register Eq_2 xQueueSemaphoreTake(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out Eq_123360 s4Out, Register out (ptr32 Eq_123361) s8Out)
// Called from:
//      wifi_mgmr_all_ap_scan
//      cmd_mgr_print
//      cmd_mgr_msgind
//      cmd_mgr_llind
//      cmd_mgr_queue
//      cmd_mgr_drain
//      k_sem_take
//      __protocol_send
//      ef_port_env_lock
//      xQueueTakeMutexRecursive
//      sys_sem_new
//      sys_mutex_lock
//      aos_open
//      aos_close
//      aos_stat
//      aos_opendir
//      aos_closedir
//      aos_register_driver
//      aos_register_fs
//      aos_mutex_lock
//      aos_sem_wait
//      http_url_req
//      tcp_connected_callback
//      tcp_receive_callback
//      tcp_err_callback
//      tcp_accept_callback
//      bl_cipstart
//      bl_cipclose
//      bl_cipsslcconf_path
//      bl_cipsslcsni
//      bl_cipsslcalpn
//      bl_sha_mutex_take
Eq_2 xQueueSemaphoreTake(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_123360 & s4Out, struct Eq_123361 & s8Out)
{
	if (a0 == 0x00)
		a2 = user_vAssertCalled(a4, mstatus, out a5);
	if (a5 != 0x00)
	{
		word32 a5_584;
		a2 = user_vAssertCalled(a4, mstatus, out a5_584);
	}
	word32 a5_33;
	Eq_2 a0_132 = xTaskGetSchedulerState(out a5_33);
	if (a0_132 == 0x00)
	{
		a2 = dwArgA4;
		if (a5_33 != 0x00)
		{
			word32 a5_614;
			a2 = user_vAssertCalled(a4, mstatus, out a5_614);
		}
	}
	Eq_2 a4_148;
	Eq_2 a3_147;
	ptr32 a5_146;
	struct Eq_358232 * a5_280;
	Eq_2 a4_281 = vTaskEnterCritical(a4, mstatus, out a5_280);
	Eq_2 s0_284 = a5_280->t0038;
	ptr32 s3_162 = 0x00;
	union Eq_2 * s2_120 = null;
	Eq_2 s1_137 = ~0x00;
	while (a5_280 == null)
	{
		if (a5_280 == null)
		{
			if (s3_162 != 0x00)
			{
				word32 a5_590;
				user_vAssertCalled(a4_281, mstatus, out a5_590);
			}
			a3_147 = vTaskExitCritical(a3, mstatus, out a4_148, out a5_146);
			s3_162 = 0x00;
			goto l230618D0;
		}
		if (s2_120 == null)
			vTaskInternalSetTimeOutState(fp + -40);
		Eq_2 a4_76;
		word32 a5_585;
		Eq_2 a3_75 = vTaskExitCritical(a3, mstatus, out a4_76, out a5_585);
		word32 a5_586;
		word32 a5_587;
		vTaskEnterCritical(vTaskSuspendAll(a4_76, out a5_586), mstatus, out a5_587);
		if ((int32) (byte) (word32) *((word32) s0_284 + 0x0044) == s1_137)
			((word32) s0_284 + 0x0044)->u0 = 0x00;
		if ((int32) (byte) (word32) *((word32) s0_284 + 69) == s1_137)
			*((word32) s0_284 + 69) = 0x00;
		Eq_2 a4_184;
		Eq_2 a1_223;
		word32 a5_101;
		Eq_2 a4_103;
		vTaskExitCritical(a3_75, mstatus, out a4_103, out a5_101);
		a1 = fp + -52;
		word32 a0_112;
		Eq_2 a2_113;
		Eq_2 a3_114;
		Eq_2 a4_115;
		word32 a5_589;
		word32 s1_588;
		Eq_2 s4_121;
		Eq_2 s0_118 = xTaskCheckForTimeOut(fp + -40, fp + -52, dwArgA4, a4_103, a5_101, mstatus, out s1_588, out a0_112, out a2_113, out a3_114, out a4_115, out a5_589, out s2_120, out s4_121);
		if (a0_112 == 0x00)
		{
			struct Eq_358387 * a5_186;
			vTaskEnterCritical(a4_115, mstatus, out a5_186);
			Eq_2 s0_188 = a5_186->t0038;
			if (a5_186 != null)
			{
				Eq_2 a4_256;
				Eq_2 a4_260;
				Eq_2 a5_261;
				word32 t3_601;
				word32 s4_600;
				word32 a6_599;
				word32 a5_596;
				word32 s0_597;
				word32 a5_598;
				xTaskResumeAll(prvUnlockQueue(s0_188, fp + -52, a2_113, vTaskExitCritical(a3_114, mstatus, out a4_256, out a5_596), a4_256, mstatus, dwLoc08, out a4_260, out a5_261), a4_260, a5_261, mstatus, dwArg0118, dwArg0158, out s0_597, out s1_137, out a0_132, out a2, out a3, out a4_184, out a5_598, out a6_599, out s4_600, out t3_601);
				goto l23061860;
			}
			word32 a5_189;
			Eq_2 a4_191;
			Eq_2 a3_190 = vTaskExitCritical(a3_114, mstatus, out a4_191, out a5_189);
			if (a5_189 == 0x00)
			{
				word32 a5_606;
				a1 = xTaskPriorityInherit(a0_112, a2_113, a3_190, vTaskEnterCritical(a4_191, mstatus, out a5_606), out s4_121);
				word32 a5_607;
				a3_190 = vTaskExitCritical(a3_190, mstatus, out a4_191, out a5_607);
			}
			Eq_2 a2_224;
			Eq_2 a4_225;
			Eq_2 a4_238;
			Eq_2 a5_239;
			word32 s0_609;
			word32 a6_611;
			word32 s4_612;
			word32 t3_613;
			word32 a5_610;
			word32 s2_608;
			xTaskResumeAll(prvUnlockQueue(vTaskPlaceOnEventList(s4_121, a1, dwArg24, a3_190, a4_191, mstatus, dwLoc1C, dwArg08, out a1_223, out a2_224, out a4_225, out s2_608, out s3_162), a1_223, a2_224, a3_190, a4_225, mstatus, dwLoc08, out a4_238, out a5_239), a4_238, a5_239, mstatus, dwArg0118, dwArg0158, out s0_609, out s1_137, out a0_132, out a2, out a3, out a4_184, out a5_610, out a6_611, out s4_612, out t3_613);
			a1 = a1_223;
			if (a0_132 == 0x00)
			{
				__syscall();
				a1 = a1_223;
			}
			else
			{
l23061860:
			}
		}
		else
		{
			Eq_2 a4_128;
			Eq_2 a5_129;
			Eq_2 a3_141;
			Eq_2 a4_142;
			word32 a5_592;
			word32 a6_593;
			word32 s4_594;
			word32 t3_595;
			word32 s0_591;
			xTaskResumeAll(prvUnlockQueue(s0_118, fp + -52, a2_113, a3_114, a4_115, mstatus, dwLoc08, out a4_128, out a5_129), a4_128, a5_129, mstatus, dwArg0118, dwArg0158, out s0_591, out s1_137, out a0_132, out a2, out a3_141, out a4_142, out a5_592, out a6_593, out s4_594, out t3_595);
			word32 a5_143;
			vTaskEnterCritical(a4_142, mstatus, out a5_143);
			if (a5_143 == 0x00)
			{
				a3_147 = vTaskExitCritical(a3_141, mstatus, out a4_148, out a5_146);
				if (s3_162 != 0x00)
				{
					Eq_2 a5_152;
					Eq_2 a4_153 = vTaskEnterCritical(a4_148, mstatus, out a5_152);
					if (fp != ~0x33)
					{
						a5_152 = *a5_152;
						a1 = 32 - a5_152;
					}
					Eq_2 a3_177;
					s1_137 = vTaskPriorityDisinheritAfterTimeout(a0_132, a1, a2, a3_147, a4_153, a5_152, mstatus, dwLoc08, out a1, out a3_177, out s2_120);
					s3_162 = 0x00;
					a3_147 = vTaskExitCritical(a3_177, mstatus, out a4_148, out a5_146);
				}
				goto l230618D0;
			}
			word32 a5_605;
			a3 = vTaskExitCritical(a3_141, mstatus, out a4_184, out a5_605);
		}
		a4_281 = vTaskEnterCritical(a4_184, mstatus, out a5_280);
		s2_120 = (union Eq_2 *) 0x01;
		s0_284 = a5_280->t0038;
	}
	word32 s0_287 = *a4_281;
	struct Eq_358253 * a5_289 = (char *) a5_280 - 1;
	a5_289->dw0038 = s0_287;
	if (a4_281 == 0x00)
	{
		a3 = pvTaskIncrementMutexHeldCount(a0_132, a4_281, out a4_281, out a5_289);
		*((word32) a0_132 + 8) = s0_287;
	}
	Eq_2 s0_301 = a5_289->t0010;
	if (a5_289 != null)
	{
		word32 a0_329;
		word32 a2_602;
		word32 a4_603;
		word32 a5_604;
		s1_137 = xTaskRemoveFromEventList(s0_301, a1, a2, a3, a4_281, mstatus, out a0_329, out a1, out a2_602, out a3, out a4_603, out a5_604);
		if (a0_329 != 0x00)
			__syscall();
	}
	a3_147 = vTaskExitCritical(a3, mstatus, out a4_148, out a5_146);
	s3_162 = 0x01;
l230618D0:
	s1Out = s1_137;
	a0Out = s3_162;
	a1Out = a1;
	a2Out = dwArg0138;
	a3Out = a3_147;
	a4Out = a4_148;
	a5Out = a5_146;
	s2Out = s2_120;
	s3Out = s3_162;
	s4Out = dwArgF4;
	s8Out = dwArgD4;
	return dwArg0158;
}

// 23061958: Register Eq_2 xQueueTakeMutexRecursive(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out)
// Called from:
//      at_serial_lock
//      at_data_output
//      at_dump_noend
Eq_2 xQueueTakeMutexRecursive(Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out)
{
	if (a0 == 0x00)
	{
		word32 a5_135;
		a2 = user_vAssertCalled(a4, mstatus, out a5_135);
	}
	Eq_2 s0_22 = *((word32) s1 + 8);
	Eq_2 a5_24;
	if (s1 == xTaskGetCurrentTaskHandle(out a5_24))
	{
		*((word32) a5_24 + 0x0D) = *((word32) a5_24 + 0x0C);
		0x00 = (int8) dwArg38;
		a0Out = 0x01;
		a2Out.u0 = <invalid>;
		a3Out = a3;
		a4Out = a4;
		s2Out = a1;
		s3Out = s3;
		return s1;
	}
	else
	{
		ptr32 a0_43;
		Eq_2 a3_46;
		Eq_2 a4_47;
		struct Eq_358635 * a5_48;
		Eq_2 s1_51;
		Eq_2 s2_52;
		ptr32 s3_53;
		word32 s8_139;
		word32 s4_138;
		word32 a2_137;
		word32 a1_136;
		xQueueSemaphoreTake(s0_22, a1, a2, a3, a4, a5_24, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_51, out a0_43, out a1_136, out a2_137, out a3_46, out a4_47, out a5_48, out s2_52, out s3_53, out s4_138, out s8_139);
		if (a0_43 != 0x00)
			a5_48->dw000D = a5_48->dw000C;
		0x00 = (int8) dwArg38;
		a0Out = a0_43;
		a2Out.u0 = <invalid>;
		a3Out = a3_46;
		a4Out = a4_47;
		s2Out = s2_52;
		s3Out = s3_53;
		return s1_51;
	}
}

// 230619A8: Register (ptr32 Eq_251110) uxQueueMessagesWaiting(Register (ptr32 Eq_251110) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      k_queue_is_empty
//      k_queue_get_cnt
//      k_sem_count_get
//      sys_mbox_free
struct Eq_251110 * uxQueueMessagesWaiting(struct Eq_251110 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	if (a0 == null)
	{
		word32 a5_40;
		user_vAssertCalled(a4, mstatus, out a5_40);
	}
	word32 a5_41;
	vTaskEnterCritical(a4, mstatus, out a5_41);
	struct Eq_251110 * s0_20 = a0->ptr0038;
	ptr32 a5_23;
	ptr32 a4_25;
	Eq_2 a3_24 = vTaskExitCritical(a3, mstatus, out a4_25, out a5_23);
	a2Out = dwArg10;
	a3Out = a3_24;
	a4Out = a4_25;
	a5Out = a5_23;
	return s0_20;
}

