pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 230619CC: Register word32 vQueueDelete(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 word32) a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out)
// Called from:
//      wifi_mgmr_all_ap_scan
//      ble_controller_deinit
//      k_queue_free
//      k_sem_delete
//      sys_mbox_free
//      sys_sem_free
//      aos_mutex_free
//      aos_sem_free
//      at_server_init
//      http_url_req
//      at_cmd_impl_init
word32 vQueueDelete(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, word32 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		word32 a5_166;
		user_vAssertCalled(a4, mstatus, out a5_166);
		word32 * a4_121 = null;
		do
		{
			if (a0 == a3)
			{
				struct Eq_358727 * a4_24 = a4_121 << 3;
				a4_24->dw42026674 = 0x00;
				a4_24->dw42026678 = 0x00;
				a4_121 = &a4_24->dw42026674;
				break;
			}
			a4_121 = (word32 *) ((char *) a4_121 + 1);
		} while (a4_121 != (word32 *) 0x08);
		Eq_2 a5_33 = (word32) *((word32) a0 + 70);
		if (a5_33 == 0x00)
		{
			ptr32 a2_41;
			Eq_2 a3_42;
			word32 * a4_43;
			Eq_2 a5_44;
			ptr32 s1_45;
			Eq_2 a0_47;
			ptr32 a1_48;
			word32 s0_50;
			ptr32 s4_51;
			word32 t3_168;
			word32 a6_167;
			vPortFree(a0, 0x08, a5_33, mstatus, dwArg0158, dwArg0198, out s0_50, out s1_45, out a0_47, out a1_48, out a2_41, out a3_42, out a4_43, out a5_44, out a6_167, out s4_51, out t3_168);
			s1Out = s1_45;
			a0Out = a0_47;
			a1Out = a1_48;
			a2Out = a2_41;
			a3Out = a3_42;
			a4Out = a4_43;
			a5Out = a5_44;
			s4Out = s4_51;
			return s0_50;
		}
		else
		{
			s1Out = s1;
			a0Out = a0;
			a1Out = 0x42026674;
			a2Out = 0x08;
			a3Out = a3;
			a4Out = a4_121;
			a5Out = a5_33;
			s4Out = s4;
			return s0;
		}
	}
	else
	{
		word32 * a4_120 = null;
		do
		{
			if (a0 == a3)
			{
				struct Eq_358699 * a4_66 = a4_120 << 3;
				a4_66->dw42026674 = 0x00;
				a4_66->dw42026678 = 0x00;
				a4_120 = &a4_66->dw42026674;
				break;
			}
			a4_120 = (word32 *) ((char *) a4_120 + 1);
		} while (a4_120 != (word32 *) 0x08);
		Eq_2 a5_75 = (word32) *((word32) a0 + 70);
		if (a5_75 == 0x00)
		{
			ptr32 a2_81;
			Eq_2 a3_82;
			word32 * a4_83;
			Eq_2 a5_84;
			ptr32 s1_85;
			Eq_2 a0_87;
			ptr32 a1_88;
			word32 s0_90;
			ptr32 s4_91;
			word32 t3_170;
			word32 a6_169;
			vPortFree(a0, 0x08, a5_75, mstatus, dwArg0158, dwArg0198, out s0_90, out s1_85, out a0_87, out a1_88, out a2_81, out a3_82, out a4_83, out a5_84, out a6_169, out s4_91, out t3_170);
			s1Out = s1_85;
			a0Out = a0_87;
			a1Out = a1_88;
			a2Out = a2_81;
			a3Out = a3_82;
			a4Out = a4_83;
			a5Out = a5_84;
			s4Out = s4_91;
			return s0_90;
		}
		else
		{
			s1Out = s1;
			a0Out = a0;
			a1Out = 0x42026674;
			a2Out = 0x08;
			a3Out = a3;
			a4Out = a4_120;
			a5Out = a5_75;
			s4Out = s4;
			return s0;
		}
	}
}

// 23061A52: Register word32 vQueueAddToRegistry(Register (ptr32 Eq_358804) a0, Register (ptr32 ui32) a1, Register Eq_2 a3)
// Called from:
//      prvCheckForValidListAndQueue
word32 vQueueAddToRegistry(struct Eq_358804 * a0, ui32 * a1, Eq_2 a3)
{
	ui32 a4_12;
	for (a4_12 = 0x00; a4_12 != 0x08; ++a4_12)
	{
		if (a3 == 0x00)
		{
			ui32 a4_13 = a4_12 << 3;
			*a1 = a4_13 + 0x42026674;
			a0->dw0004 = a4_13 + 0x42026674;
			return;
		}
	}
	return;
}

// 23061A7A: Register Eq_2 vQueueWaitForMessageRestricted(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out)
// Called from:
//      prvTimerTask
Eq_2 vQueueWaitForMessageRestricted(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out)
{
	word32 a5_139;
	vTaskEnterCritical(a4, mstatus, out a5_139);
	if ((int32) (byte) (word32) *((word32) a0 + 0x0044) == ~0x00)
		((word32) a0 + 0x0044)->u0 = 0x00;
	if ((int32) (byte) (word32) *((word32) a0 + 69) == ~0x00)
		*((word32) a0 + 69) = 0x00;
	struct Eq_358863 * a5_39;
	Eq_2 a4_41;
	Eq_2 a3_40 = vTaskExitCritical(a3, mstatus, out a4_41, out a5_39);
	Eq_2 s0_43 = a5_39->t0038;
	if (a5_39 == null)
	{
		Eq_2 a1_54;
		Eq_2 a4_56;
		ptr32 s3_62;
		Eq_2 s0_59 = vTaskPlaceOnEventListRestricted((word32) s0_43 + 36, a1, a2, a3_40, a4_41, mstatus, dwArg14, dwArg38, out a1_54, out a4_56, out s3_62);
		0x00 = (int8) dwArg38;
		ptr32 a4_73;
		ptr32 a5_74;
		Eq_2 a3_72 = prvUnlockQueue(s0_59, a1_54, dwArg10, a3_40, a4_56, mstatus, dwArg38, out a4_73, out a5_74);
		a4Out = a4_73;
		a5Out = a5_74;
		s3Out = s3_62;
		return a3_72;
	}
	else
	{
		0x00 = (int8) dwArg38;
		ptr32 a4_86;
		ptr32 a5_87;
		Eq_2 a3_85 = prvUnlockQueue(s0_43, a1, dwArg10, a3_40, a4_41, mstatus, dwArg38, out a4_86, out a5_87);
		a4Out = a4_86;
		a5Out = a5_87;
		s3Out = s3;
		return a3_85;
	}
}

// 23061AE6: Register Eq_2 prvInitialiseNewStreamBuffer(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 a4, Register ptr32 mstatus, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      xStreamBufferGenericCreate
//      xStreamBufferGenericCreateStatic
Eq_2 prvInitialiseNewStreamBuffer(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 a4, ptr32 mstatus, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out)
{
	Eq_2 a0_28;
	Eq_2 a4_32;
	word32 t1_93;
	word32 a1_94;
	word32 a2_95;
	word32 a3_96;
	word32 a5_97;
	Eq_2 ra_34 = memset(ra, a1, 0x0055, a2, out t1_93, out a0_28, out a1_94, out a2_95, out a3_96, out a4_32, out a5_97);
	if (a1 != a0_28)
	{
		word32 a5_102;
		user_vAssertCalled(a4_32, mstatus, out a5_102);
	}
	ptr32 a3_48;
	ptr32 a4_49;
	ptr32 a5_50;
	word32 t1_98;
	word32 a0_99;
	word32 a1_100;
	word32 a2_101;
	Eq_2 ra_51 = memset(ra_34, a0, 0x00, 36, out t1_98, out a0_99, out a1_100, out a2_101, out a3_48, out a4_49, out a5_50);
	*((word32) a1 + 24) = a0;
	*((word32) a0 + 8) = a2;
	*((word32) a0 + 0x0C) = a3;
	*((word32) a0 + 28) = (byte) a4;
	s0Out = s1;
	s1Out = a1;
	a3Out = a3_48;
	a4Out = a4_49;
	a5Out = a5_50;
	s2Out = a4;
	s4Out = dwArg04;
	return ra_51;
}

// 23061B3A: Register Eq_2 prvWriteBytesToBuffer(Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_359002 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      xStreamBufferSend
//      xStreamBufferSendFromISR
Eq_2 prvWriteBytesToBuffer(Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_359002 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	Eq_359002 a3_104;
	ptr32 a1_102;
	Eq_2 a5_100;
	Eq_2 a4_114;
	Eq_2 s0_132;
	word32 s1_129;
	if (a2 != 0x00)
	{
		a0 = *((word32) a5 + 8);
		s3 = a5 - s0;
		if (a2 >= s3)
		{
			a4 = s0 + s3;
			if (a5 >= a4)
				goto l23061B64;
		}
		else
		{
			s3 = a2;
			a4 = s0 + a2;
			if (a5 >= a4)
				goto l23061B64;
		}
	}
	else
	{
		Eq_2 a5_25;
		user_vAssertCalled(a4, mstatus, out a5_25);
		if (a5_25 >= s0)
		{
			word32 a2_251;
			word32 a6_252;
			word32 a7_253;
			memcpy(a0 + s0, a1, 0x00, out a1_102, out a2_251, out a3_104, out a4_114, out a5_100, out a6_252, out a7_253);
			s1_129 = (word32) *((word32) a5_100 + 8);
			s0_132 = s0 + a2;
			if (s0_132 < a5_100)
				goto l23061B92;
			goto l23061B90;
		}
		s3.u0 = 0x00;
	}
	word32 a5_240;
	user_vAssertCalled(a4, mstatus, out a5_240);
l23061B64:
	word32 a0_72 = a0 + s0;
	word32 a2_241;
	word32 a6_242;
	word32 a7_243;
	memcpy(a0_72, a1, s3, out a1_102, out a2_241, out a3_104, out a4_114, out a5_100, out a6_242, out a7_243);
	if (s3 < a2)
	{
		Eq_2 a2_89 = a2 - s3;
		if (a5_100 >= a2_89)
		{
			word32 a2_248;
			word32 a6_249;
			word32 a7_250;
			memcpy(a0_72, a1 + s3, a2_89, out a1_102, out a2_248, out a3_104, out a4_114, out a5_100, out a6_249, out a7_250);
		}
		else
		{
			word32 a5_244;
			user_vAssertCalled(a4_114, mstatus, out a5_244);
			word32 a2_245;
			word32 a6_246;
			word32 a7_247;
			memcpy(a0_72, a1 + s3, a2_89, out a1_102, out a2_245, out a3_104, out a4_114, out a5_100, out a6_246, out a7_247);
		}
	}
	s1_129 = (word32) *((word32) a5_100 + 8);
	s0_132 = s0 + a2;
	if (s0_132 < a5_100)
	{
l23061B92:
		*((word32) s0_132 + 4) = s1_129;
		0x00 = (int8) dwArg0128;
		a0Out = a2;
		a1Out = a1_102;
		a2Out = dwArg0100;
		a3Out = a3_104;
		a4Out = a4_114;
		a5Out = a5_100;
		s2Out = a2;
		s3Out = s3;
		return dwArgE4;
	}
l23061B90:
	s0_132 -= a5_100;
	goto l23061B92;
}

// 23061BF0: Register (ptr32 Eq_2) prvReadBytesFromBuffer(Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out (ptr32 Eq_2) s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out)
// Called from:
//      xStreamBufferReceive
//      xStreamBufferReceiveFromISR
union Eq_2 * prvReadBytesFromBuffer(union Eq_2 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out)
{
	Eq_2 s0_19 = a3;
	if (a3 >= a2)
		s0_19 = a2;
	union Eq_2 * s1_129;
	s1_129 = s1;
	if (s0_19 == 0x00)
	{
l23061C5C:
		s1Out = s1_129;
		a0Out = s0_19;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5;
		return s1;
	}
	Eq_2 a4_53;
	Eq_2 s3_26 = *a0;
	Eq_2 s4_30 = a5 - s3_26;
	if (s0_19 >= s4_30)
	{
		if (a2 >= s4_30)
		{
l23061C22:
			a4_53 = s3_26 + s4_30;
			if (a5 >= a4_53)
				goto l23061C2A;
l23061C8A:
			word32 a5_299;
			user_vAssertCalled(a4_53, mstatus, out a5_299);
l23061C2A:
			word32 a2_300;
			word32 a6_301;
			word32 a7_302;
			memcpy(a1, a1 + s3_26, s4_30, out a1, out a2_300, out a3, out a4, out a5, out a6_301, out a7_302);
			s2 = a2;
			s5 = a1;
			if (s4_30 < s0_19)
			{
				if (a2 < s0_19)
				{
					word32 a5_303;
					user_vAssertCalled(a4, mstatus, out a5_303);
				}
				word32 a7_306;
				word32 a2_304;
				word32 a6_305;
				memcpy(a1 + s4_30, a1, s0_19 - s4_30, out a1, out a2_304, out a3, out a4, out a5, out a6_305, out a7_306);
			}
			s1_129 = (union Eq_2 *) *((word32) a5 + 8);
			s3 = s3_26 + s0_19;
			if (s3 >= a5)
				s3 -= a5;
			*s1_129 = (union Eq_2 *) s3;
			goto l23061C5C;
		}
	}
	else
	{
		s4_30 = s0_19;
		if (a2 >= s0_19)
			goto l23061C22;
	}
	Eq_2 a5_48;
	user_vAssertCalled(a4, mstatus, out a5_48);
	a4_53 = s3_26 + s4_30;
	if (a5_48 >= a4_53)
		goto l23061C2A;
	goto l23061C8A;
}

