pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23061C96: Register Eq_2 xStreamBufferGenericCreate(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out)
// Called from:
//      vfs_uart_open
Eq_2 xStreamBufferGenericCreate(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 a5_14 = 0x01;
	Eq_2 s1_18 = a1;
	if (a2 != 0x01)
	{
		if (a0 == 0x00)
		{
			user_vAssertCalled(a4, mstatus, out a5_14);
			if (a0 >= a1)
				goto l23061CB4;
			goto l23061CE6;
		}
	}
	else
	{
		a5_14.u0 = 0x04;
		if (a0 <= 0x04)
		{
			user_vAssertCalled(a4, mstatus, out a5_14);
			if (a0 >= a1)
			{
l23061CB4:
				if (a1 != 0x00)
					goto l23061CB6;
l23061CE2:
				s1_18.u0 = 0x01;
l23061CB6:
				word32 s8_229;
				Eq_2 a0_78;
				ptr32 s3_88;
				word32 s4_228;
				word32 a1_224;
				word32 a2_225;
				word32 a6_226;
				word32 s2_227;
				Eq_2 s1_107;
				ptr32 a3_101;
				ptr32 a4_102;
				ptr32 a5_103;
				Eq_2 s0_106 = pvPortMalloc(ra, s1_18, (word32) a0 + 37, a3, a4, a5_14, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_107, out a0_78, out a1_224, out a2_225, out a3_101, out a4_102, out a5_103, out a6_226, out s2_227, out s3_88, out s4_228, out s8_229);
				Eq_2 s2_108 = a0_78;
				if (a0_78 != 0x00)
				{
					word32 s4_230;
					ra = prvInitialiseNewStreamBuffer(ra, a0_78, (word32) a0_78 + 36, (word32) s0_106 + 1, s1_107, s3_88, mstatus, out s0_106, out s1_107, out a3_101, out a4_102, out a5_103, out s2_108, out s4_230);
				}
				s0Out = s0_106;
				s1Out = s1_107;
				a0Out = s2_108;
				a3Out = a3_101;
				a4Out = a4_102;
				a5Out = a5_103;
				s2Out = s2_108;
				return ra;
			}
l23061CE6:
			user_vAssertCalled(a4, mstatus, out a5_14);
			if (a1 != 0x00)
				goto l23061CB6;
			goto l23061CE2;
		}
	}
	if (a0 >= a1)
		goto l23061CB4;
	goto l23061CE6;
}

// 23061D0C: Register Eq_2 xStreamBufferGenericCreateStatic(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out Eq_2 s4Out)
// Called from:
//      wifi_mgmr_init
Eq_2 xStreamBufferGenericCreateStatic(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & a0Out, union Eq_2 & s4Out)
{
	ptr32 s1_114;
	Eq_2 s4_161 = a0;
	Eq_2 s2_120 = a1;
	Eq_2 s0_102 = a4;
	if (a3 != 0x00)
	{
		if (a4 != 0x00)
		{
l23061D28:
			if (a0 >= a1)
			{
l23061D2C:
				if (a1 != 0x00)
				{
l23061D30:
					s1_114 = (word32) (a2 != 0x00) + 0x02;
					if (a0 > 0x04)
					{
l23061D3C:
						if (a4 == 36)
						{
l23061D48:
							if (a3 != 0x00)
							{
l23061D4C:
								if (a4 != 0x00)
								{
									word32 a3_383;
									word32 s2_386;
									word32 a5_385;
									word32 a4_384;
									word32 s1_382;
									ra = prvInitialiseNewStreamBuffer(ra, a4, a3, a0, s2_120, s1_114, mstatus, out s0_102, out s1_382, out a3_383, out a4_384, out a5_385, out s2_386, out s4_161);
									*((byte) s0_102.u0 + 28) = (byte) ((word32) *((byte) s0_102.u0 + 28) | 2);
								}
l23061D68:
								0x00 = (int8) dwArg0128;
								s0Out = dwArgE4;
								a0Out = s0_102;
								s4Out = s4_161;
								return ra;
							}
l23061DA0:
							s0_102.u0 = 0x00;
							goto l23061D68;
						}
l23061D98:
						word32 a5_381;
						user_vAssertCalled(a4, mstatus, out a5_381);
						if (a3 != 0x00)
							goto l23061D4C;
						goto l23061DA0;
					}
l23061D88:
					word32 a5_380;
					user_vAssertCalled(a4, mstatus, out a5_380);
					if (a4 == 36)
						goto l23061D48;
					goto l23061D98;
				}
l23061D7A:
				s2_120.u0 = 0x01;
				s1_114 = (word32) (a2 != 0x00) + 0x02;
				if (a0 > 0x04)
					goto l23061D3C;
				goto l23061D88;
			}
l23061DA4:
			word32 a5_379;
			user_vAssertCalled(a4, mstatus, out a5_379);
			if (a1 != 0x00)
				goto l23061D30;
			goto l23061D7A;
		}
	}
	else
	{
		word32 a5_377;
		user_vAssertCalled(a4, mstatus, out a5_377);
		if (a4 != 0x00)
			goto l23061D28;
	}
	word32 a5_378;
	user_vAssertCalled(a4, mstatus, out a5_378);
	if (a0 >= a1)
		goto l23061D2C;
	goto l23061DA4;
}

// 23061DC0: Register Eq_2 vStreamBufferDelete(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out)
// Called from:
//      vfs_uart_close
Eq_2 vStreamBufferDelete(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a4Out)
{
	if (a0 == 0x00)
	{
		word32 a5_103;
		user_vAssertCalled(a4, mstatus, out a5_103);
		ui32 a5_13 = (word32) *((word32) a0 + 28);
		if ((a5_13 & 0x02) != 0x00)
		{
			ptr32 a0_19;
			ptr32 a2_21;
			ptr32 a4_23;
			word32 t1_118;
			word32 a1_119;
			word32 a3_120;
			word32 a5_121;
			Eq_2 ra_25 = memset(ra, a0, 0x00, 36, out t1_118, out a0_19, out a1_119, out a2_21, out a3_120, out a4_23, out a5_121);
			s1Out = s1;
			a0Out = a0_19;
			a2Out = a2_21;
			a4Out = a4_23;
			return ra_25;
		}
		else
		{
			ptr32 a2_30;
			ptr32 a4_32;
			ptr32 s1_34;
			ptr32 a0_36;
			word32 s0_111;
			word32 a1_112;
			word32 a3_113;
			word32 a5_114;
			word32 a6_115;
			word32 s4_116;
			word32 t3_117;
			vPortFree(a0, dwArg24, a5_13 & 0x02, mstatus, dwArg0158, dwArg0198, out s0_111, out s1_34, out a0_36, out a1_112, out a2_30, out a3_113, out a4_32, out a5_114, out a6_115, out s4_116, out t3_117);
			s1Out = s1_34;
			a0Out = a0_36;
			a2Out = a2_30;
			a4Out = a4_32;
			return ra;
		}
	}
	else
	{
		ui32 a5_43 = (word32) *((word32) a0 + 28);
		if ((a5_43 & 0x02) != 0x00)
		{
			ptr32 a0_47;
			ptr32 a2_49;
			ptr32 a4_51;
			word32 t1_122;
			word32 a1_123;
			word32 a3_124;
			word32 a5_125;
			Eq_2 ra_53 = memset(ra, a0, 0x00, 36, out t1_122, out a0_47, out a1_123, out a2_49, out a3_124, out a4_51, out a5_125);
			s1Out = s1;
			a0Out = a0_47;
			a2Out = a2_49;
			a4Out = a4_51;
			return ra_53;
		}
		else
		{
			ptr32 a2_57;
			ptr32 a4_59;
			ptr32 s1_61;
			ptr32 a0_63;
			word32 s0_104;
			word32 a1_105;
			word32 a3_106;
			word32 a5_107;
			word32 a6_108;
			word32 s4_109;
			word32 t3_110;
			vPortFree(a0, a2, a5_43 & 0x02, mstatus, dwArg0158, dwArg0198, out s0_104, out s1_61, out a0_63, out a1_105, out a2_57, out a3_106, out a4_59, out a5_107, out a6_108, out s4_109, out t3_110);
			s1Out = s1_61;
			a0Out = a0_63;
			a2Out = a2_57;
			a4Out = a4_59;
			return ra;
		}
	}
}

// 23061E02: Register Eq_2 xStreamBufferSpacesAvailable(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_359514 a5, Register ptr32 mstatus, Register out Eq_359514 a5Out)
// Called from:
//      xStreamBufferSend
//      xStreamBufferSendFromISR
Eq_2 xStreamBufferSpacesAvailable(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_359514 a5, ptr32 mstatus, union Eq_359514 & a5Out)
{
	if (a0 == 0x00)
	{
		Eq_359514 a5_11;
		user_vAssertCalled(a4, mstatus, out a5_11);
		word32 a0_19 = a4 + a5_11 + ~0x00 - a3;
		if (a0_19 >= a4)
			a0_19 -= a4;
		a5Out = a5_11;
		return a0_19;
	}
	else
	{
		word32 a0_32 = a4 + a5 + ~0x00 - a3;
		if (a0_32 < a4)
		{
			a5Out = a5;
			return a0_32;
		}
		else
		{
			a5Out = a5;
			return a0_32 - a4;
		}
	}
}

// 23061E42: Register Eq_2 xStreamBufferSend(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_event_notify
//      vfs_uart_write
Eq_2 xStreamBufferSend(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s4_135 = a1;
	Eq_2 s0_132 = a0;
	Eq_2 s3_116 = a2;
	if (a1 != 0x00)
	{
		if (a0 != 0x00)
			goto l23061E60;
	}
	else
	{
		word32 a5_714;
		user_vAssertCalled(a4, mstatus, out a5_714);
		if (a0 != 0x00)
			goto l23061E60;
	}
	word32 a5_715;
	user_vAssertCalled(a4, mstatus, out a5_715);
l23061E60:
	Eq_2 a3_128;
	Eq_2 s1_180;
	Eq_2 s1_133;
	ui32 a5_36 = (word32) *((word32) a0 + 28);
	Eq_2 s2_134 = a2;
	Eq_359514 a5_130 = a5_36 & 0x01;
	if ((a5_36 & 0x01) != 0x00)
	{
		s2_134 = (word32) a2 + 4;
		if (a2 >= (word32) a2 + 4)
		{
			user_vAssertCalled(a4, mstatus, out a5_130);
			if (a5_130 == 0x00)
			{
				a3_128 = a3;
				goto l23061F18;
			}
l23061E76:
			a3_128 = vTaskSetTimeOutState(fp + -40, a4, a5_130, mstatus, out a4);
			do
			{
				Eq_359514 a5_68;
				Eq_2 a4_69 = vTaskEnterCritical(a4, mstatus, out a5_68);
				Eq_2 a5_75;
				Eq_2 a0_73 = xStreamBufferSpacesAvailable(s0_132, a3_128, a4_69, a5_68, mstatus, out a5_75);
				s1_133 = a0_73;
				if (a0_73 >= s2_134)
				{
					a3_128 = vTaskExitCritical(a3_128, mstatus, out a4, out a5_130);
					break;
				}
				Eq_2 a4_81;
				struct Eq_359626 * a5_82;
				Eq_2 a3_89 = xTaskNotifyStateClear(0x00, a3_128, a4_69, a5_75, mstatus, out a4_81, out a5_82);
				word32 s0_91 = a5_82->dw0014;
				if (a5_82 != null)
				{
					word32 a5_723;
					user_vAssertCalled(a4_81, mstatus, out a5_723);
				}
				word32 a5_717;
				*((word32) xTaskGetCurrentTaskHandle(out a5_717) + 20) = s0_91;
				Eq_2 a4_102;
				Eq_2 a2_110;
				Eq_2 a4_111;
				word32 a5_112;
				word32 s2_720;
				word32 a5_718;
				word32 s1_719;
				word32 s4_721;
				*((word32) xTaskNotifyWait(null, 0x00, 0x00, vTaskExitCritical(a3_89, mstatus, out a4_102, out a5_718), a4_102, mstatus, s2, dwArgE8, out s1_719, out a2_110, out a4_111, out a5_112, out s2_720, out s3_116, out s4_721, out s5) + 20) = 0x00;
				a1 = fp + -52;
				word32 a0_126;
				word32 a2_722;
				s0_132 = xTaskCheckForTimeOut(fp + -40, fp + -52, a2_110, a4_111, a5_112, mstatus, out s1_133, out a0_126, out a2_722, out a3_128, out a4, out a5_130, out s2_134, out s4_135);
			} while (a0_126 == 0x00);
			if (s1_133 != 0x00)
			{
l23061EC8:
				Eq_2 a2_189;
				ui32 a5_173 = (word32) *((word32) s0_132 + 28);
				Eq_2 a5_174 = a5_173 & 0x01;
				if ((a5_173 & 0x01) == 0x00)
				{
					a2_189 = s3_116;
					if (s1_133 < s3_116)
						a2_189 = s1_133;
l23061ED8:
					Eq_2 a0_238;
					word32 a5_243;
					word32 a2_740;
					prvWriteBytesToBuffer(s0_132, s0_132, s4_135, a2_189, a4, a5_174, mstatus, dwArgE8, out a0_238, out a1, out a2_740, out a3_128, out a4, out a5_243, out s2_134, out s3_116);
					s1_180 = a0_238;
					if (a0_238 != 0x00)
					{
						Eq_2 a5_264 = (word32) a4 + a5_243 - a3_128;
						if (a5_264 >= a4)
							a5_264 -= a4;
						if (a5_264 >= a4)
						{
							Eq_2 a5_271;
							Eq_2 a4_270 = vTaskSuspendAll(a4, out a5_271);
							if (a5_271 != 0x00)
							{
								struct Eq_359766 * s0_297;
								word32 s1_731;
								word32 a2_733;
								word32 a0_732;
								word32 s4_734;
								ra = xTaskGenericNotify(ra, a0_238, 0x00, 0x00, 0x00, a4_270, mstatus, s4, dwLoc08, dwArg18, dwArgA4, dwArgC0, dwArgC4, dwArgE8, out s0_297, out s1_731, out a0_732, out a1, out a2_733, out a3_128, out a4_270, out a5_271, out s2_134, out s3_116, out s4_734, out mstatus);
								s0_297->dw0010 = 0x00;
							}
							word32 s0_724;
							word32 s4_729;
							word32 t3_730;
							word32 a5_727;
							word32 a0_725;
							word32 a6_728;
							word32 a2_726;
							xTaskResumeAll(a3_128, a4_270, a5_271, mstatus, dwArg0118, dwArg0158, out s0_724, out s1_180, out a0_725, out a2_726, out a3_128, out a4, out a5_727, out a6_728, out s4_729, out t3_730);
						}
					}
l23061F26:
					s1Out = s1_180;
					a0Out = s1_180;
					a1Out = a1;
					a3Out = a3_128;
					a4Out = a4;
					s2Out = s2_134;
					s3Out = s3_116;
					s4Out = dwArgF4;
					s5Out = s5;
					mstatusOut = mstatus;
					return ra;
				}
				if (s1_133 >= s2_134)
				{
					word32 a1_736;
					word32 a3_737;
					word32 s2_738;
					word32 a0_735;
					word32 s3_739;
					s0_132 = prvWriteBytesToBuffer(s0_132, s0_132, fp + -44, 0x04, a4, a5_173 & 0x01, mstatus, dwArgE8, out a0_735, out a1_736, out a2_189, out a3_737, out a4, out a5_174, out s2_738, out s3_739);
					s4_135 = a3;
					goto l23061ED8;
				}
l23061F24:
				s1_180.u0 = 0x00;
				goto l23061F26;
			}
l23061F18:
			word32 a5_716;
			Eq_2 a0_157 = xStreamBufferSpacesAvailable(s0_132, a3_128, a4, a5_130, mstatus, out a5_716);
			s1_133 = a0_157;
			if (a0_157 == 0x00)
				goto l23061F24;
			goto l23061EC8;
		}
	}
	a3_128 = a3;
	if ((a5_36 & 0x01) == 0x00)
		goto l23061F18;
	goto l23061E76;
}

// 23061F68: Register word32 xStreamBufferSendFromISR(Register word32 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg14, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      __uart_rx_irq
word32 xStreamBufferSendFromISR(word32 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg14, Eq_2 dwArgF8, word32 dwArg0128, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s2_17 = a1;
	Eq_2 s0_100 = a0;
	if (a1 != 0x00)
	{
		if (a0 != 0x00)
			goto l23061F82;
	}
	else
	{
		word32 a5_371;
		user_vAssertCalled(a4, mstatus, out a5_371);
		if (a0 != 0x00)
			goto l23061F82;
	}
	word32 a5_372;
	user_vAssertCalled(a4, mstatus, out a5_372);
l23061F82:
	ui32 a5_36 = (word32) *((word32) a0 + 28);
	Eq_2 s4_39 = a2;
	if ((a5_36 & 0x01) != 0x00)
		s4_39 = (word32) a2 + 4;
	Eq_2 s1_133;
	Eq_2 a5_108;
	Eq_2 a0_52 = xStreamBufferSpacesAvailable(a0, a3, a4, a5_36 & 0x01, mstatus, out a5_108);
	Eq_2 dwArg54_197 = a2;
	if (a0_52 != 0x00)
	{
		Eq_2 a2_103;
		ui32 a5_61 = (word32) *((word32) a0 + 28);
		a5_108 = a5_61 & 0x01;
		if ((a5_61 & 0x01) == 0x00)
		{
			a2_103 = a2;
			if (a0_52 < a2)
				a2_103 = a0_52;
			dwArg54_197 = a2_103;
		}
		else
		{
			if (a0_52 < s4_39)
				goto l23061F9A;
			word32 s3_377;
			word32 a0_373;
			word32 a3_376;
			word32 a2_375;
			word32 a1_374;
			s0_100 = prvWriteBytesToBuffer(a0, a0, fp + -36, 0x04, a4, a5_61 & 0x01, mstatus, dwArgF8, out a0_373, out a1_374, out a2_375, out a3_376, out a4, out a5_108, out s2_17, out s3_377);
			a2_103 = a2;
		}
		word32 a2_379;
		word32 a1_378;
		word32 s2_380;
		Eq_2 a0_112;
		Eq_2 s3_123;
		prvWriteBytesToBuffer(s0_100, s0_100, s2_17, a2_103, a4, a5_108, mstatus, dwArgF8, out a0_112, out a1_378, out a2_379, out a3, out a4, out a5_108, out s2_380, out s3_123);
		s1_133 = a0_112;
		if (a0_112 != 0x00)
		{
			a5_108 = a5_108 + a4 - a3;
			if (a5_108 >= a4)
				a5_108 -= a4;
			if (a5_108 >= a4 && a5_108 != 0x00)
			{
				struct Eq_359939 * s0_167;
				ra = xTaskGenericNotifyFromISR(ra, a0_112, null, 0x00, 0x00, s3_123, a5_108, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, dwArg54_197, out s0_167, out s1_133, out a3, out a4, out a5_108, out mstatus);
				s0_167->dw0010 = 0x00;
			}
		}
l23061F9C:
		0x00 = dwArg0128;
		a0Out = s1_133;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_108;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
l23061F9A:
		s1_133.u0 = 0x00;
		goto l23061F9C;
	}
}

// 2306201A: Register Eq_2 xStreamBufferReceive(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_114119) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out (ptr32 Eq_2) s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_start
//      vfs_uart_read
//      uart_ioctl_cmd_waimode
Eq_2 xStreamBufferReceive(Eq_2 ra, Eq_2 s0, struct Eq_114119 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArgB4, Eq_2 dwArgD0, Eq_2 dwArgD4, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s3_104 = a1;
	Eq_2 s4_105 = a2;
	Eq_2 s5_106 = a3;
	if (a1 != 0x00)
	{
		if (a0 != null)
			goto l23062036;
	}
	else
	{
		user_vAssertCalled(a4, mstatus, out a5);
		if (a0 != null)
			goto l23062036;
	}
	user_vAssertCalled(a4, mstatus, out a5);
l23062036:
	union Eq_2 * s1_123;
	ptr32 s0_269;
	Eq_2 s0_125;
	Eq_2 s0_101;
	Eq_2 s2_103 = ((word32) a0->b001C & 1) << 2;
	s0_101 = s0;
	if (a3 != 0x00)
	{
		Eq_2 a5_45;
		Eq_2 a4_46 = vTaskEnterCritical(a4, mstatus, out a5_45);
		s1_123 = (union Eq_2 *) *a4_46;
		s0_125 = s0 + a5_45 - a4_46;
		if (s0_125 >= a5_45)
			s0_125 -= a5_45;
		if (s2_103 < s0_125)
		{
			vTaskExitCritical(a3, mstatus, out a4, out a5);
			goto l2306208A;
		}
		Eq_2 a4_65;
		struct Eq_360125 * a5_66;
		Eq_2 a3_73 = xTaskNotifyStateClear(0x00, a3, a4_46, a5_45, mstatus, out a4_65, out a5_66);
		word32 s1_75 = a5_66->dw0010;
		if (a5_66 != null)
		{
			word32 a5_589;
			user_vAssertCalled(a4_65, mstatus, out a5_589);
		}
		word32 a5_586;
		*((word32) xTaskGetCurrentTaskHandle(out a5_586) + 16) = s1_75;
		Eq_2 a4_86;
		word32 a5_587;
		vTaskExitCritical(a3_73, mstatus, out a4_86, out a5_587);
		struct Eq_360160 * s1_102;
		word32 a2_588;
		s0_101 = xTaskNotifyWait(null, 0x00, 0x00, a3, a4_86, mstatus, dwLoc18, dwArgF8, out s1_102, out a2_588, out a4, out a5, out s2_103, out s3_104, out s4_105, out s5_106);
		s1_102->dw0010 = 0x00;
		a1.u0 = 0x00;
	}
	s1_123 = (union Eq_2 *) *a4;
	s0_125 = s0_101 + a5 - a4;
	if (s0_125 >= a5)
		s0_125 -= a5;
	if (s2_103 >= s0_125)
	{
l23062058:
		s0_269 = 0x00;
		goto l2306205A;
	}
l2306208A:
	if (s2_103 != 0x00)
	{
		Eq_2 s4_156;
		word32 s2_166;
		Eq_2 s5_168;
		word32 a0_572;
		word32 a1_573;
		word32 a3_574;
		s0_125 = prvReadBytesFromBuffer(s1_123, fp + -36, s2_103, s0_125, a4, a5, mstatus, out s1_123, out a0_572, out a1_573, out a3_574, out a4, out a5, out s2_166, out s3_104, out s4_156, out s5_168) - s2_166;
		if (s4_156 < a5)
		{
			*s1_123 = (union Eq_2 *) s5_168;
			s4_105.u0 = 0x00;
		}
		else
			s4_105 = a5;
	}
	Eq_2 a0_202;
	word32 s4_575;
	Eq_2 a3_211;
	prvReadBytesFromBuffer(s1_123, s3_104, s4_105, s0_125, a4, a5, mstatus, out s1_123, out a0_202, out a1, out a3_211, out a4, out a5, out s2_103, out s3_104, out s4_575, out s5_106);
	if (a0_202 != 0x00)
	{
		Eq_2 a5_226;
		Eq_2 a4_225 = vTaskSuspendAll(a4, out a5_226);
		if (a5_226 != 0x00)
		{
			struct Eq_360098 * s1_248;
			word32 a0_583;
			word32 a2_584;
			word32 s4_585;
			word32 s0_582;
			ra = xTaskGenericNotify(ra, a0_202, 0x00, 0x00, 0x00, a4_225, mstatus, s0, dwArg08, dwArg28, dwArgB4, dwArgD0, dwArgD4, dwArgF8, out s0_582, out s1_248, out a0_583, out a1, out a2_584, out a3_211, out a4_225, out a5_226, out s2_103, out s3_104, out s4_585, out mstatus);
			s1_248->dw0014 = 0x00;
		}
		word32 a6_579;
		word32 a0_576;
		word32 a2_577;
		word32 s4_580;
		word32 a3_578;
		word32 t3_581;
		xTaskResumeAll(a3_211, a4_225, a5_226, mstatus, dwArg0128, dwArg0168, out s0_269, out s1_123, out a0_576, out a2_577, out a3_578, out a4, out a5, out a6_579, out s4_580, out t3_581);
l2306205A:
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_123;
		a0Out = s0_269;
		a1Out = a1;
		a2Out = dwArg0100;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2_103;
		s3Out = s3_104;
		s4Out = dwArg78;
		s5Out = s5_106;
		s8Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
	goto l23062058;
}

