pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23062118: Register (ptr32 Eq_360189) xStreamBufferReceiveFromISR(Register word32 ra, Register (ptr32 Eq_360189) s0, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg14, Stack Eq_2 dwArg54, Stack word32 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      __uart_tx_irq
struct Eq_360189 * xStreamBufferReceiveFromISR(word32 ra, struct Eq_360189 * s0, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, word32 dwArg14, Eq_2 dwArg54, word32 dwArg0128, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s3_102 = a1;
	Eq_2 s4_25 = a2;
	if (a1 != 0x00)
	{
		if (a0 != 0x00)
			goto l23062136;
	}
	else
	{
		user_vAssertCalled(a4, mstatus, out a5);
		if (a0 != 0x00)
			goto l23062136;
	}
	user_vAssertCalled(a4, mstatus, out a5);
l23062136:
	union Eq_2 * s1_107 = *a4;
	word32 s0_49 = s0 + a5 - a4;
	Eq_2 s2_50 = ((word32) *((word32) *((word32) a5 + 8) + 28) & 1) << 2;
	if (s0_49 >= a5)
		s0_49 -= a5;
	Eq_2 s0_134;
	if (s2_50 < s0_49)
	{
		if (s2_50 != 0x00)
		{
			Eq_2 s6_63 = *s1_107;
			word32 s5_350;
			word32 a3_349;
			Eq_2 s4_72;
			word32 s2_82;
			word32 a0_347;
			word32 a1_348;
			s0_49 = prvReadBytesFromBuffer(s1_107, fp + -36, s2_50, s0_49, a4, a5, mstatus, out s1_107, out a0_347, out a1_348, out a3_349, out a4, out a5, out s2_82, out s3_102, out s4_72, out s5_350) - s2_82;
			if (s4_72 < a5)
			{
				*s1_107 = (union Eq_2 *) s6_63;
				s4_25.u0 = 0x00;
			}
			else
				s4_25 = a5;
		}
		word32 s2_353;
		Eq_2 a0_112;
		Eq_2 s5_128;
		word32 s1_351;
		word32 a1_352;
		word32 s3_354;
		word32 s4_355;
		prvReadBytesFromBuffer(s1_107, s3_102, s4_25, s0_49, a4, a5, mstatus, out s1_351, out a0_112, out a1_352, out a3, out a4, out a5, out s2_353, out s3_354, out s4_355, out s5_128);
		s0_134 = a0_112;
		if (a0_112 != 0x00)
		{
			if (a5 != 0x00)
			{
				struct Eq_360298 * s1_155;
				xTaskGenericNotifyFromISR(ra, a0_112, null, 0x00, 0x00, s5_128, a5, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, dwArg54, out s0_134, out s1_155, out a3, out a4, out a5, out mstatus);
				s1_155->dw0014 = 0x00;
			}
l23062156:
			0x00 = dwArg0128;
			a0Out = s0_134;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			mstatusOut = mstatus;
			return dwArgE4;
		}
	}
	s0_134.u0 = 0x00;
	goto l23062156;
}

// 230621CA: Register word32 xStreamBufferIsEmpty(Register word32 a0, Register Eq_2 a4, Register (ptr32 (ptr32 Eq_360347)) a5, Register ptr32 mstatus, Register out ptr32 a2Out)
// Called from:
//      vfs_uart_poll
word32 xStreamBufferIsEmpty(word32 a0, Eq_2 a4, struct Eq_360347 ** a5, ptr32 mstatus, ptr32 & a2Out)
{
	if (a0 == 0x00)
	{
		struct Eq_360335 ** a5_11;
		user_vAssertCalled(a4, mstatus, out a5_11);
		word32 a0_18 = (word32) (*((char *) *a5_11 + 4) - a5_11 < 1);
		a2Out = dwArg24;
		return a0_18;
	}
	else
	{
		word32 a0_24 = (word32) (*((char *) *a5 + 4) - a5 < 1);
		a2Out = a2;
		return a0_24;
	}
}

// 230621F4: Register (ptr32 Eq_360356) prvResetNextTaskUnblockTime.part.0(Register out ptr32 a5Out)
// Called from:
//      vTaskDelete
//      xTaskIncrementTick
//      xTaskResumeAll
struct Eq_360356 * prvResetNextTaskUnblockTime.part.0(ptr32 & a5Out)
{
	struct Eq_360356 * a4_9 = *((word32) *((word32) *((word32) g_t4200F518 + 0x0C) + 0x0C) + 4);
	g_ptr4200F538 = a4_9;
	a5Out = 0x4200F000;
	return a4_9;
}

// 2306220C: Register Eq_2 prvInitialiseNewTask.isra.2(Register Eq_2 ra, Register (ptr32 ptr32) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out ptr32 t0Out, Register out ptr32 s0Out, Register out ptr32 a2Out, Register out Eq_360386 a4Out, Register out ptr32 a5Out, Register out Eq_2 s6Out, Register out Eq_360389 s7Out)
// Called from:
//      xTaskCreateStatic
//      xTaskCreate
Eq_2 prvInitialiseNewTask.isra.2(Eq_2 ra, ptr32 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, ptr32 mstatus, Eq_2 dwArg0128, ptr32 & t0Out, ptr32 & s0Out, ptr32 & a2Out, union Eq_360386 & a4Out, ptr32 & a5Out, union Eq_2 & s6Out, union Eq_360389 & s7Out)
{
	word32 a2_230;
	word32 a1_229;
	word32 a0_228;
	word32 t1_227;
	word32 a5_233;
	word32 a3_231;
	word32 a4_232;
	Eq_2 ra_45 = memset(ra, *((word32) a6 + 48), 0x00A5, a2 << 0x02, out t1_227, out a0_228, out a1_229, out a2_230, out a3_231, out a4_232, out a5_233);
	Eq_360389 s7_49 = (a2 << 0x02) + ~0x03;
	Eq_2 s2_36 = a4;
	word32 s3_50 = Mem32[a6 + 48:int32] + s7_49;
	if (a1 != 0x00)
	{
		Eq_2 a1_53 = a1;
		struct Eq_360430 * a5_54 = (word32) a6 + 52;
		do
		{
			word32 a3_58 = (word32) *a1_53;
			++a5_54;
			a5_54[0x0FFF] = (struct Eq_360430) (byte) a3_58;
			a1_53 = (word32) a1_53 + 1;
		} while (a3_58 != 0x00 && a1_53 != (word32) a1 + 16);
		*((word32) a6 + 67) = 0x00;
	}
	else
		((word32) a6 + 52)->u0 = 0x00;
	if (a4 > 0x1F)
		s2_36.u0 = 0x1F;
	*((word32) a6 + 44) = s2_36;
	*((word32) a6 + 80) = s2_36;
	*((word32) a6 + 84) = 0x00;
	vListInitialiseItem((word32) a6 + 4);
	vListInitialiseItem((word32) a6 + 24);
	((word32) a6 + 88)->u0 = 0x00;
	*((word32) a6 + 16) = a6;
	(32 - s2_36)->t0018 = a6;
	*((word32) a6 + 36) = a6;
	((word32) a6 + 0x0044)->u0 = 0x00;
	((word32) a6 + 92)->u0 = 0x00;
	union Eq_2 * a0_108;
	ptr32 t0_109 = fn23064700(s3_50 & -8, a0, a3, mstatus, out a0_108);
	*a0_108 = (union Eq_2 *) a6;
	if (a5 != 0x00)
		*a5 = a6;
	0x00 = (int8) dwArg0128;
	t0Out = t0_109;
	s0Out = dwArgE4;
	a2Out = dwArgB8;
	a4Out.u0 = 32;
	a5Out = 0x1F;
	s6Out = a3;
	s7Out = s7_49;
	return ra_45;
}

// 230622DA: Register word32 prvDeleteTCB(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_360539 a3Out, Register out Eq_2 a4Out, Register out Eq_360541 a5Out, Register out (ptr32 Eq_360945) s4Out)
// Called from:
//      prvIdleTask
//      vTaskDelete
word32 prvDeleteTCB(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0188, Eq_2 dwArg0198, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_360539 & a3Out, union Eq_2 & a4Out, union Eq_360541 & a5Out, union Eq_360945 & s4Out)
{
	Eq_2 a4_5 = (word32) *((word32) a0 + 93);
	if (a4_5 == 0x00)
	{
		Eq_2 a5_19;
		Eq_2 s0_25;
		word32 s1_94;
		word32 a0_95;
		word32 a1_96;
		word32 a2_97;
		word32 a3_98;
		word32 a4_99;
		word32 a6_100;
		word32 s4_101;
		word32 t3_102;
		vPortFree(*((word32) a0 + 48), a2, a5, mstatus, dwArg0148, dwArg0188, out s0_25, out s1_94, out a0_95, out a1_96, out a2_97, out a3_98, out a4_99, out a5_19, out a6_100, out s4_101, out t3_102);
		Eq_2 a2_32;
		Eq_360539 a3_33;
		Eq_2 a4_34;
		Eq_360541 a5_35;
		ptr32 s1_36;
		Eq_2 a0_38;
		word32 s0_41;
		union Eq_360945 * s4_42;
		word32 a1_103;
		word32 a6_104;
		word32 t3_105;
		vPortFree(s0_25, dwArg10, a5_19, mstatus, dwArg0158, dwArg0198, out s0_41, out s1_36, out a0_38, out a1_103, out a2_32, out a3_33, out a4_34, out a5_35, out a6_104, out s4_42, out t3_105);
		s1Out = s1_36;
		a0Out = a0_38;
		a2Out = a2_32;
		a3Out = a3_33;
		a4Out = a4_34;
		a5Out = a5_35;
		s4Out = s4_42;
		return s0_41;
	}
	else if (a4_5 == 0x01)
	{
		Eq_2 a2_45;
		Eq_360539 a3_46;
		Eq_2 a4_47;
		Eq_360541 a5_48;
		ptr32 s1_49;
		Eq_2 a0_51;
		word32 s0_54;
		union Eq_360945 * s4_55;
		word32 a1_106;
		word32 a6_107;
		word32 t3_108;
		vPortFree(a0, a2, 0x01, mstatus, dwArg0158, dwArg0198, out s0_54, out s1_49, out a0_51, out a1_106, out a2_45, out a3_46, out a4_47, out a5_48, out a6_107, out s4_55, out t3_108);
		s1Out = s1_49;
		a0Out = a0_51;
		a2Out = a2_45;
		a3Out = a3_46;
		a4Out = a4_47;
		a5Out = a5_48;
		s4Out = s4_55;
		return s0_54;
	}
	else if (a4_5 != 0x02)
	{
		Eq_360541 a5_59;
		Eq_2 a2_58 = user_vAssertCalled(a4_5, mstatus, out a5_59);
		s1Out = s1;
		a0Out = a0;
		a2Out = a2_58;
		a3Out = a3;
		a4Out = a4_5;
		a5Out = a5_59;
		s4Out = s4;
		return s0;
	}
	else
	{
		s1Out = s1;
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4_5;
		a5Out.u0 = 0x02;
		s4Out = s4;
		return s0;
	}
}

