pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23062310: Register word32 prvAddCurrentTaskToDelayedList(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Stack Eq_2 dwArg48, Register out Eq_2 s1Out, Register out (ptr32 Eq_356106) a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_360651) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      vTaskDelay
//      vTaskPlaceOnEventList
//      vTaskPlaceOnUnorderedEventList
//      vTaskPlaceOnEventListRestricted
//      ulTaskNotifyTake
//      xTaskNotifyWait
word32 prvAddCurrentTaskToDelayedList(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 dwArg48, union Eq_2 & s1Out, struct Eq_356106 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a4Out, struct Eq_360651 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	Eq_2 s2_10 = g_t4200F544;
	word32 a5_161;
	Eq_2 a4_26;
	if (uxListRemove(a3, a4, out a4_26, out a5_161) == 0x00)
	{
		a4_26 = *a3;
		*(~(0x01 << a2) & a3) = (union Eq_2 *) a4_26;
	}
	if (a0 == ~0x00 && a1 != 0x00)
	{
		word32 s0_43 = *a1;
		struct Eq_360651 * a5_56;
		struct Eq_356106 * a0_55 = vListInsertEnd((word32) a1 + 4, a4_26, ~0x00, out a5_56);
		s1Out = a0;
		a0Out = a0_55;
		a1Out = (word32) a1 + 4;
		a2Out.u0 = <invalid>;
		a4Out = a4_26;
		a5Out = a5_56;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		return s0_43;
	}
	else
	{
		word32 s1_63 = a0 + s2_10;
		*((word32) s1_63 + 4) = ~0x00;
		if (s1_63 < s2_10)
		{
			Eq_2 a0_66 = g_t4200F51C;
			word32 s0_68 = *a1;
			Eq_2 a4_81;
			struct Eq_360651 * a5_82;
			struct Eq_356106 * a0_79 = vListInsert(a0_66, dwArg48, a3, out a4_81, out a5_82);
			s1Out = s1_63;
			a0Out = a0_79;
			a1Out = a1_80;
			a2Out.u0 = <invalid>;
			a4Out = a4_81;
			a5Out = a5_82;
			s2Out.u0 = <invalid>;
			s3Out.u0 = <invalid>;
			s4Out.u0 = <invalid>;
			return s0_68;
		}
		else
		{
			word32 s0_85 = *a1;
			Eq_2 a4_91;
			word32 a5_162;
			struct Eq_356106 * a0_89 = vListInsert(g_t4200F518, a2, a3, out a4_91, out a5_162);
			struct Eq_360651 * a5_94 = *a4_91;
			if (s1_63 < a4_91)
				*s1_63 = a5_94;
			s1Out = s1_63;
			a0Out = a0_89;
			a1Out = a1_90;
			a2Out.u0 = <invalid>;
			a4Out = a4_91;
			a5Out = a5_94;
			s2Out.u0 = <invalid>;
			s3Out.u0 = <invalid>;
			s4Out.u0 = <invalid>;
			return s0_85;
		}
	}
}

// 230623D2: Register Eq_2 vTaskEnterCritical.part.7(Register Eq_2 a4, Register out (ptr32 Eq_360741) a5Out)
// Called from:
//      prvAddNewTaskToReadyList
//      prvIdleTask
//      vTaskDelete
//      eTaskGetState
//      xTaskResumeAll
//      vTaskSetTimeOutState
//      xTaskCheckForTimeOut
//      vTaskEnterCritical
//      ulTaskNotifyTake
//      xTaskNotifyWait
//      xTaskGenericNotify
//      xTaskNotifyStateClear
Eq_2 vTaskEnterCritical.part.7(Eq_2 a4, struct Eq_360741 & a5Out)
{
	struct Eq_360742 * a5_7 = **a4;
	Eq_2 a4_8 = a5_7->t0044;
	a5_7->t0045 = a4_8;
	a5Out = (struct Eq_360741 *) ((char *) a5_7 + 1);
	return a4_8;
}

// 230623E6: Register Eq_2 vTaskExitCritical.part.8(Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_2 a4Out, Register out (ptr32 Eq_360761) a5Out)
// Called from:
//      prvAddNewTaskToReadyList
//      prvIdleTask
//      vTaskDelete
//      eTaskGetState
//      xTaskResumeAll
//      vTaskSetTimeOutState
//      xTaskCheckForTimeOut
//      vTaskExitCritical
//      ulTaskNotifyTake
//      xTaskNotifyWait
//      xTaskGenericNotify
//      xTaskNotifyStateClear
Eq_2 vTaskExitCritical.part.8(Eq_2 a3, ptr32 mstatus, union Eq_2 & a4Out, struct Eq_360761 & a5Out)
{
	struct Eq_360762 * a5_8 = *a3;
	Eq_2 a4_9 = a5_8->t0044;
	a5_8->t0043 = a4_9;
	Eq_2 a3_12 = a5_8->t0043;
	if (a5_8 == (struct Eq_360762 *) ~0x00)
		__csrrs(mstatus, 0x08);
	a4Out = a4_9;
	a5Out = (struct Eq_360761 *) ((char *) a5_8 - 1);
	return a3_12;
}

// 23062402: Register word32 prvAddNewTaskToReadyList(Register Eq_2 a0, Register (ptr32 Eq_360786) a2, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out)
// Called from:
//      xTaskCreateStatic
//      xTaskCreate
word32 prvAddNewTaskToReadyList(Eq_2 a0, struct Eq_360786 * a2, Eq_2 a4, word32 a5, ptr32 mstatus, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out)
{
	__csrrc(mstatus, 0x08);
	if (a5 != 0x00)
	{
		word32 a5_234;
		a4 = vTaskEnterCritical.part.7(a4, out a5_234);
	}
	Eq_2 a1_76;
	Eq_2 a5_30 = *a4;
	union Eq_2 * a4_32 = (word32) a4 + 1;
	*a4_32 = (union Eq_2 *) a5_30;
	Eq_2 s1_120 = *a4_32;
	if (a4_32 != null)
	{
		a1_76 = *((word32) a0 + 44);
		if (a5_30 == 0x00)
		{
			s1_120 = *a5_30;
			if (a1_76 >= *((word32) a5_30 + 44))
				*s1_120 = a0;
		}
	}
	else
	{
		*s1_120 = a0;
		if (a4_32 != (union Eq_2 *) 0x01)
			a1_76 = *((word32) a0 + 44);
		else
		{
			Eq_2 s4_42 = 0x42018538;
			do
			{
				vListInitialise(s4_42);
				s4_42 = (word32) s4_42 + 20;
			} while (s4_42 != 0x420187B8);
			vListInitialise(0x420187B8);
			vListInitialise(0x420187CC);
			vListInitialise(0x420187E0);
			vListInitialise(0x42018808);
			vListInitialise(0x420187F4);
			g_t4200F518.u0 = 0x420187B8;
			g_t4200F51C.u0 = 0x420187CC;
			a1_76 = *((word32) a0 + 44);
		}
	}
	Eq_2 a3_126 = a2->t0000;
	Eq_2 a5_107 = 0x01 << a1_76 | g_t4200F534;
	*((word32) a0 + 72) = &a2->t0001;
	*a5_107 = 0x4200F534;
	a2->t0001 = a3_126;
	Eq_2 a5_118;
	vListInsertEnd((word32) a0 + 4, 0x4200F534, a5_107, out a5_118);
	Eq_2 a4_127 = 0x4200F534;
	if (a5_118 != 0x00)
	{
		s1_120 = *a5_118;
		a5_118 = *((word32) a5_118 + 0x0044);
		if (a5_118 != 0x00)
			a3_126 = vTaskExitCritical.part.8(a3_126, mstatus, out a4_127, out a5_118);
	}
	if (a5_118 != 0x00)
	{
		s1_120 = *a4_127;
		a5_118 = *((word32) a0 + 44);
		a4_127 = *((word32) a4_127 + 44);
		if (a4_127 < a5_118)
			__syscall();
	}
	s0Out = s1;
	s1Out = s1_120;
	a3Out = a3_126;
	a4Out = a4_127;
	a5Out = a5_118;
	s2Out = a0;
	s3Out = 0x42018538;
	return dwArg88;
}

// 23062562: void prvIdleTask(Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_360945 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void prvIdleTask(Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_360945 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	union Eq_360945 * s4_33 = &g_t42018538;
	while (true)
	{
		if (a5 == 0x00)
		{
			a5 = *s4_33;
			if (a5 > 0x01)
				__syscall();
			vApplicationIdleHook();
		}
		else
		{
			__csrrc(mstatus, 0x08);
			if (g_t4200F540 != 0x00)
			{
				word32 a5_162;
				a4 = vTaskEnterCritical.part.7(a4, out a5_162);
			}
			word32 a4_160;
			word32 a5_161;
			uxListRemove(a3, a4, out a4_160, out a5_161);
			Eq_2 a5_60 = g_t4200F520;
			g_t4200F520 = (word32) a5_60 - 1;
			*((word32) a5_60 - 2) = *((word32) a5_60 - 1);
			Eq_2 a5_67 = g_t4200F540;
			if (a5_67 != 0x00)
			{
				a5_67 = *((word32) g_t4200F514 + 0x0044);
				if (a5_67 != 0x00)
				{
					word32 a4_164;
					vTaskExitCritical.part.8(a3, mstatus, out a4_164, out a5_67);
				}
			}
			word32 a0_163;
			prvDeleteTCB(s1, a2, a5_67, mstatus, s2, dwArg0118, dwArg0128, dwArg0158, dwArg0168, out s1, out a0_163, out a2, out a3, out a4, out a5, out s4_33);
		}
	}
}

// 23062604: Register Eq_2 xTaskCreateStatic(Register Eq_2 ra, Register (ptr32 ptr32) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg01B4, Register out ptr32 tpOut, Register out ptr32 t0Out, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      bfl_main
//      bl_ble_sync_start
//      vTaskStartScheduler
//      xTimerCreateTimerTask
//      hal_wifi_start_firmware_task
//      looprt_start
//      aos_task_new
Eq_2 xTaskCreateStatic(Eq_2 ra, ptr32 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArgE8, Eq_2 dwArg01B4, ptr32 & tpOut, ptr32 & t0Out, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s6Out, ptr32 & s7Out)
{
	Eq_2 s1_11 = a5;
	if (a5 != 0x00)
	{
		if (a6 != 0x00)
		{
l23062614:
			if (a6 != 96)
			{
				word32 a5_308;
				user_vAssertCalled(a4, mstatus, out a5_308);
				a2 = dwArg04;
			}
			Eq_2 s0_123 = dwArg01B4;
			ptr32 a5_121 = 0x00;
			if (a5 != 0x00)
			{
				*((word32) dwArg01B4 + 93) = 0x02;
				*((word32) a5 + 48) = dwArg01B4;
				struct Eq_360786 * a2_96;
				Eq_2 a4_98;
				word32 a5_99;
				Eq_2 s0_102;
				ra = prvInitialiseNewTask.isra.2(ra, a0, a1, a2, a3, a4, fp + -20, dwArg01B4, mstatus, dwArgE8, out t0, out s0_102, out a2_96, out a4_98, out a5_99, out s6, out s7);
				tp = prvAddNewTaskToReadyList(s0_102, a2_96, a4_98, a5_99, mstatus, out s0_123, out s1_11, out a3, out a4, out a5_121, out s2, out s3);
				a2 = dwArg01B4;
			}
			tpOut = tp;
			t0Out = t0;
			s0Out = s0_123;
			s1Out = s1_11;
			a0Out = a5_121;
			a2Out = a2;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5_121;
			s2Out = s2;
			s3Out = s3;
			s6Out = s6;
			s7Out = s7;
			return ra;
		}
	}
	else
	{
		word32 a5_306;
		user_vAssertCalled(a4, mstatus, out a5_306);
		a6 = dwArg24;
		a2 = dwArg04;
		if (a6 != 0x00)
			goto l23062614;
	}
	word32 a5_307;
	Eq_2 a2_201 = user_vAssertCalled(a4, mstatus, out a5_307);
	if (a4 != 96)
	{
		word32 a5_309;
		a2_201 = user_vAssertCalled(a4, mstatus, out a5_309);
	}
	tpOut = tp;
	t0Out = t0;
	s0Out = dwArg01B4;
	s1Out = a5;
	a0Out = 0x00;
	a2Out = a2_201;
	a3Out = a3;
	a4Out = a4;
	a5Out = 0x00;
	s2Out = s2;
	s3Out = s3;
	s6Out = s6;
	s7Out = s7;
	return ra;
}

// 230626A4: Register Eq_2 xTaskCreate(Register Eq_2 ra, Register Eq_2 s1, Register int32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 ptr32) s3Out)
// Called from:
//      wifi_mgmr_start_background
//      ble_controller_init
//      k_work_q_start
//      ble_tp_ccc_cfg_changed
//      cmd_looprt_test
//      tcpip_init
//      at_server_init
Eq_2 xTaskCreate(Eq_2 ra, Eq_2 s1, int32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out)
{
	ptr32 a0_131;
	Eq_2 a0_36;
	word32 a1_199;
	word32 a2_200;
	word32 a6_201;
	word32 s4_202;
	word32 s8_203;
	ptr32 * s3_125;
	Eq_2 s2_124;
	ptr32 s1_123;
	Eq_2 a5_120;
	Eq_2 a4_119;
	Eq_2 a3_118;
	pvPortMalloc(ra, s1, a2 << 0x02, a3, a4, a5, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_123, out a0_36, out a1_199, out a2_200, out a3_118, out a4_119, out a5_120, out a6_201, out s2_124, out s3_125, out s4_202, out s8_203);
	if (a0_36 != 0x00)
	{
		Eq_2 a0_54;
		Eq_2 a2_56;
		Eq_2 a5_59;
		Eq_2 s1_62;
		Eq_2 s4_65;
		word32 a1_204;
		word32 a3_205;
		word32 a4_206;
		word32 a6_207;
		word32 s8_208;
		pvPortMalloc(ra, a0_36, 96, a3_118, a4_119, a5_120, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_62, out a0_54, out a1_204, out a2_56, out a3_205, out a4_206, out a5_59, out a6_207, out s2_124, out s3_125, out s4_65, out s8_208);
		if (a0_54 != 0x00)
		{
			*((word32) s1_62 + 48) = a0_54;
			*((word32) a0_54 + 93) = 0x00;
			struct Eq_360786 * a2_95;
			Eq_2 a4_97;
			word32 a5_98;
			Eq_2 s0_101;
			word32 t0_216;
			word32 s6_217;
			word32 s7_218;
			ra = prvInitialiseNewTask.isra.2(ra, s3_125, s4_65, s2_124, a3, a4, a5, a0_54, mstatus, dwArgF8, out t0_216, out s0_101, out a2_95, out a4_97, out a5_98, out s6_217, out s7_218);
			word32 s0_219;
			prvAddNewTaskToReadyList(s0_101, a2_95, a4_97, a5_98, mstatus, out s0_219, out s1_123, out a3_118, out a4_119, out a5_120, out s2_124, out s3_125);
			a0_131 = 0x01;
		}
		else
		{
			word32 s0_209;
			word32 a0_210;
			word32 a1_211;
			word32 a2_212;
			word32 a6_213;
			word32 s4_214;
			word32 t3_215;
			vPortFree(s1_62, a2_56, a5_59, mstatus, dwArg0128, dwArg0168, out s0_209, out s1_123, out a0_210, out a1_211, out a2_212, out a3_118, out a4_119, out a5_120, out a6_213, out s4_214, out t3_215);
			a0_131 = ~0x00;
		}
	}
	else
		a0_131 = ~0x00;
	0x00 = (int8) dwArg0128;
	s1Out = s1_123;
	a0Out = a0_131;
	a2Out = dwArgB8;
	a3Out = a3_118;
	a4Out = a4_119;
	a5Out = a5_120;
	s2Out = s2_124;
	s3Out = s3_125;
	return ra;
}

// 23062720: Register Eq_2 vTaskDelete(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      aos_loop_proc
//      ble_controller_deinit
//      k_thread_delete
//      ble_tp_ccc_cfg_changed
//      __bl_ble_sync_task
//      bl_ble_sync_stop
//      iperf_client_udp
//      dfl_entry
//      aos_task_exit
//      at_server_init
Eq_2 vTaskDelete(Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	__csrrc(mstatus, 0x08);
	Eq_2 s0_15 = a0;
	if (a5 != 0x00)
	{
		word32 a5_297;
		a4 = vTaskEnterCritical.part.7(a4, out a5_297);
	}
	if (a0 == 0x00)
		s0_15 = g_t4200F514;
	Eq_2 s3_29 = (word32) s0_15 + 4;
	struct Eq_361232 * a5_38;
	Eq_2 a4_37;
	if (uxListRemove(a3, a4, out a4_37, out a5_38) == 0x00)
	{
		a4_37 = a3 * 0x14;
		a5_38 = (struct Eq_361232 *) *((char *) &g_t42018538 + a3 * 0x14);
		if (a5_38 == null)
		{
			a4_37 = *a2;
			a5_38 = ~(0x01 << a3) & a2;
			a5_38->t0000 = a4_37;
		}
	}
	Eq_2 s0_111 = a5_38->t0028;
	if (a5_38 != null)
	{
		word32 a5_298;
		uxListRemove(a3, a4_37, out a4_37, out a5_298);
	}
	Eq_2 a5_119;
	Eq_2 a4_120;
	Eq_2 a5_70 = *a4_37;
	Eq_2 a3_107 = g_t4200F514;
	Eq_2 a4_75 = (word32) a4_37 + 1;
	*a4_75 = a5_70;
	if (a3_107 != s0_111)
	{
		Eq_2 a5_90 = *a4_75;
		*((word32) a4_75 - 1) = a5_90;
		word32 a2_301;
		word32 a5_303;
		word32 s4_304;
		word32 a0_104;
		word32 s1_300;
		word32 a4_302;
		s0_111 = prvDeleteTCB(s0_111, a2, a5_90, mstatus, dwLoc10, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out s1_300, out a0_104, out a2_301, out a3_107, out a4_302, out a5_303, out s4_304);
		if (*g_t4200F518 != 0x00)
			a4_120 = prvResetNextTaskUnblockTime.part.0(out a5_119);
		else
		{
			g_ptr4200F538 = (struct Eq_360356 *) ~0x00;
			a5_119.u0 = 0x4200F000;
			a4_120.u0 = ~0x00;
		}
	}
	else
	{
		word32 a5_299;
		vListInsertEnd(s3_29, a4_75, a5_70, out a5_299);
		a5_119 = *a4_75;
		*((word32) a4_75 + 1) = a5_119;
		a4_120 = (word32) a4_75 + 1;
	}
	if (a5_119 != 0x00)
	{
		a5_119 = *((word32) g_t4200F514 + 0x0044);
		if (a5_119 != 0x00)
			vTaskExitCritical.part.8(a3_107, mstatus, out a4_120, out a5_119);
	}
	if (a5_119 != 0x00)
	{
		a5_119 = g_t4200F514;
		if (a5_119 == s0_111)
		{
			Eq_2 a5_143 = g_t4200F52C;
			if (a5_143 == 0x00)
				__syscall();
			else
			{
				user_vAssertCalled(a4_120, mstatus, out a5_143);
				__syscall();
			}
			a0Out.u0 = <invalid>;
			a3Out.u0 = <invalid>;
			a4Out.u0 = <invalid>;
			a5Out = a5_143;
			s2Out.u0 = <invalid>;
			return <invalid>;
		}
	}
	a0Out.u0 = <invalid>;
	a3Out.u0 = <invalid>;
	a4Out.u0 = <invalid>;
	a5Out = a5_119;
	s2Out.u0 = <invalid>;
	return <invalid>;
}

// 23062852: Register Eq_2 eTaskGetState(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_361368 a5, Register ptr32 mstatus, Register out Eq_361370 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_361368 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      vTaskGetInfo
Eq_2 eTaskGetState(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_361368 a5, ptr32 mstatus, union Eq_361370 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_361368 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	if (a0 == 0x00)
		user_vAssertCalled(a4, mstatus, out a5);
	Eq_2 s1_166 = *a4;
	Eq_361370 a0_146 = 0x00;
	if (a4 == a0)
	{
l230628CE:
		a0Out = a0_146;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out.u0 = <invalid>;
		s3Out = s3;
		s4Out.u0 = <invalid>;
		return s1_166;
	}
	__csrrc(mstatus, 0x08);
	if (a5 != 0x00)
	{
		word32 a5_190;
		vTaskEnterCritical.part.7(a4, out a5_190);
	}
	Eq_361368 a5_160 = 0x4200F000;
	a4.u0 = 0x4200F000;
	s3 = g_t4200F518;
	Eq_2 s4_39 = g_t4200F51C;
	Eq_2 s0_42 = *((word32) a0 + 20);
	if (true)
	{
		s1_166 = g_t4200F000;
		a5_160 = g_t4200F044;
		if (a5_160 != 0x00)
		{
			a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_160);
			if (s0_42 == s3)
			{
l230628EC:
				a0Out.u0 = 0x02;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5_160;
				s2Out.u0 = <invalid>;
				s3Out = s3;
				s4Out.u0 = <invalid>;
				return s1_166;
			}
l230628A4:
			if (s0_42 != s4_39)
			{
				a5.u0 = 0x420187F4;
				if (s0_42 != 0x420187F4)
				{
					a5.u0 = 0x42018808;
					if (s0_42 != 0x42018808)
					{
						a5 = 0x00 - (word32) (s0_42 < 1);
						a0_146 = (a5 & 3) + 0x01;
					}
					else
						a0_146.u0 = 0x04;
				}
				else
				{
					a4 = *((word32) a0 + 40);
					a0_146.u0 = 0x02;
					if (a4 == 0x00)
					{
						a5 = (word32) ((word32) *((word32) a0 + 92) != ~0x00);
						a0_146 = (word32) a5 + 2;
					}
				}
				goto l230628CE;
			}
			goto l230628EC;
		}
	}
	if (s0_42 == s3)
		goto l230628EC;
	goto l230628A4;
}

// 23062920: void vTaskStartScheduler(Register Eq_2 ra, Register ptr32 gp, Register Eq_2 a6, Register ptr32 fcsr, Register ptr32 mstatus, Register ptr32 mie, Register ptr32 mtvec, Stack Eq_2 dwArg04, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0174, Stack Eq_2 dwArg0194)
// Called from:
//      bfl_main
void vTaskStartScheduler(Eq_2 ra, ptr32 gp, Eq_2 a6, ptr32 fcsr, ptr32 mstatus, ptr32 mie, ptr32 mtvec, Eq_2 dwArg04, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0174, Eq_2 dwArg0194)
{
	word32 a0_23;
	Eq_2 a3_33;
	Eq_2 a4_34;
	word32 tp_174;
	word32 t0_175;
	word32 s0_176;
	word32 s1_177;
	word32 a2_178;
	word32 a5_179;
	word32 s2_180;
	word32 s3_181;
	word32 s6_182;
	word32 s7_183;
	Eq_2 ra_36 = xTaskCreateStatic(ra, &g_ptr23062562, 587915572, dwArg64, 0x00, 0x00, vApplicationGetIdleTaskMemory(fp + ~0x1B, fp + ~0x17, fp + ~0x13), a6, mstatus, 0x00, dwArg04, dwArgC8, dwArg0194, out tp_174, out t0_175, out s0_176, out s1_177, out a0_23, out a2_178, out a3_33, out a4_34, out a5_179, out s2_180, out s3_181, out s6_182, out s7_183);
	if (a0_23 == 0x00)
		return;
	Eq_2 a0_45;
	Eq_2 a4_49;
	Eq_2 t0_65;
	Eq_2 tp_58 = xTimerCreateTimerTask(ra_36, a3_33, a4_34, mstatus, 0x00, dwLoc08, dwArg44, dwArgA8, dwArgD8, dwArg0174, out t0_65, out a0_45, out a4_49);
	if (a0_45 != 0x01)
	{
		if (a0_45 != ~0x00)
			return;
		word32 a5_184;
		user_vAssertCalled(a4_49, mstatus, out a5_184);
	}
	else
	{
		__csrrc(mstatus, 0x08);
		g_ptr4200F538 = (struct Eq_360356 *) ~0x00;
		g_t4200F540 = a0_45;
		g_t4200F544.u0 = 0x00;
		xPortStartScheduler(gp, tp_58, t0_65, 0x4200F000, fcsr, mstatus, mie, mtvec);
	}
}

// 23062994: Register Eq_2 vTaskSuspendAll(Register Eq_2 a4, Register out ptr32 a5Out)
// Called from:
//      xEventGroupWaitBits
//      xEventGroupSetBits
//      vEventGroupDelete
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      xStreamBufferSend
//      xStreamBufferReceive
//      prvTimerTask
//      pvPortMalloc
//      vPortFree
Eq_2 vTaskSuspendAll(Eq_2 a4, ptr32 & a5Out)
{
	ptr32 a5_6 = *a4;
	*((word32) a4 + 1) = a5_6;
	a5Out = a5_6;
	return (word32) a4 + 1;
}

// 230629A4: Register Eq_2 xTaskGetTickCount(Register out (ptr32 Eq_2259) a5Out)
// Called from:
//      get_dts_addr.part.2
//      mm_cfg_element_keepalive_timestamp_update
//      rxl_cntrl_evt
//      apm_sta_connect_timeout_ind_handler
//      bl_main_cfg_task_req
//      tcpip_stack_input
//      stateConnectedIPNoEnter
//      stateGlobalGuard_scan_beacon
//      stateDisconnect_enter
//      wifi_mgmr_start
//      cmd_wifi_coex_pta_force_on
//      sniffer_cb
//      wifi_mgmr_cli_scanlist
//      wifi_mgmr_scan_ap_all
//      bl_irq_bottomhalf
//      wifi_tx
//      k_now_ms
//      k_timer_start
//      tc_blfdtdump
//      tc_fdt_wifi_module
//      __bl_ble_sync_task
//      __recv_event
//      write_data
//      __ble_bytes_send
//      read_data
//      bl_ble_sync_start
//      __malloc
//      __free
//      pro_trans_read
//      bl_sys_time_update
//      bl_sys_time_get
//      bl_sys_time_sync_state
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      psm_test_cmd
//      prvTimerTask
//      bl_dma_IRQHandler
//      bl_dma_irq_register
//      bl_dma_init
//      _irq_num_check.part.0
//      bl_irq_register
//      bl_irq_unregister
//      wait_trng4feed
//      sec_trng_IRQHandler
//      cmd_gpio_get
//      cmd_gpio_set
//      cmd_gpio_func
//      cmd_wdt_init
//      dev_uart_init
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_boot2_init
//      hal_board_cfg
//      bl_tsen_adc_get
//      bl_flash_config_update
//      _cb_led_trigger
//      _led_bloop_msg
//      _led_bloop_evt
//      loopset_led_trigger
//      sys_arch_mbox_fetch
//      sys_mutex_lock
//      sys_now
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      file_info
//      dirent_file
//      romfs_opendir
//      romfs_stat
//      romfs_open
//      romfs_register
//      sntp_recv
//      sntp_get_time
//      log_buf_out
//      at_parse
//      bl_mtd_write
//      bloop_timer_configure
//      bloop_timer_repeat_reconfigure
//      bloop_run
//      bloop_status_dump
//      bl_sha_mutex_take
//      bl_sha_mutex_give
//      hal_hbn_init
Eq_2 xTaskGetTickCount(struct Eq_2259 & a5Out)
{
	Eq_2 a0_5 = g_t4200F544;
	a5Out = (struct Eq_2259 *) &g_t4200F000;
	return a0_5;
}

