pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 230629AE: Register ptr32 xTaskGetTickCount2(Register ptr32 a0, Register ptr32 a1)
// Called from:
//      aos_now_ms
ptr32 xTaskGetTickCount2(ptr32 a0, ptr32 a1)
{
	Eq_2 a5_7 = g_t4200F53C;
	*g_t4200F544 = a0;
	*a5_7 = a1;
	return 0x01;
}

// 230629C6: Register Eq_2 xTaskGetTickCountFromISR(Register out ptr32 a5Out)
// Called from:
//      get_dts_addr.part.2
//      bl_main_cfg_task_req
//      tc_blfdtdump
//      tc_fdt_wifi_module
//      __bl_ble_sync_task
//      __recv_event
//      write_data
//      __ble_bytes_send
//      read_data
//      bl_ble_sync_start
//      __malloc
//      __free
//      pro_trans_read
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      psm_test_cmd
//      bl_dma_IRQHandler
//      bl_dma_irq_register
//      bl_dma_init
//      _irq_num_check.part.0
//      bl_irq_register
//      bl_irq_unregister
//      wait_trng4feed
//      sec_trng_IRQHandler
//      cmd_gpio_get
//      cmd_gpio_set
//      cmd_gpio_func
//      cmd_wdt_init
//      dev_uart_init
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_boot2_init
//      hal_board_cfg
//      bl_tsen_adc_get
//      bl_flash_config_update
//      _cb_led_trigger
//      _led_bloop_msg
//      _led_bloop_evt
//      loopset_led_trigger
//      file_info
//      dirent_file
//      romfs_opendir
//      romfs_stat
//      romfs_open
//      romfs_register
//      log_buf_out
//      bl_mtd_write
//      bloop_run
//      bl_sha_mutex_take
//      bl_sha_mutex_give
//      hal_hbn_init
Eq_2 xTaskGetTickCountFromISR(ptr32 & a5Out)
{
	Eq_2 a0_5 = g_t4200F544;
	a5Out = 0x4200F000;
	return a0_5;
}

// 230629D0: Register Eq_2 xTaskIncrementTick(Register Eq_2 s0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_2) s3Out, Register out ptr32 s4Out)
// Called from:
//      xTaskResumeAll
//      int_timer_cb
Eq_2 xTaskIncrementTick(Eq_2 s0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	Eq_2 a2_32;
	Eq_2 a4_114;
	ptr32 s2_37;
	Eq_2 a3_162;
	ptr32 a0_29 = bl_sys_time_sync_state(fp + -52, a4, mstatus, dwLoc08, out a2_32, out a3_162, out a4_114, out s2_37);
	ptr32 s1_150 = a0_29;
	if (a0_29 == 0x00)
	{
l23062A18:
		0x00 = (int8) dwArg0198;
		s1Out = s1_150;
		a0Out = s1_150;
		a3Out = a3_162;
		a4Out = a4_114;
		s2Out = s2_37;
		s3Out = s3;
		s4Out = dwLoc14;
		return dwArg0158;
	}
	if (g_t4200F52C != 0x00)
	{
		*((word32) a4_114 + 1) = *a4_114;
		s1_150 = 0x00;
		a4_114 = (word32) a4_114 + 1;
		goto l23062A0C;
	}
	Eq_2 s3_45 = g_t4200F544;
	g_t4200F544 = (word32) s3_45 + 1;
	s3 = (word32) s3_45 + 1;
	if (s3_45 == 0x01)
	{
		s2_37 = 1107359000;
		if (*g_t4200F518 != 0x00)
		{
			word32 a5_410;
			a2_32 = user_vAssertCalled(a4_114, mstatus, out a5_410);
		}
		a3_162 = g_t4200F518;
		Eq_2 a4_59 = *a2_32;
		g_t4200F518 = a2_32;
		*a3_162 = a4_59;
		*((word32) a4_59 + 1) = *a4_59;
		a4_114 = (word32) a4_59 + 1;
		if (*g_t4200F518 == 0x00)
		{
			g_ptr4200F538 = (struct Eq_360356 *) ~0x00;
l23062AA2:
			if ((word32) s3_45 + 1 >= g_ptr4200F538)
			{
				s1_150 = 0x00;
				s2_37 = 1107359000;
l23062ACA:
				while (*g_t4200F518 != 0x00)
				{
					struct Eq_360356 * a5_106 = *((word32) s0 + 0x0C);
					word32 s0_107 = a5_106->dw0004;
					if ((word32) s3_45 + 1 < a5_106)
					{
						g_ptr4200F538 = a5_106;
						goto l23062B46;
					}
					Eq_2 a4_116;
					word32 a5_117;
					uxListRemove(a3_162, a4_114, out a4_116, out a5_117);
					if (a5_117 != 0x00)
					{
						word32 a4_413;
						uxListRemove(a3_162, a4_116, out a4_413, out a5_117);
					}
					a4_114 = *a3_162;
					Eq_2 a5_134 = 0x01 << a5_117 | a3_162;
					*a5_134 = a4_114;
					word32 a5_412;
					vListInsertEnd(s0_107 + 4, a4_114, a5_134, out a5_412);
					s0 = *((word32) a4_114 + 44);
					if (a4_114 < *((word32) g_t4200F514 + 44))
						goto l23062ACA;
					s1_150 = 0x01;
				}
				g_ptr4200F538 = (struct Eq_360356 *) ~0x00;
			}
			else
				s1_150 = 0x00;
l23062B46:
			a3_162.u0 = 0x01;
			if (*((char *) &g_t42018538 + a4_114 * 0x14) > 0x01)
				s1_150 = 0x01;
l23062A0C:
			if (g_dw4200F548 != 0x00)
				s1_150 = 0x01;
			goto l23062A18;
		}
		word32 a5_411;
		a4_114 = prvResetNextTaskUnblockTime.part.0(out a5_411);
	}
	goto l23062AA2;
}

// 23062B70: Register word32 xTaskResumeAll(Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_355857) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 s4Out, Register out ptr32 t3Out)
// Called from:
//      xEventGroupWaitBits
//      xEventGroupSetBits
//      vEventGroupDelete
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      xStreamBufferSend
//      xStreamBufferReceive
//      vTaskDelay
//      vTaskGetInfo
//      uxTaskGetSystemState
//      prvTimerTask
//      pvPortMalloc
//      vPortFree
word32 xTaskResumeAll(Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, union Eq_2 & s0Out, union Eq_2 & s1Out, struct Eq_355857 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & s4Out, ptr32 & t3Out)
{
	if (a5 == 0x00)
		user_vAssertCalled(a4, mstatus, out a5);
	__csrrc(mstatus, 0x08);
	Eq_2 s0_113 = *a5;
	if (a5 != 0x00)
		a4 = vTaskEnterCritical.part.7(a4, out a5);
	struct Eq_355857 * a0_148;
	Eq_2 a5_147 = (word32) a5 - 1;
	*a5_147 = *a5;
	Eq_2 s1_111 = *a5_147;
	if (a5_147 == 0x00)
	{
		a5_147 = g_t4200F520;
		if (a5_147 != 0x00)
		{
			struct Eq_361818 * s6_50 = null;
			union Eq_2 * s3_131 = &g_dw4200F548;
l23062BE0:
			while (g_dw420187E0 != 0x00)
			{
				s6_50 = g_ptr420187EC->ptr000C;
				Eq_2 a4_68;
				word32 a5_456;
				uxListRemove(a3, a4, out a4_68, out a5_456);
				word32 a4_457;
				word32 a5_458;
				uxListRemove(a3, a4_68, out a4_457, out a5_458);
				Eq_2 a4_76 = *a3;
				Eq_2 a5_82 = 0x01 << s6_50->t002C | a3;
				*a5_82 = a4_76;
				word32 a5_459;
				vListInsertEnd((char *) s6_50 + 4, a4_76, a5_82, out a5_459);
				a4 = s6_50->t002C;
				if (a4 < *((word32) g_t4200F514 + 44))
					goto l23062BE0;
				g_dw4200F548 = 0x01;
			}
			if (s6_50 != null)
			{
				if (*g_t4200F518 == 0x00)
				{
					g_ptr4200F538 = (struct Eq_360356 *) ~0x00;
					a4.u0 = ~0x00;
				}
				else
				{
					word32 a5_460;
					a4 = prvResetNextTaskUnblockTime.part.0(out a5_460);
				}
			}
			s1_111 = g_t4200F528;
			if (s1_111 != 0x00)
			{
				do
				{
					word32 s1_125;
					word32 * s2_126;
					Eq_2 s4_127;
					word32 a0_130;
					s0_113 = xTaskIncrementTick(s0_113, a4, mstatus, dwArg0158, out s1_125, out a0_130, out a3, out a4, out s2_126, out s3_131, out s4_127);
					s1_111 = s1_125 + ~0x00;
					if (a0_130 != 0x00)
						*s3_131 = (union Eq_2 *) s4_127;
				} while (s1_125 != ~0x00);
				*s2_126 = 0x00;
			}
			a5_147 = *s3_131;
			if (a5_147 != 0x00)
			{
				__syscall();
				a0_148 = (struct Eq_355857 *) 0x01;
l23062C80:
				if (a5_147 != 0x00)
				{
					a5_147 = *((word32) g_t4200F514 + 0x0044);
					if (a5_147 != 0x00)
						a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_147);
				}
				0x00 = (int8) dwArg0198;
				s0Out = dwArg0158;
				s1Out = s1_111;
				a0Out = a0_148;
				a2Out = dwArg0138;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5_147;
				a6Out = dwArg0118;
				s4Out = dwArgF4;
				t3Out = dwArgA8;
				return dwArg0178;
			}
		}
	}
	a0_148 = null;
	goto l23062C80;
}

// 23062CC4: Register word32 vTaskDelay(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_34259) s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_34268 s4Out)
// Called from:
//      txl_frame_get
//      scanu_start
//      bl_main_rtthread_start
//      wifi_mgmr_event_notify
//      cmd_wifi_coex_pta_force_on
//      wifi_disconnect_cmd
//      node_reset
//      k_sleep
//      bl_ble_sync_stop
//      proc_entry_looprt
//      iperf_server_udp
//      iperf_client_udp
//      iperf_client_tcp
//      cwqap
//      deep_sleep
//      scan
//      reset
//      __wifimode_set
//      disconnect_handler
//      help_handler
//      bloop_wait_startup
word32 vTaskDelay(Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg0138, Eq_2 dwArg0178, struct Eq_34259 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_34268 & s4Out)
{
	if (a0 != 0x00)
	{
		if (a5 != 0x00)
		{
			user_vAssertCalled(a4, mstatus, out a5);
			a2 = dwArg24;
		}
		*((word32) a5 + 1) = *a5;
		word32 s1_125;
		ptr32 a1_32;
		Eq_2 a4_34;
		Eq_2 a5_35;
		ptr32 s2_39;
		ptr32 s3_40;
		word32 a0_126;
		word32 a2_127;
		word32 s4_128;
		prvAddCurrentTaskToDelayedList(a0, 0x00, a2, a3, a4, dwArg28, out s1_125, out a0_126, out a1_32, out a2_127, out a4_34, out a5_35, out s2_39, out s3_40, out s4_128);
		Eq_2 a0_45;
		Eq_2 a2_46;
		Eq_2 a5_47;
		word32 s0_49;
		struct Eq_34259 * s1_50;
		Eq_34268 s4_51;
		Eq_2 a3_54;
		Eq_2 a4_55;
		word32 a6_129;
		word32 t3_130;
		xTaskResumeAll(a3, a4_34, a5_35, mstatus, dwArg0138, dwArg0178, out s0_49, out s1_50, out a0_45, out a2_46, out a3_54, out a4_55, out a5_47, out a6_129, out s4_51, out t3_130);
		if (a0_45 == 0x00)
			__syscall();
		s1Out = s1_50;
		a0Out = a0_45;
		a1Out = a1_32;
		a2Out = a2_46;
		a3Out = a3_54;
		a4Out = a4_55;
		a5Out = a5_47;
		s2Out = s2_39;
		s3Out = s3_40;
		s4Out = s4_51;
		return s0_49;
	}
	else
	{
		__syscall();
		s1Out = s1;
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return s0;
	}
}

