pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23062D06: Register ui32 vTaskSwitchContext(Register word32 a3, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out (ptr32 Eq_6362) a4Out, Register out Eq_2 a5Out)
// Called from:
//      bl_irq_handler
//      rw_main_task_post_from_fw
//      int_timer_cb
//      __uart_rx_irq
//      __uart_tx_irq
//      aos_sem_signal
ui32 vTaskSwitchContext(word32 a3, ptr32 mstatus, union Eq_2 & a0Out, struct Eq_6362 & a4Out, union Eq_2 & a5Out)
{
	if (g_t4200F52C == 0x00)
	{
		g_dw4200F548 = 0x00;
		if (a3 != 0xA5A5A5A5 || (a3 != 0xA5A5A5A5 || (a3 != 0xA5A5A5A5 || a3 != 0xA5A5A5A5)))
			vApplicationStackOverflowHook();
		else
		{
			word32 a5_131;
			Eq_2 a4_40;
			Eq_2 a0_39 = __clzsi2(g_t4200F534, out a4_40, out a5_131);
			ui32 s3_42 = 0x1F - a0_39;
			struct Eq_362048 * a5_48 = *((char *) &g_t42018538 + s3_42 * 0x14);
			if (a5_48 == null)
				user_vAssertCalled(a4_40, mstatus, out a5_48);
			ui32 s0_59 = s3_42 * 0x14 + 0x08;
			struct Eq_6362 * a4_58 = a5_48->ptr0004;
			struct Eq_6362 * a5_62 = a5_48->ptr0004;
			a5_62->ptr0004 = a4_58;
			if (a5_62 == s0_59 + 0x42018538)
			{
				a5_62 = a5_62->ptr0004;
				a5_62->ptr0004 = a4_58;
			}
			Eq_2 a5_68 = a5_62->t000C;
			g_t4200F514 = a5_68;
			a0Out = a0_39;
			a4Out = a4_58;
			a5Out = a5_68;
			return s0_59 + 0x42018538;
		}
	}
	else
	{
		g_dw4200F548 = 0x01;
		a0Out = a0;
		a4Out = (struct Eq_6362 *) 0x01;
		a5Out.u0 = 0x4200F000;
		return s0;
	}
}

// 23062DD0: Register word32 vTaskPlaceOnEventList(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
word32 vTaskPlaceOnEventList(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg48, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out)
{
	if (a0 == 0x00)
	{
		word32 a5_65;
		user_vAssertCalled(a4, mstatus, out a5_65);
		a2 = dwArg24;
	}
	Eq_2 a4_28;
	word32 a5_66;
	vListInsert(a0, a2, a3, out a4_28, out a5_66);
	ptr32 a1_38;
	ptr32 a2_39;
	ptr32 a4_40;
	ptr32 s2_45;
	ptr32 s3_46;
	word32 s1_67;
	word32 a0_68;
	word32 a5_69;
	word32 s4_70;
	word32 s0_43 = prvAddCurrentTaskToDelayedList(a1, 0x01, a2, a3, a4_28, dwArg48, out s1_67, out a0_68, out a1_38, out a2_39, out a4_40, out a5_69, out s2_45, out s3_46, out s4_70);
	a1Out = a1_38;
	a2Out = a2_39;
	a4Out = a4_40;
	s2Out = s2_45;
	s3Out = s3_46;
	return s0_43;
}

// 23062E00: Register Eq_2 vTaskPlaceOnUnorderedEventList(Register ptr32 a0, Register ui32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      xEventGroupWaitBits
Eq_2 vTaskPlaceOnUnorderedEventList(ptr32 a0, ui32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg48, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_2 a2_20;
	a2_20 = a2;
	if (a0 == 0x00)
	{
		word32 a5_96;
		user_vAssertCalled(a4, mstatus, out a5_96);
		a2_20 = dwArg24;
	}
	if (g_t4200F52C == 0x00)
	{
		word32 a5_97;
		user_vAssertCalled(a4, mstatus, out a5_97);
		a2_20 = dwArg24;
	}
	(a1 | 0x80000000)->t0018 = a4;
	word32 a5_98;
	vListInsertEnd(a1 + 0x18, a4, a1 | 0x80000000, out a5_98);
	word32 s1_99;
	word32 a0_100;
	word32 a1_101;
	Eq_2 a4_64;
	ptr32 a5_65;
	ptr32 s2_69;
	ptr32 s3_70;
	word32 a2_102;
	word32 s4_103;
	prvAddCurrentTaskToDelayedList(a2, 0x01, a2_20, a3, a4, dwArg48, out s1_99, out a0_100, out a1_101, out a2_102, out a4_64, out a5_65, out s2_69, out s3_70, out s4_103);
	a5Out = a5_65;
	s2Out = s2_69;
	s3Out = s3_70;
	return a4_64;
}

// 23062E56: Register word32 vTaskPlaceOnEventListRestricted(Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 s3Out)
// Called from:
//      vQueueWaitForMessageRestricted
word32 vTaskPlaceOnEventListRestricted(word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg48, ptr32 & a1Out, ptr32 & a4Out, ptr32 & s3Out)
{
	Eq_2 a2_20;
	Eq_2 s1_11 = a1;
	a2_20 = a2;
	if (a0 == 0x00)
	{
		word32 a5_81;
		user_vAssertCalled(a4, mstatus, out a5_81);
		a2_20 = dwArg24;
	}
	word32 a5_82;
	vListInsertEnd((word32) g_t4200F514 + 24, a4, 0x4200F000, out a5_82);
	if (a2 != 0x00)
		s1_11.u0 = ~0x00;
	word32 s1_83;
	word32 a2_85;
	word32 a0_84;
	ptr32 a1_49;
	ptr32 a4_51;
	ptr32 s3_57;
	word32 a5_86;
	word32 s2_87;
	word32 s4_88;
	word32 s0_54 = prvAddCurrentTaskToDelayedList(s1_11, a2, a2_20, a3, a4, dwArg48, out s1_83, out a0_84, out a1_49, out a2_85, out a4_51, out a5_86, out s2_87, out s3_57, out s4_88);
	a1Out = a1_49;
	a4Out = a4_51;
	s3Out = s3_57;
	return s0_54;
}

// 23062E90: Register word32 xTaskRemoveFromEventList(Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      prvUnlockQueue
//      xQueueGenericReset
//      xQueueGenericSend
//      xQueueGenericSendFromISR
//      xQueueGiveFromISR
//      xQueueReceive
//      xQueueSemaphoreTake
word32 xTaskRemoveFromEventList(Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (s0 == 0x00)
	{
		word32 a5_107;
		a2 = user_vAssertCalled(a4, mstatus, out a5_107);
	}
	ptr32 a1_50;
	word32 a5_108;
	Eq_2 a4_24;
	uxListRemove(a3, a4, out a4_24, out a5_108);
	word32 s1_100 = (word32) s0 + 24;
	Eq_2 a5_28 = g_t4200F52C;
	if (a5_28 != 0x00)
	{
		word32 a5_112;
		vListInsertEnd((word32) s0 + 24, a4_24, a5_28, out a5_112);
		a1_50 = (word32) s0 + 24;
	}
	else
	{
		word32 a4_109;
		word32 a5_110;
		uxListRemove(a3, a4_24, out a4_109, out a5_110);
		a3 = *a1;
		Eq_2 a5_48 = 0x01 << a2 | a1;
		*a5_48 = a3;
		ui32 a4_42 = a2 * 0x05;
		word32 a5_111;
		vListInsertEnd((word32) s0 + 4, a4_42 << 2, a5_48, out a5_111);
		s1_100 = (word32) s0 + 4;
		a4_24 = a4_42 << 2;
		a1_50 = (word32) s0 + 4;
	}
	ptr32 a0_64 = 0x00;
	Eq_2 a5_65 = *((word32) g_t4200F514 + 44);
	if (a5_65 < a4_24)
	{
		g_dw4200F548 = 0x01;
		a5_65.u0 = 0x4200F000;
		a4_24.u0 = 0x01;
		a0_64 = 0x01;
	}
	a0Out = a0_64;
	a1Out = a1_50;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4_24;
	a5Out = a5_65;
	return s1_100;
}

// 23062F28: Register (ptr32 Eq_124604) vTaskRemoveFromUnorderedEventList(Register (ptr32 Eq_124604) s0, Register ui32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack (ptr32 Eq_124604) dwArg24, Stack Eq_2 dwArg44, Register out Eq_2 s1Out, Register out (ptr32 Eq_356106) a0Out, Register out Eq_2 a2Out, Register out (ptr32 word32) a3Out, Register out Eq_356109 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      xEventGroupSetBits
//      vEventGroupDelete
struct Eq_124604 * vTaskRemoveFromUnorderedEventList(struct Eq_124604 * s0, ui32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_124604 * dwArg24, Eq_2 dwArg44, union Eq_2 & s1Out, struct Eq_356106 & a0Out, union Eq_2 & a2Out, word32 & a3Out, union Eq_356109 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s4Out)
{
	if (g_t4200F52C != 0x00)
	{
		*(a1 | 0x80000000) = s0->dw000C;
		if (s0 != null)
			goto l23062F48;
	}
	else
	{
		word32 a5_129;
		user_vAssertCalled(a4, mstatus, out a5_129);
		*(a1 | 0x80000000) = dwArg24->dw000C;
		s0 = dwArg24;
		a2 = dwArg44;
		if (dwArg24 != null)
			goto l23062F48;
	}
	word32 a5_130;
	a2 = user_vAssertCalled(a4, mstatus, out a5_130);
	s0 = dwArg24;
l23062F48:
	Eq_2 a4_46;
	word32 a5_131;
	uxListRemove(a3, a4, out a4_46, out a5_131);
	ui32 a5_53;
	word32 a4_132;
	uxListRemove(a3, a4_46, out a4_132, out a5_53);
	word32 * a3_59 = *a2;
	Eq_2 a5_67 = 0x01 << a5_53 | a2;
	*a5_67 = a3_59;
	Eq_2 s1_49 = (char *) s0 + 4;
	word32 a5_133;
	struct Eq_356106 * a0_71 = vListInsertEnd(s1_49, a5_53 * 0x14, a5_67, out a5_133);
	struct Eq_124604 * s0_75 = ((Eq_583032[]) 44)[a5_53].ptr0000;
	Eq_2 a5_117 = *((word32) g_t4200F514 + 44);
	if (a5_117 < a5_53 * 0x14)
	{
		g_dw4200F548 = 0x01;
		a5_117.u0 = 0x4200F000;
	}
	s1Out = s1_49;
	a0Out = a0_71;
	a2Out = a2;
	a3Out = a3_59;
	a4Out = a5_53 * 0x14;
	a5Out = a5_117;
	s2Out = 0x01;
	s4Out = dwArg04;
	return s0_75;
}

// 23062FCA: Register Eq_2 vTaskSetTimeOutState(Register ptr32 a0, Register Eq_2 a4, Register Eq_359514 a5, Register ptr32 mstatus, Register out Eq_2 a4Out)
// Called from:
//      xStreamBufferSend
Eq_2 vTaskSetTimeOutState(ptr32 a0, Eq_2 a4, Eq_359514 a5, ptr32 mstatus, union Eq_2 & a4Out)
{
	if (a0 == 0x00)
		user_vAssertCalled(a4, mstatus, out a5);
	__csrrc(mstatus, 0x08);
	if (a5 != 0x00)
	{
		word32 a5_81;
		vTaskEnterCritical.part.7(a4, out a5_81);
	}
	Eq_2 a3_28 = g_t4200F53C;
	Eq_2 a4_29 = g_t4200F544;
	*a3_28 = a0;
	*((word32) a4_29 + 4) = a0;
	if (false || *((word32) g_t4200F514 + 0x0044) == 0x00)
	{
		a4Out = a4_29;
		return a3_28;
	}
	else
	{
		word32 a5_82;
		Eq_2 a4_52;
		Eq_2 a3_51 = vTaskExitCritical.part.8(a3_28, mstatus, out a4_52, out a5_82);
		a4Out = a4_52;
		return a3_51;
	}
}

// 2306302A: void vTaskInternalSetTimeOutState(Register ptr32 a0)
// Called from:
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
void vTaskInternalSetTimeOutState(ptr32 a0)
{
	Eq_2 a5_7 = g_t4200F544;
	*g_t4200F53C = a0;
	*((word32) a5_7 + 4) = a0;
}

