pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306347A: Register Eq_2 xTaskPriorityDisinherit(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_356491) a5Out)
// Called from:
//      prvCopyDataToQueue
Eq_2 xTaskPriorityDisinherit(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, struct Eq_356491 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = 0x00;
		a1Out = a1;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	Eq_2 a5_19 = g_t4200F514;
	if (a5_19 != a0)
		user_vAssertCalled(a4, mstatus, out a5_19);
	struct Eq_356491 * a5_134;
	Eq_2 s0_31;
	if (a5_19 != 0x00)
	{
		s0_31 = *((word32) a4 + 80);
		a5_134 = (word32) a5_19 - 1;
		a5_134->t0054 = s0_31;
		if (a3 == a4)
			goto l230634A8;
	}
	else
	{
		struct Eq_363121 * a5_26;
		user_vAssertCalled(a4, mstatus, out a5_26);
		s0_31 = *((word32) a4 + 80);
		a5_26->t0053 = s0_31;
		a5_134 = (struct Eq_356491 *) ((char *) a5_26 - 1);
		if (a3 == a4)
			goto l230634A8;
	}
	if (a5_134 == null)
	{
		Eq_2 s1_40 = (word32) s0_31 + 4;
		ui32 a4_45;
		word32 a5_152;
		if (uxListRemove(a3, a4, out a4_45, out a5_152) == 0x00 && *((char *) (&g_t42018538) + a4_45 * 0x14) == 0x00)
			*(~(0x01 << a4_45) & a3) = (word32) *a3;
		Eq_2 s0_70 = *((word32) a3 + 80);
		word32 a2_75 = *a1;
		*((word32) a3 + 44) = s0_70;
		*((word32) s0_70 + 24) = 32 - a3;
		Eq_2 a5_83 = 0x01 << a3 | a1;
		*a5_83 = a2_75;
		struct Eq_356491 * a5_92;
		vListInsertEnd(s1_40, a3 * 0x14, a5_83, out a5_92);
		a0Out = 0x01;
		a1Out = s1_40;
		a4Out = a3 * 0x14;
		a5Out = a5_92;
		return s1_40;
	}
l230634A8:
	a0Out = 0x00;
	a1Out = a1;
	a4Out = a4;
	a5Out = a5_134;
	return s1;
}

// 23063552: Register Eq_2 vTaskPriorityDisinheritAfterTimeout(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out)
// Called from:
//      xQueueSemaphoreTake
Eq_2 vTaskPriorityDisinheritAfterTimeout(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & s2Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a3Out = a3;
		s2Out = s2;
		return s1;
	}
	Eq_2 s2_198;
	struct Eq_363209 * a0_14 = *((word32) a5 + 84);
	Eq_2 s1_16 = a1;
	if (a5 != 0x00)
	{
		s2_198 = a0_14->t0050;
		if (s2_198 >= a1)
		{
l2306356E:
			if (a5 == s2_198)
				goto l2306357C;
l23063574:
			Eq_2 s0_38 = *((word32) a3 + 84);
			if (a3 == 0x01)
			{
				Eq_2 a4_41 = g_t4200F514;
				if (a4_41 == s0_38)
					a2 = user_vAssertCalled(a4_41, mstatus, out a5);
				struct Eq_363243 * s0_50 = *((word32) a4_41 + 24);
				s0_50->t002C = s2_198;
				if (a4_41 >= 0x00)
				{
					s2_198 = 32 - s2_198;
					s0_50->t0018 = s2_198;
				}
				Eq_2 a4_60 = a5 << 0x02;
				word32 s0_64 = *((word32) a4_60 + 20);
				s1_16.u0 = 0x42018538;
				if (a4_60 == (a5 + a4_60 << 2) + 0x42018538)
				{
					ui32 a3_114;
					word32 a4_206;
					word32 a5_207;
					ui32 a0_72 = uxListRemove(a3, a4_60, out a4_206, out a5_207);
					if (a0_72 != 0x00)
						a3_114 = 0x01 << a0_72;
					else
					{
						a3_114 = 0x01 << a0_72;
						if (*((char *) &g_t42018538 + a0_72 * 0x14) == 0x00)
						{
							a2 = ~a3_114 & a1;
							*a2 = *a1;
						}
					}
					Eq_2 a4_109 = *a2;
					Eq_2 a3_115 = a3_114 | a2;
					*a3_115 = a4_109;
					0x00 = (int8) dwArg38;
					word32 a5_208;
					vListInsertEnd(s0_64 + 4, a4_109, a0_72 * 0x05, out a5_208);
					a1Out = s0_64 + 4;
					a3Out = a3_115;
					s2Out = s0_64 + 4;
					return 0x42018538;
				}
			}
l2306357C:
			0x00 = (int8) dwArg38;
			a1Out = a1;
			a3Out = a3;
			s2Out = s2_198;
			return s1_16;
		}
	}
	else
	{
		a2 = user_vAssertCalled(a4, mstatus, out a5);
		s2_198 = a0_14->t0050;
		if (s2_198 >= a1)
			goto l2306356E;
	}
	s2_198 = a1;
	if (a5 == a1)
		goto l2306357C;
	goto l23063574;
}

// 23063658: Register Eq_2 vTaskEnterCritical(Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      rxl_hwdesc_init
//      txl_frame_get
//      rxu_swdesc_upload_evt
//      bl_tx_resend
//      bl_tx_try_flush
//      bl_output
//      my_pbuf_free_custom
//      stateConnectedIPNoEnter
//      cmd_wifi_dump
//      wifi_mgmr_sta_ip_set
//      wifi_mgmr_scan_filter_hidden_ssid
//      irq_lock
//      bl_sys_time_sync_state
//      xEventGroupWaitBits
//      prvUnlockQueue
//      xQueueGenericReset
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      uxQueueMessagesWaiting
//      vQueueWaitForMessageRestricted
//      xStreamBufferSend
//      xStreamBufferReceive
//      prvCheckForValidListAndQueue
//      pvTimerGetTimerID
//      loopset_led_trigger
//      sys_arch_protect
//      sntp_recv
//      sntp_get_time
//      vfs_uart_poll
//      tcp_sent_callback
//      udp_send_data
//      udp_receive_callback
//      tcp_send_data
//      bloop_evt_set_async
//      bloop_run
Eq_2 vTaskEnterCritical(Eq_2 a4, ptr32 mstatus, union Eq_2 & a5Out)
{
	__csrrc(mstatus, 0x08);
	Eq_2 a5_6 = g_t4200F540;
	if (a5_6 == 0x00)
	{
		a5Out = a5_6;
		return a4;
	}
	else
	{
		Eq_2 a5_9;
		Eq_2 a4_8 = vTaskEnterCritical.part.7(a4, out a5_9);
		a5Out = a5_9;
		return a4_8;
	}
}

// 2306366C: Register Eq_2 vTaskExitCritical(Register Eq_2 a3, Register ptr32 mstatus, Register out (ptr32 (ptr32 Eq_2)) a4Out, Register out Eq_2 a5Out)
// Called from:
//      rxl_hwdesc_init
//      txl_frame_get
//      rxu_swdesc_upload_evt
//      bl_tx_resend
//      bl_tx_try_flush
//      bl_output
//      my_pbuf_free_custom
//      stateConnectedIPNoEnter
//      cmd_wifi_dump
//      wifi_mgmr_sta_ip_set
//      wifi_mgmr_scan_filter_hidden_ssid
//      irq_unlock
//      bl_sys_time_sync_state
//      xEventGroupWaitBits
//      prvUnlockQueue
//      xQueueGenericReset
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      uxQueueMessagesWaiting
//      vQueueWaitForMessageRestricted
//      xStreamBufferSend
//      xStreamBufferReceive
//      prvCheckForValidListAndQueue
//      pvTimerGetTimerID
//      loopset_led_trigger
//      sys_arch_unprotect
//      sntp_recv
//      sntp_get_time
//      vfs_uart_poll
//      tcp_sent_callback
//      udp_send_data
//      udp_receive_callback
//      tcp_send_data
//      bloop_evt_set_async
//      bloop_run
Eq_2 vTaskExitCritical(Eq_2 a3, ptr32 mstatus, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_20 = g_t4200F540;
	if (a5_20 != 0x00)
	{
		a5_20 = *((word32) g_t4200F514 + 0x0044);
		if (a5_20 != 0x00)
		{
			union Eq_2 ** a4_12;
			Eq_2 a5_13;
			Eq_2 a3_11 = vTaskExitCritical.part.8(a3, mstatus, out a4_12, out a5_13);
			a4Out = a4_12;
			a5Out = a5_13;
			return a3_11;
		}
	}
	a4Out = a4;
	a5Out = a5_20;
	return a3;
}

