pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23063688: Register Eq_2 vTaskList(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 byte) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack word32 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
// Called from:
//      ps_cmd
Eq_2 vTaskList(Eq_2 ra, Eq_2 s1, byte * a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg34, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArg0108, word32 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_28 = **s1;
	*a0 = 0x00;
	word32 a0_38;
	Eq_2 a3_41;
	struct Eq_362801 * a4_42;
	Eq_2 s1_46;
	word32 s3_396;
	word32 s4_397;
	word32 s8_398;
	word32 a1_391;
	word32 a2_392;
	word32 s2_395;
	word32 a5_393;
	word32 a6_394;
	pvPortMalloc(ra, s1, a5_28 * 0x24, a3, a4, a5_28, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_46, out a0_38, out a1_391, out a2_392, out a3_41, out a4_42, out a5_393, out a6_394, out s2_395, out s3_396, out s4_397, out s8_398);
	if (a0_38 == 0x00)
	{
		0x00 = dwArg0128;
		return s1_46;
	}
	else
	{
		word32 a0_67;
		struct Eq_363396 * s8_77;
		Eq_2 a1_104;
		Eq_2 a5_189;
		Eq_2 s0_108 = uxTaskGetSystemState(a0_38, s1_46, null, a3_41, a4_42, mstatus, s5, dwArgC8, dwArg0108, dwArg0148, out a0_67, out a1_104, out a5_189, out s8_77);
		if (a0_67 != 0x00)
		{
			struct Eq_363396 * s1_192 = s8_77;
			word32 s6_150 = 0x230C1000;
			up32 s5_177 = 0x04;
			Eq_2 s4_121 = 0x0E;
			int32 s3_175 = 32;
			do
			{
				s5_177 < (word32) s1_192->b000C;
				word32 a5_400;
				word32 a4_399;
				strcpy(s0_108, a1_104, out a4_399, out a5_400);
				word32 a1_401;
				word32 a2_402;
				word32 a5_405;
				word32 a3_403;
				word32 a4_404;
				Eq_2 a0_114 = strlen(s0_108, out a1_401, out a2_402, out a3_403, out a4_404, out a5_405);
				if (s4_121 >= a0_114)
				{
					word32 a0_122 = a0_114 + s0_108;
					byte * a5_123 = (word32) s0_108 + 0x0F;
					do
					{
						*a0_122 = (byte) s3_175;
						++a0_122;
					} while (a5_123 != a0_122);
					a0_114.u0 = 0x0F;
				}
				word32 s0_133 = s0_108 + a0_114;
				*s0_133 = 0x00;
				Eq_2 s0_170;
				word32 s1_171;
				word32 s2_174;
				word32 s7_411;
				word32 s8_412;
				word32 s11_415;
				word32 s9_413;
				word32 s10_414;
				word32 a0_406;
				word32 a1_407;
				word32 a5_410;
				word32 a2_408;
				word32 a4_409;
				ra = sprintf(ra, s0_133, s6_150 + -328, dwLoc18, dwArg08, dwArg34, s9, s7, dwArg78, dwArg9C, out s0_170, out s1_171, out a0_406, out a1_407, out a2_408, out a4_409, out a5_410, out s2_174, out s3_175, out s4_121, out s5_177, out s6_150, out s7_411, out s8_412, out s9_413, out s10_414, out s11_415);
				s1_192 = s1_171 + 36;
				word32 a2_416;
				word32 a4_418;
				word32 a3_417;
				s0_108 = s0_170 + strlen(s0_170, out a1_104, out a2_416, out a3_417, out a4_418, out a5_189);
			} while (s1_171 + 36 != s2_174);
		}
		0x00 = dwArg0128;
		Eq_2 s1_218;
		word32 t3_428;
		word32 a5_425;
		word32 s4_427;
		word32 a6_426;
		word32 a2_422;
		word32 a4_424;
		word32 a3_423;
		word32 s0_419;
		word32 a1_421;
		word32 a0_420;
		vPortFree(s5, dwArgB8, a5_189, mstatus, dwArg0158, dwArg0198, out s0_419, out s1_218, out a0_420, out a1_421, out a2_422, out a3_423, out a4_424, out a5_425, out a6_426, out s4_427, out t3_428);
		return s1_218;
	}
}

// 23063786: Register (ptr32 Eq_355915) uxTaskResetEventItemValue(Register (ptr32 Eq_355915) a3, Register Eq_2 a4)
// Called from:
//      xEventGroupWaitBits
struct Eq_355915 * uxTaskResetEventItemValue(struct Eq_355915 * a3, Eq_2 a4)
{
	struct Eq_355915 * a3_12 = a3->ptr002C;
	(32 - a3_12)->t0018 = a4;
	return a3_12;
}

// 230637A2: Register Eq_43437 pvTaskIncrementMutexHeldCount(Register Eq_2 a0, Register Eq_2 a4, Register out Eq_2 a4Out, Register out (ptr32 Eq_358441) a5Out)
// Called from:
//      xQueueSemaphoreTake
Eq_43437 pvTaskIncrementMutexHeldCount(Eq_2 a0, Eq_2 a4, union Eq_2 & a4Out, struct Eq_358441 & a5Out)
{
	if (a4 != 0x00)
	{
		a3 = *((word32) a4 + 84);
		*((word32) a4 + 0x0055) = a3;
		a4 = (word32) a4 + 1;
	}
	struct Eq_358441 * a5_15 = *a0;
	a4Out = a4;
	a5Out = a5_15;
	return a3;
}

// 230637BA: Register word32 ulTaskNotifyTake(Register (ptr32 Eq_6434) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack word32 dwArg0128, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_6434) s2Out, Register out Eq_2 s3Out)
// Called from:
//      ipc_emb_wait
//      bloop_run
word32 ulTaskNotifyTake(struct Eq_6434 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, word32 dwArg0128, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_6434 & s2Out, union Eq_2 & s3Out)
{
	__csrrc(mstatus, 0x08);
	struct Eq_6434 * s2_15 = a0;
	Eq_2 s3_17 = a1;
	if (a5 != 0x00)
		a4 = vTaskEnterCritical.part.7(a4, out a5);
	Eq_2 a5_29 = *((word32) a5 + 88);
	if (a5_29 == 0x00)
	{
		((word32) a5_29 + 92)->u0 = 0x01;
		a4.u0 = 0x01;
		if (a1 != 0x00)
		{
			word32 a2_216;
			word32 a1_215;
			word32 s1_214;
			word32 s4_217;
			prvAddCurrentTaskToDelayedList(a1, 0x01, a2, a3, 0x01, dwArg18, out s1_214, out a0, out a1_215, out a2_216, out a4, out a5_29, out s2_15, out s3_17, out s4_217);
			__syscall();
		}
	}
	if (a5_29 != 0x00)
	{
		a5_29 = *((word32) a5_29 + 0x0044);
		if (a5_29 != 0x00)
			a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_29);
	}
	__csrrc(mstatus, 0x08);
	if (a5_29 != 0x00)
	{
		word32 a5_218;
		a4 = vTaskEnterCritical.part.7(a4, out a5_218);
	}
	Eq_2 a5_81 = a0->t0058;
	if (a0 != null)
	{
		if (s2_15 != null)
			((word32) a5_81 + 88)->u0 = 0x00;
		else
		{
			a4 = (char *) a0 - 1;
			*((word32) a4 + 88) = a5_81;
		}
	}
	((word32) a5_81 + 92)->u0 = 0x00;
	word32 s1_94 = *a5_81;
	if (a5_81 != 0x00 && *((word32) a5_81 + 0x0044) != 0x00)
	{
		word32 a5_219;
		a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_219);
	}
	0x00 = dwArg0128;
	a2Out = dwArg0100;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2_15;
	s3Out = s3_17;
	return s1_94;
}

// 23063860: Register word32 xTaskNotifyWait(Register (ptr32 Eq_359669) a0, Register Eq_359670 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_359669) s1Out, Register out ptr32 a2Out, Register out (ptr32 (ptr32 Eq_2)) a4Out, Register out Eq_2 a5Out, Register out Eq_359670 s2Out, Register out (ptr32 Eq_2) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out)
// Called from:
//      xStreamBufferSend
//      xStreamBufferReceive
word32 xTaskNotifyWait(struct Eq_359669 * a0, Eq_359670 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg0128, struct Eq_359669 & s1Out, ptr32 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_359670 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out)
{
	__csrrc(mstatus, 0x08);
	struct Eq_359669 * s1_19 = a0;
	Eq_359670 s2_107 = a1;
	Eq_2 s4_23 = a2;
	union Eq_2 * s3_28 = &g_t4200F540;
	Eq_2 a5_29 = g_t4200F540;
	if (a5_29 != 0x00)
		vTaskEnterCritical.part.7(a4, out a5_29);
	Eq_2 a4_37 = 0x02;
	if ((word32) *((word32) a5_29 + 92) != 0x02)
	{
		Eq_2 a5_44 = a0->t0058;
		s1_19 = ~a0 & a0;
		s1_19->t0058 = a5_44;
		((word32) a5_44 + 92)->u0 = 0x01;
		a4_37.u0 = 0x01;
		if (a3 != 0x00)
		{
			word32 a1_267;
			word32 a2_268;
			word32 a5_269;
			word32 a0_266;
			prvAddCurrentTaskToDelayedList(a3, 0x01, a2, a3, 0x01, dwArg18, out s1_19, out a0_266, out a1_267, out a2_268, out a4_37, out a5_269, out s2_107, out s3_28, out s4_23);
			__syscall();
		}
	}
	Eq_2 a3_134;
	Eq_2 a5_71 = *s3_28;
	a3_134 = a3;
	if (a5_71 != 0x00)
	{
		a3_134 = a3;
		if (*((word32) a5_71 + 0x0044) != 0x00)
		{
			word32 a5_270;
			a3_134 = vTaskExitCritical.part.8(a3, mstatus, out a4_37, out a5_270);
		}
	}
	__csrrc(mstatus, 0x08);
	Eq_2 a5_83 = *s3_28;
	if (a5_83 != 0x00)
		vTaskEnterCritical.part.7(a4_37, out a5_83);
	if (s4_23 != 0x00)
	{
		a5_83 = *((word32) a5_83 + 88);
		*s4_23 = a5_83;
	}
	union Eq_2 ** a4_100 = (union Eq_2 **) 0x02;
	struct Eq_363757 * a5_102 = (word32) *((word32) a5_83 + 92);
	if (a5_102 == (struct Eq_363757 *) 0x02)
	{
		ui32 s2_109 = ~s2_107;
		a5_102 = *(struct Eq_363757 **) 0x5A;
		a5_102->dw0058 = s2_109 & 0x02;
		s2_107 = s2_109 & 0x02;
	}
	a5_102->b005C = 0x00;
	Eq_2 a5_121 = *s3_28;
	if (a5_121 != 0x00)
	{
		a5_121 = *((word32) a5_121 + 0x0044);
		if (a5_121 != 0x00)
			vTaskExitCritical.part.8(a3_134, mstatus, out a4_100, out a5_121);
	}
	0x00 = (int8) dwArg0128;
	s1Out = s1_19;
	a2Out = dwArg0100;
	a4Out = a4_100;
	a5Out = a5_121;
	s2Out = s2_107;
	s3Out = s3_28;
	s4Out = dwArg78;
	s5Out = a3;
	return dwArgE4;
}

// 23063940: Register Eq_2 xTaskGenericNotify(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_6405 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_irq_handler
//      bl_tx_notify
//      xStreamBufferSend
//      xStreamBufferReceive
//      bloop_evt_set_async
Eq_2 xTaskGenericNotify(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_6405 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 a2_26;
	Eq_2 s0_17 = a0;
	Eq_2 s1_21 = a2;
	a2_26 = a2;
	if (a0 == 0x00)
	{
		word32 a5_290;
		a2_26 = user_vAssertCalled(a4, mstatus, out a5_290);
	}
	__csrrc(mstatus, 0x08);
	Eq_2 a5_32 = g_t4200F540;
	if (a5_32 != 0x00)
		a4 = vTaskEnterCritical.part.7(a4, out a5_32);
	if (a3 != 0x00)
	{
		s0_17 = *((word32) a5_32 + 88);
		*a3 = a5_32;
	}
	ui32 s2_46 = (word32) *((word32) s0_17 + 92);
	((word32) s0_17 + 92)->u0 = 0x02;
	Eq_6405 s2_264 = s2_46 & 0x00FF;
	if (a2 > 0x04)
	{
		Eq_2 s0_56 = *((word32) a4 + 88);
		if (a4 != ~0x00)
		{
			word32 a5_291;
			a2_26 = user_vAssertCalled(a4, mstatus, out a5_291);
		}
		ptr32 a1_238;
		a1_238 = a1;
		if ((s2_46 & 0x00FF) == 0x01)
		{
			word32 a4_292;
			word32 a5_293;
			uxListRemove(a3, a4, out a4_292, out a5_293);
			a4 = *a2_26;
			s2_264 = (s2_46 & 0x00FF) << a3 | a2_26;
			*a4 = s2_264;
			word32 a5_94;
			vListInsertEnd((word32) s0_56 + 4, a4, a3 * 0x14, out a5_94);
			s1_21 = (word32) s0_56 + 4;
			a1_238 = (word32) s0_56 + 4;
			if (a5_94 != 0x00)
			{
				word32 a5_294;
				user_vAssertCalled(a4, mstatus, out a5_294);
			}
			if (*((word32) g_t4200F514 + 44) < a4)
				__syscall();
		}
		Eq_2 a5_112 = g_t4200F540;
		if (a5_112 != 0x00)
		{
			a5_112 = *((word32) g_t4200F514 + 0x0044);
			if (a5_112 != 0x00)
				a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_112);
		}
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_21;
		a0Out = 0x01;
		a1Out = a1_238;
		a2Out = dwArg0100;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_112;
		s2Out = s2_264;
		s3Out = 0x4200F540;
		s4Out = a1;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s0_156;
		Eq_2 s1_157;
		Eq_6405 s2_158;
		ptr32 s4_159;
		Eq_2 ra_160;
		ptr32 s3_161;
		ptr32 a0_162;
		ptr32 a1_163;
		Eq_2 a2_164;
		Eq_2 a3_165;
		ptr32 mstatus_166;
		Eq_2 a5_167;
		Eq_2 a4_168;
		(*(<anonymous> *) 0x04)();
		s0Out = s0_156;
		s1Out = s1_157;
		a0Out = a0_162;
		a1Out = a1_163;
		a2Out = a2_164;
		a3Out = a3_165;
		a4Out = a4_168;
		a5Out = a5_167;
		s2Out = s2_158;
		s3Out = s3_161;
		s4Out = s4_159;
		mstatusOut = mstatus_166;
		return ra_160;
	}
}

// 23063A6E: Register word32 xTaskGenericNotifyFromISR(Register word32 ra, Register Eq_2 a0, Register (ptr32 Eq_2) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack word32 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg84, Register out Eq_2 s0Out, Register out Eq_359956 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      xStreamBufferSendFromISR
//      xStreamBufferReceiveFromISR
word32 xTaskGenericNotifyFromISR(word32 ra, Eq_2 a0, union Eq_2 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, word32 dwArg00, word32 dwArg04, word32 dwArg28, word32 dwArg44, Eq_2 dwArg84, union Eq_2 & s0Out, union Eq_359956 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_13 = a0;
	if (a0 == 0x00)
	{
		user_vAssertCalled(a4, mstatus, out a5);
		dwLoc1C = a2;
		a2 = dwArg84;
		s0_13 = a3;
	}
	if (a3 != 0x00)
	{
		s0_13 = *((word32) a5 + 88);
		*a5 = a3;
	}
	ui32 s1_37 = (word32) *((word32) s0_13 + 92);
	((word32) s0_13 + 92)->u0 = 0x02;
	Eq_359956 s1_234 = s1_37 & 0x00FF;
	if (a2 > 0x04)
	{
		Eq_2 s0_104 = *((word32) a4 + 88);
		if (a4 != ~0x00)
		{
			word32 a5_261;
			a2 = user_vAssertCalled(a4, mstatus, out a5_261);
		}
		Eq_2 a5_105 = 0x01;
		if ((s1_37 & 0x00FF) == 0x01)
		{
			Eq_2 s0_55 = *(union Eq_2 *) 0x29;
			if (true)
			{
				word32 a5_262;
				a2 = user_vAssertCalled(a4, mstatus, out a5_262);
			}
			Eq_2 a5_62 = g_t4200F52C;
			if (a5_62 != 0x00)
			{
				word32 a5_266;
				vListInsertEnd((word32) s0_55 + 24, a4, a5_62, out a5_266);
			}
			else
			{
				word32 a5_264;
				word32 a4_263;
				uxListRemove(a3, a4, out a4_263, out a5_264);
				a3 = *a1;
				Eq_2 a5_89 = 0x01 << a2 | a1;
				*a5_89 = a3;
				ui32 a4_83 = a2 * 0x05;
				word32 a5_265;
				vListInsertEnd((word32) s0_55 + 4, a4_83 << 2, a5_89, out a5_265);
				s1_234 = (word32) s0_55 + 4;
				a4 = a4_83 << 2;
			}
			s0_104 = *((byte) a4.u0 + 44);
			a5_105 = *((word32) g_t4200F514 + 44);
			if (a5_105 < a4)
			{
				if (a4 != 0x00)
					*a4.u0 = 0x01;
				g_dw4200F548 = 0x01;
				a5_105.u0 = 0x4200F000;
				a4.u0 = 0x01;
			}
		}
		s0Out = s0_104;
		s1Out = s1_234;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_105;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s0_139;
		word32 ra_141;
		Eq_359956 s1_142;
		Eq_2 a4_144;
		Eq_2 a3_145;
		Eq_2 a5_146;
		word32 tp_149;
		ptr32 mstatus_154;
		g_t230C0EA4();
		s0Out = s0_139;
		s1Out = s1_142;
		a3Out = a3_145;
		a4Out = a4_144;
		a5Out = a5_146;
		mstatusOut = mstatus_154;
		return ra_141;
	}
}

// 23063B8A: void vTaskNotifyGiveFromISR(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38)
// Called from:
//      bl_irq_handler
void vTaskNotifyGiveFromISR(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38)
{
	if (a0 == 0x00)
	{
		word32 a5_156;
		a2 = user_vAssertCalled(a4, mstatus, out a5_156);
	}
	Eq_2 a4_23 = (word32) *((word32) a0 + 92);
	((word32) a0 + 92)->u0 = 0x02;
	*(struct Eq_363757 **) 0x5B = *(struct Eq_363757 **) 0x5A;
	if (a4_23 == 0x01)
	{
		Eq_2 s0_29 = *(union Eq_2 *) 0x2B;
		if (true)
		{
			word32 a5_157;
			a2 = user_vAssertCalled(a4_23, mstatus, out a5_157);
		}
		Eq_2 a5_35 = g_t4200F52C;
		if (a5_35 != 0x00)
		{
			word32 a5_161;
			vListInsertEnd((word32) s0_29 + 24, a4_23, a5_35, out a5_161);
		}
		else
		{
			word32 a5_159;
			word32 a4_158;
			uxListRemove(0x01, a4_23, out a4_158, out a5_159);
			Eq_2 a5_59 = 0x01 << a2 | a1;
			*a5_59 = *a1;
			ui32 a4_53 = a2 * 0x05;
			word32 a5_160;
			vListInsertEnd((word32) s0_29 + 4, a4_53 << 2, a5_59, out a5_160);
			a4_23 = a4_53 << 2;
		}
		if (*((word32) g_t4200F514 + 44) < a4_23)
		{
			if (a1 != 0x00)
				*(union Eq_2 *) 0x01 = a1;
			g_dw4200F548 = 0x01;
			0x00 = (int8) dwArg38;
			return;
		}
	}
	0x00 = (int8) dwArg38;
}

// 23063C4A: Register Eq_2 xTaskNotifyStateClear(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      xStreamBufferSend
//      xStreamBufferReceive
Eq_2 xTaskNotifyStateClear(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 s1_11 = a0;
	if (a0 == 0x00)
	{
		a5.u0 = 0x4200F000;
		s1_11 = g_t4200F514;
	}
	__csrrc(mstatus, 0x08);
	if (a5 != 0x00)
	{
		word32 a5_98;
		vTaskEnterCritical.part.7(a4, out a5_98);
	}
	Eq_2 a5_28 = (word32) *((word32) s1_11 + 92);
	ptr32 a4_29 = 0x02;
	if (a5_28 == 0x02)
		((word32) s1_11 + 92)->u0 = 0x00;
	if (a5_28 != 0x00)
	{
		a5_28 = *((word32) g_t4200F514 + 0x0044);
		if (a5_28 != 0x00)
			a3 = vTaskExitCritical.part.8(a3, mstatus, out a4_29, out a5_28);
	}
	a4Out = a4_29;
	a5Out = a5_28;
	return a3;
}

// 23063CA8: Register word32 prvCheckForValidListAndQueue(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 a6Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      xTimerCreateTimerTask
//      xTimerCreate
//      xTimerCreateStatic
word32 prvCheckForValidListAndQueue(Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg0118, ptr32 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & a6Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	word32 a5_16;
	vTaskEnterCritical(a4, mstatus, out a5_16);
	if (a5_16 == 0x00)
	{
		vListInitialise(1107396700);
		vListInitialise(0x42018870);
		g_t4200F54C.u0 = 1107396700;
		g_t4200F550.u0 = 0x42018870;
		struct Eq_358804 * a0_40;
		word32 a2_109;
		word32 a4_110;
		word32 a5_111;
		a0_40->t0000 = xQueueGenericCreateStatic(0x04, (struct Eq_123277 *) 0x10, &g_t4201881C, &g_t42018884, 0x00, mstatus, dwArg0118, out s1, out a0_40, out a2_109, out a3, out a4_110, out a5_111, out s2, out s3, out s4);
		if (a0_40 != null)
			a6 = vQueueAddToRegistry(a0_40, &g_dw230C0EF4, a3);
	}
	0x00 = (int8) dwArg38;
	ptr32 a5_70;
	ptr32 a4_72;
	Eq_2 a3_71 = vTaskExitCritical(a3, mstatus, out a4_72, out a5_70);
	s1Out = s1;
	a3Out = a3_71;
	a4Out = a4_72;
	a5Out = a5_70;
	a6Out = a6;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	return dwArg14;
}

// 23063D2C: Register Eq_2 prvInsertTimerInActiveList(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register out Eq_2 a5Out)
// Called from:
//      prvTimerTask
Eq_2 prvInsertTimerInActiveList(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, union Eq_2 & a5Out)
{
	*((word32) a1 + 4) = a0;
	*((word32) a0 + 16) = a0;
	if (a2 >= a1)
	{
		Eq_2 a2_31 = a2 - a3;
		if (a2_31 < a4)
		{
			Eq_2 a5_39;
			word32 a4_62;
			vListInsert(g_t4200F550, a2_31, a3, out a4_62, out a5_39);
			a5Out = a5_39;
			return 0x00;
		}
	}
	else if (a2 >= a3 || a1 < a3)
	{
		word32 a4_63;
		Eq_2 a5_24;
		vListInsert(g_t4200F54C, a2, a3, out a4_63, out a5_24);
		a5Out = a5_24;
		return 0x00;
	}
	a5Out = a0;
	return 0x01;
}

// 23063D84: Register word32 xTimerCreateTimerTask(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg64, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0194, Register out ptr32 t0Out, Register out ptr32 a0Out, Register out Eq_2 a4Out)
// Called from:
//      vTaskStartScheduler
word32 xTimerCreateTimerTask(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg64, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0194, ptr32 & t0Out, ptr32 & a0Out, union Eq_2 & a4Out)
{
	Eq_2 a6_15;
	word32 s1_139;
	word32 a3_140;
	word32 a5_141;
	word32 s2_142;
	word32 s3_143;
	word32 s4_144;
	Eq_2 a4_13;
	word32 tp_135 = prvCheckForValidListAndQueue(a3, a4, mstatus, dwArg18, dwArgF8, out s1_139, out a3_140, out a4_13, out a5_141, out a6_15, out s2_142, out s3_143, out s4_144);
	if (g_dw4200F558 != 0x00)
	{
		word32 a0_40;
		word32 s0_146;
		word32 s1_147;
		word32 a2_148;
		word32 a3_149;
		word32 a5_150;
		word32 s2_151;
		word32 s3_152;
		word32 s6_153;
		word32 s7_154;
		xTaskCreateStatic(ra, &g_ptr23063FF0, 587992828, dwArg64, 0x00, 0x1F, vApplicationGetTimerTaskMemory(fp + ~0x1B, fp + ~0x17, fp + ~0x13), a6_15, mstatus, 0x00, dwArg04, dwArgC8, dwArg0194, out tp_135, out t0, out s0_146, out s1_147, out a0_40, out a2_148, out a3_149, out a4_13, out a5_150, out s2_151, out s3_152, out s6_153, out s7_154);
		g_dw4200F55C = a0_40;
		if (a0_40 != 0x00)
		{
			t0Out = t0;
			a0Out = 0x01;
			a4Out = a4_13;
			return tp_135;
		}
	}
	word32 a5_145;
	user_vAssertCalled(a4_13, mstatus, out a5_145);
	t0Out = t0;
	a0Out = 0x00;
	a4Out = a4_13;
	return tp_135;
}

// 23063DE0: Register word32 xTimerCreate(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_251750) s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_251753 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      k_timer_init
word32 xTimerCreate(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0158, struct Eq_251750 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_251753 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	struct Eq_364366 * a0_31;
	word32 a2_141;
	word32 a1_140;
	word32 a6_142;
	word32 s4_143;
	word32 s8_144;
	ptr32 s3_131;
	struct Eq_251750 * s1_129;
	ptr32 s2_130;
	Eq_2 a4_127;
	Eq_251753 a5_128;
	Eq_2 a3_126;
	pvPortMalloc(ra, a1, 44, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_129, out a0_31, out a1_140, out a2_141, out a3_126, out a4_127, out a5_128, out a6_142, out s2_130, out s3_131, out s4_143, out s8_144);
	if (a0_31 != null)
	{
		a0_31->b0028 = 0x00;
		if (s1_129 == null)
		{
			word32 a5_145;
			user_vAssertCalled(a4_127, mstatus, out a5_145);
		}
		word32 s4_65;
		word32 a6_146;
		prvCheckForValidListAndQueue(a3_126, a4_127, mstatus, dwArg18, dwArgF8, out s1_129, out a3_126, out a4_127, out a5_128, out a6_146, out s2_130, out s3_131, out s4_65);
		a0_31->dw0000 = a0;
		s1_129->ptr0018 = a0_31;
		a0_31->dw001C = s4_65;
		a0_31->ptr0020 = s3_131;
		vListInitialiseItem(&a0_31->dw0000 + 1);
		if (s2_130 != 0x00)
		{
			ui32 a5_76 = (word32) a0_31->b0028;
			a0_31->b0028 = (byte) (a5_76 | 4);
			a5_128 = a5_76 | 4;
		}
	}
	s1Out = s1_129;
	a3Out = a3_126;
	a4Out = a4_127;
	a5Out = a5_128;
	s2Out = s2_130;
	s3Out = s3_131;
	s4Out = dwArg04;
	return s1;
}

