pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23064C04: void UART0_IRQHandler(Register word32 ra)
void UART0_IRQHandler(word32 ra)
{
	uart_generic_notify_handler(ra, 0x00);
}

// 23064C0A: void UART1_IRQHandler(Register word32 ra)
void UART1_IRQHandler(word32 ra)
{
	uart_generic_notify_handler(ra, 0x01);
}

// 23064C10: Register word32 bl_uart_init(Register Eq_2 a0, Register word32 a1, Register word32 a2, Register word32 a5, Register out Eq_3286 s1Out, Register out ptr32 a1Out, Register out Eq_3288 s2Out, Register out ptr32 s8Out)
// Called from:
//      bfl_main
//      vfs_uart_init
word32 bl_uart_init(Eq_2 a0, word32 a1, word32 a2, word32 a5, union Eq_3286 & s1Out, ptr32 & a1Out, union Eq_3288 & s2Out, ptr32 & s8Out)
{
	word32 a7_248;
	word32 a5_246;
	word32 a6_247;
	word32 a3_244;
	word32 a4_245;
	word32 a1_31;
	word32 a2_32;
	memcpy(fp + -48, 0x230C0F04, 0x10, out a1_31, out a2_32, out a3_244, out a4_245, out a5_246, out a6_247, out a7_248);
	struct Eq_365911 * a5_46 = (word32) g_b4200F588;
	if (a5_46 == null)
	{
		*GLB_Set_UART_CLK(0x01, 0x01, 0x03, a5_46, out a2_32) = 0x01;
		a1_31 = 0x01;
	}
	Eq_3286 s1_124;
	Eq_3286 a1_125;
	struct Eq_365919 * sp_74;
	word32 s3_75;
	word32 a1_76;
	word32 s0_77;
	word32 s2_78;
	word32 a2_80;
	word32 s1_81;
	word32 s4_82;
	word32 a5_84;
	g_t4200C5D8();
	sp_74->b0008 = (byte) s3_75;
	sp_74->w000A = (word16) s1_81;
	ui32 s3_102;
	ui32 s0_104;
	Eq_3288 s2_105;
	word32 ra_110;
	g_t4200C5D8();
	if (s0_104 != 0x00)
	{
		s1_124.u0 = 0x07;
		a1_125.u0 = 0x06;
	}
	else
	{
		s1_124.u0 = 0x03;
		a1_125.u0 = 0x02;
	}
	GLB_UART_Fun_Sel(s3_102 & 7, a1_125);
	UART_IntMask(0x08, 0x01, GLB_UART_Fun_Sel(s2_105 & 7, s1_124));
	UART_FifoConfig(fp - 60, UART_TxFreeRun(0x01, UART_Init(s0_104, 0x01, UART_Disable(0x02))));
	word32 a4_249;
	word32 a5_250;
	ptr32 a1_189 = UART_Enable(s0_104, 0x02, out a4_249, out a5_250);
	s1Out = s1_124;
	a1Out = a1_189;
	s2Out = s2_105;
	s8Out = dwArgD4;
	return ra_110;
}

// 23064D00: Register Eq_2 bl_uart_data_send(Register Eq_2 s1, Register Eq_2 a0, Register Eq_485 a1, Register out Eq_366027 a0Out, Register out Eq_366028 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      hal_uart_send
//      vprint
//      bl_putchar
//      puts
Eq_2 bl_uart_data_send(Eq_2 s1, Eq_2 a0, Eq_485 a1, union Eq_366027 & a0Out, union Eq_366028 & a4Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s8Out)
{
	do
	{
		ptr32 a5_22;
	} while (UART_GetTxFifoCount(a0, out a5_22) == 0x00);
	*((word32) s1 + 0x0088) = (byte) a1;
	a0Out.u0 = 0x00;
	a4Out = a0 << 0x02;
	a5Out = a5_22;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return a0;
}

// 23064D36: Register ui32 bl_uart_data_recv(Register Eq_2 s0, Register ui32 a0, Register out Eq_366052 a4Out, Register out ptr32 a5Out)
// Called from:
//      hal_uart_recv_II
ui32 bl_uart_data_recv(Eq_2 s0, ui32 a0, union Eq_366052 & a4Out, ptr32 & a5Out)
{
	ui32 a0_15;
	ptr32 a5_14;
	if (UART_GetRxFifoCount(a0, out a5_14) != 0x00)
		a0_15 = (word32) *((word32) s0 + 0x008C) & 0x00FF;
	else
		a0_15 = ~0x00;
	a4Out = a0 << 0x02;
	a5Out = a5_14;
	return a0_15;
}

// 23064D66: Register Eq_2 bl_uart_int_rx_enable(Register Eq_2 a4)
// Called from:
//      bl_uart_int_enable
Eq_2 bl_uart_int_rx_enable(Eq_2 a4)
{
	return UART_IntMask(0x04, 0x00, UART_IntMask(0x01, 0x00, UART_IntMask(0x03, 0x00, UART_SetRxTimeoutValue(0x18, a4))));
}

// 23064D9C: Register Eq_2 bl_uart_int_rx_disable(Register Eq_2 a4)
// Called from:
//      bl_uart_int_disable
Eq_2 bl_uart_int_rx_disable(Eq_2 a4)
{
	return UART_IntMask(0x04, 0x01, UART_IntMask(0x01, 0x01, UART_IntMask(0x03, 0x01, a4)));
}

// 23064DCA: void bl_uart_int_tx_enable(Register Eq_2 a4)
// Called from:
//      bl_uart_int_enable
//      hal_uart_send_trigger
void bl_uart_int_tx_enable(Eq_2 a4)
{
	UART_IntMask(0x02, 0x00, a4);
}

// 23064DDE: void bl_uart_int_tx_disable(Register Eq_2 a4)
// Called from:
//      bl_uart_int_disable
//      hal_uart_send_trigger_off
void bl_uart_int_tx_disable(Eq_2 a4)
{
	UART_IntMask(0x02, 0x01, a4);
}

// 23064DF2: Register Eq_2 bl_uart_flush(Register Eq_2 a0, Register out ptr32 a5Out)
// Called from:
//      vfs_uart_init
//      hal_uart_send_flush
Eq_2 bl_uart_flush(Eq_2 a0, ptr32 & a5Out)
{
	do
	{
		ptr32 a5_16;
	} while (UART_GetTxFifoCount(a0, out a5_16) != 32);
	a5Out = a5_16;
	return a0;
}

// 23064E16: void bl_uart_getdefconfig(Register (ptr32 byte) a1)
// Called from:
//      vfs_uart_open
void bl_uart_getdefconfig(byte * a1)
{
	if (a1 != null)
		*a1 = 0x00;
}

// 23064E1E: void bl_uart_setconfig(Register ui32 a0)
// Called from:
//      hal_uart_setbaud
//      hal_uart_setconfig
void bl_uart_setconfig(ui32 a0)
{
	uint32 a2_26;
	word32 a1_79;
	word32 a3_80;
	word32 a4_81;
	word32 a5_82;
	word32 a6_83;
	word32 a7_84;
	memcpy(fp + ~0x1F, 587992852, 0x10, out a1_79, out a2_26, out a3_80, out a4_81, out a5_82, out a6_83, out a7_84);
	UART_TxFreeRun(0x01, UART_Init(a0, a2_26, UART_Disable(0x02)));
	word32 a4_85;
	word32 a5_86;
	UART_Enable(a0, 0x02, out a4_85, out a5_86);
}

// 23064E70: void bl_uart_setbaud(Register ui32 a0)
// Called from:
//      hal_uart_setbaud
void bl_uart_setbaud(ui32 a0)
{
	bl_uart_setconfig(a0);
}

// 23064E76: void bl_uart_int_enable(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register Eq_2 a4, Register Eq_2 s2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC)
// Called from:
//      vfs_uart_open
void bl_uart_int_enable(Eq_2 ra, Eq_2 s1, word32 a0, Eq_2 a4, Eq_2 s2, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC)
{
	struct Eq_127708 * a0_50;
	if (a0 != 0x00)
	{
		if (a0 != 0x01)
			return;
		bl_uart_int_tx_enable(bl_uart_int_rx_enable(0x01));
		word32 s0_188;
		word32 s1_189;
		word32 a3_190;
		word32 s2_191;
		word32 s3_192;
		bl_irq_register(ra, s1, 46, 0x23064C0A, s2, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s0_188, out s1_189, out a3_190, out s2_191, out s3_192);
		a0_50 = (struct Eq_127708 *) 46;
	}
	else
	{
		bl_uart_int_tx_enable(bl_uart_int_rx_enable(a4));
		word32 s0_183;
		word32 s1_184;
		word32 a3_185;
		word32 s2_186;
		word32 s3_187;
		bl_irq_register(ra, s1, 45, 0x23064C04, s2, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s0_183, out s1_184, out a3_185, out s2_186, out s3_187);
		a0_50 = (struct Eq_127708 *) 45;
	}
	bl_irq_enable(a0_50);
}

