pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23064ED0: void bl_uart_int_disable(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register Eq_2 a4, Register Eq_2 s2, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C)
// Called from:
//      vfs_uart_close
void bl_uart_int_disable(Eq_2 ra, Eq_2 s1, word32 a0, Eq_2 a4, Eq_2 s2, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C)
{
	struct Eq_127833 * a0_50;
	if (a0 != 0x00)
	{
		if (a0 != 0x01)
			return;
		bl_uart_int_tx_disable(bl_uart_int_rx_disable(0x01));
		bl_irq_unregister(ra, s1, 46, 0x23064C0A, s2, dwLoc08, dwArg30, dwArg34, dwArg40, dwArg44, dwArg68, dwArg7C, dwArg8C);
		a0_50 = (struct Eq_127833 *) 46;
	}
	else
	{
		bl_uart_int_tx_disable(bl_uart_int_rx_disable(a4));
		bl_irq_unregister(ra, s1, 45, 0x23064C04, s2, dwLoc08, dwArg30, dwArg34, dwArg40, dwArg44, dwArg68, dwArg7C, dwArg8C);
		a0_50 = (struct Eq_127833 *) 45;
	}
	bl_irq_disable(a0_50);
}

// 23064F28: void bl_uart_int_rx_notify_register(Register uint32 a0, Register (ptr32 Eq_366294) a1, Register Eq_2 a2)
// Called from:
//      hal_uart_notify_register
void bl_uart_int_rx_notify_register(uint32 a0, struct Eq_366294 * a1, Eq_2 a2)
{
	if (a0 > 0x01)
		return;
	ui32 a0_9 = (a0 << 0x04) + 0x420188D4;
	a1->dw0000 = a0_9;
	*((word32) a2 + 4) = a0_9;
}

// 23064F48: void bl_uart_int_tx_notify_register(Register uint32 a0, Register (ptr32 Eq_366294) a1, Register Eq_2 a2)
// Called from:
//      hal_uart_notify_register
void bl_uart_int_tx_notify_register(uint32 a0, struct Eq_366294 * a1, Eq_2 a2)
{
	if (a0 > 0x01)
		return;
	ui32 a0_9 = (a0 << 0x04) + 0x420188D4;
	a1->dw0008 = a0_9;
	*((word32) a2 + 0x0C) = a0_9;
}

// 23064F68: Register Eq_2 bl_chip_info(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 misa)
// Called from:
//      bfl_main
Eq_2 bl_chip_info(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 misa)
{
	byte * a0_35;
	__csrrs(misa, ra);
	Eq_2 s0_11 = a0;
	if (s1 >> 0x1E != 0x02)
	{
		if (s1 >> 0x1E != 0x03)
		{
			Eq_2 a1_58;
			s0_11 = (word32) a0 + 4;
			if (s1 >> 0x1E == 0x01)
				a1_58.u0 = 0x230C11E0;
			else
				a1_58.u0 = 587993592;
			word32 a1_173;
			word32 a2_174;
			word32 a3_175;
			word32 a4_176;
			word32 a5_177;
			word32 a6_178;
			word32 a7_179;
			memcpy(a0, a1_58, 0x04, out a1_173, out a2_174, out a3_175, out a4_176, out a5_177, out a6_178, out a7_179);
			a0_35 = (word32) a0 + 4;
		}
		else
		{
			word32 a4_169;
			word32 a7_172;
			word32 a6_171;
			word32 a2_167;
			word32 a3_168;
			word32 a5_170;
			word32 a1_166;
			memcpy(a0, 0x230C11F0, 0x05, out a1_166, out a2_167, out a3_168, out a4_169, out a5_170, out a6_171, out a7_172);
			a0_35 = (word32) a0 + 5;
		}
	}
	else
	{
		word32 a7_165;
		word32 a5_163;
		word32 a6_164;
		word32 a3_161;
		word32 a4_162;
		word32 a1_159;
		word32 a2_160;
		memcpy(a0, 587993576, 0x04, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163, out a6_164, out a7_165);
		a0_35 = (word32) a0 + 4;
	}
	*a0_35 = 0x2D;
	byte * a4_82 = a0_35 + 1;
	word32 a5_83;
	for (a5_83 = 0x00; a5_83 != 0x1A; ++a5_83)
	{
		if ((0x01 << a5_83 & s1) != 0x00)
		{
			*a4_82 = (byte) (a5_83 + 65);
			++a4_82;
		}
	}
	*a4_82 = 0x00;
	return s0_11;
}

// 23065012: Register ptr32 bl_chip_banner(Register ptr32 a0)
// Called from:
//      bfl_main
ptr32 bl_chip_banner(ptr32 a0)
{
	g_ptr230C0F24 = a0;
	return 0x00;
}

// 23065020: Register word32 bl_chip_memory_ram(Register (ptr32 Eq_344485) a1, Register ptr32 a2, Register Eq_2 a3, Register (ptr32 Eq_2) a4, Stack word32 dwArg38)
// Called from:
//      version_cmd
word32 bl_chip_memory_ram(struct Eq_344485 * a1, ptr32 a2, Eq_2 a3, union Eq_2 * a4, word32 dwArg38)
{
	Eq_2 a0_5 = *a4;
	if (a4 <= (union Eq_2 *) 0x02)
		return ~0x00;
	*(union Eq_2 *) 0x03 = a0_5;
	g_ptr23000000 = a1;
	*(ptr32 *) 0x00400000 = a2;
	word32 a4_84;
	word32 a5_85;
	strcpy(a3, 0x230C1200, out a4_84, out a5_85);
	a1->dw0004 = 0x4200C000;
	*(ptr32 *) 0x00034004 = a2;
	word32 a4_86;
	word32 a5_87;
	strcpy((word32) a3 + 6, 0x230C1208, out a4_86, out a5_87);
	a1->dw0008 = 0x42040000;
	*(ptr32 *) 0x0A000008 = a2;
	word32 a4_88;
	word32 a5_89;
	strcpy((word32) a3 + 0x0C, 587982952, out a4_88, out a5_89);
	0x00 = dwArg38;
	return 0x00;
}

// 230650BA: void bl_sys_reset_por(Register ptr32 mstatus)
// Called from:
//      hal_reboot
void bl_sys_reset_por(ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	g_t4200C5A6();
	while (true)
		;
}

// 230650CC: void bl_sys_reset_system(Register ptr32 mstatus)
// Called from:
//      hal_sys_reset
void bl_sys_reset_system(ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	g_t4200C592();
	while (true)
		;
}

// 230650DE: Register Eq_2 bl_sys_isxipaddr(Register Eq_2 a0)
// Called from:
//      bl_mtd_write
Eq_2 bl_sys_isxipaddr(Eq_2 a0)
{
	return (word32) (((a0 & 0xFF000000) + 0xDD000000 & 0xDF000000) < 1);
}

// 230650F6: void bl_sys_em_config()
// Called from:
//      bl_sys_init
void bl_sys_em_config()
{
	ui32 a0_11;
	if (false)
	{
		if (true)
			return;
		a0_11 = 0x0F;
	}
	else
		a0_11 = 0x03;
	GLB_Set_EM_Sel(a0_11, (struct Eq_366517 *) 0x02000000);
}

// 2306511E: void bl_sys_early_init(Register ptr32 t0, Register (ptr32 Eq_23) a5, Register ptr32 mtvec)
// Called from:
//      bfl_main
void bl_sys_early_init(ptr32 t0, struct Eq_23 * a5, ptr32 mtvec)
{
	HBN_Aon_Pad_IeSmt_Cfg(0x01, a5);
	__csrrw(mtvec, t0);
}

// 2306513C: void bl_sys_init()
// Called from:
//      bfl_main
void bl_sys_init()
{
	bl_sys_em_config();
}

// 2306514C: void bl_dma_int_process(Register Eq_2 ra, Register (ptr32 Eq_366532) s0, Register Eq_366533 s1, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack word32 dwArg0198)
void bl_dma_int_process(Eq_2 ra, struct Eq_366532 * s0, Eq_366533 s1, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, word32 dwArg0198)
{
	int32 s7_110 = s0->ptr0004->dw000C;
	bl_irq_ctx_get(ra, 0x1F, fp + -52, dwLoc38, dwArg10, dwArg14, dwArg38, ra);
	Eq_366533 s2_103 = 0x00;
	ui32 s8_106 = 0x01;
	struct Eq_366565 * s3_104 = (struct Eq_366565 *) 0x4000C000;
	Eq_366533 s6_105 = 0x04;
	do
	{
		ui32 a5_36 = s8_106 << s2_103;
		ui32 s5_109 = a5_36 & s0;
		ui32 s4_102 = a5_36 & s7_110;
		if (s5_109 == 0x00)
		{
			if (s4_102 != 0x00)
				goto l23065190;
		}
		else
		{
			s0 = s3_104->ptr0008 | a5_36;
			s3_104->ptr0008 = s0;
			if (s4_102 != 0x00)
			{
l23065190:
				s0 = s3_104->ptr0010 | a5_36;
				s3_104->ptr0010 = s0;
			}
			Eq_366533 a5_123 = *((word32) s1 + 4);
			while (true)
			{
				a5_123 = *a5_123;
				if (s1 == a5_123)
					break;
				struct Eq_366592 * s1_101 = *((word32) a5_123 + 8);
				if (a5_123 == s2_103)
				{
					word32 s1_71 = *((word32) a5_123 + 0x0C);
					if (a5_123 != 0x00 && s5_109 != 0x00)
						a5_123();
					s1_101 = (struct Eq_366592 *) *((word32) a5_123 + 16);
					if (a5_123 != 0x00 && s4_102 != 0x00)
						a5_123();
				}
				s1 = s1_101->t0004;
			}
		}
		s2_103 = (word32) s2_103 + 1;
	} while (s2_103 != s6_105);
	0x00 = dwArg0198;
}

// 230651F4: Register ui32 bl_dma_int_clear(Register word32 a0, Register ui32 a4, Register out Eq_366632 a5Out)
// Called from:
//      bl_dma_IRQHandler
ui32 bl_dma_int_clear(word32 a0, ui32 a4, union Eq_366632 & a5Out)
{
	ui32 a0_8 = 0x01 << a0;
	struct Eq_366636 * a5_12 = (struct Eq_366636 *) 0x01;
	if ((a4 & a0_8 & 0x00FF) != 0x00)
	{
		(a0_8 | 0x01)->t0008 = *(union Eq_2 *) 0x09;
		a5_12 = a0_8 | 0x01;
	}
	ui32 a5_18 = a5_12 & a0_8;
	ui32 a4_16 = a5_12->dw000C;
	if ((a5_18 & 0x00FF) != 0x00)
	{
		a4_16 = (a5_18 & 0x00FF)->dw0010;
		(a0_8 | a5_18 & 0x00FF)->dw0010 = a4_16;
	}
	a5Out = a5_18 & 0x00FF;
	return a4_16;
}

// 23065226: void bl_dma_IRQHandler(Register Eq_2 ra, Register ui32 a4, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void bl_dma_IRQHandler(Eq_2 ra, ui32 a4, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	struct Eq_105929 * a5_14;
	Eq_2 a4_13 = bl_dma_int_clear(0x00, a4, out a5_14);
	<anonymous> * a5_17;
	if (utils_list_pop_front(a4_13, a5_14, out a5_17) != 0x00)
	{
		if (a5_17 != null)
			a5_17();
		if (g_dw4200F58C == 0x00)
			return;
		DMA_LLI_Update(0x00);
		DMA_Channel_Enable();
	}
	else
	{
		if ((word32) g_b420266B4 <= 0x02 && (word32) g_b420266B5 <= 0x02)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_119;
				xTaskGetTickCountFromISR(out a5_119);
			}
			else
			{
				word32 a5_118;
				xTaskGetTickCount(out a5_118);
			}
			word32 a1_122;
			word32 s1_120;
			word32 a0_121;
			word32 a2_123;
			word32 a3_124;
			word32 a4_125;
			word32 a5_126;
			word32 s2_127;
			word32 s3_128;
			word32 s4_129;
			word32 s5_130;
			word32 s6_131;
			word32 s7_132;
			word32 s8_133;
			word32 s9_134;
			word32 s10_135;
			word32 s11_136;
			bl_printk(ra, &g_t230C125C, 0x230C120C, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_120, out a0_121, out a1_122, out a2_123, out a3_124, out a4_125, out a5_126, out s2_127, out s3_128, out s4_129, out s5_130, out s6_131, out s7_132, out s8_133, out s9_134, out s10_135, out s11_136);
		}
		while (true)
			;
	}
}

// 230652BC: Register Eq_2 bl_dma_irq_register(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s6Out)
// Called from:
//      bl_dma_init
Eq_2 bl_dma_irq_register(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s6Out)
{
	if (a0 <= 0x04 && a1 != 0x00)
	{
		Eq_2 a4_27 = bl_irq_ctx_get(ra, 0x1F, fp + -36, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C);
		Eq_2 a5_31 = *((word32) s0 + 4);
		while (a5_31 != s0)
		{
			struct Eq_366867 * s0_36 = *((word32) a4_27 + 8);
			if (a0 == a4_27)
			{
				if ((word32) g_b420266B4 <= 0x03 && (word32) g_b420266B5 <= 0x03)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_442;
						xTaskGetTickCountFromISR(out a5_442);
					}
					else
					{
						word32 a5_441;
						xTaskGetTickCount(out a5_441);
					}
					word32 a2_446;
					word32 a4_448;
					word32 a3_447;
					word32 s2_450;
					word32 a5_449;
					word32 s1_443;
					word32 a1_445;
					word32 a0_444;
					word32 s3_451;
					word32 s4_452;
					word32 s5_453;
					word32 s7_454;
					word32 s8_455;
					word32 s9_456;
					word32 s10_457;
					word32 s11_458;
					ra = bl_printk(ra, &g_t230C131C, 0x230C120C, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_443, out a0_444, out a1_445, out a2_446, out a3_447, out a4_448, out a5_449, out s2_450, out s3_451, out s4_452, out s5_453, out s6, out s7_454, out s8_455, out s9_456, out s10_457, out s11_458);
				}
				goto l2306531E;
			}
			s0 = s0_36->t0004;
		}
		Eq_2 a0_92;
		word32 a1_433;
		word32 a2_434;
		word32 a3_435;
		word32 a5_436;
		word32 a6_437;
		word32 s8_438;
		struct Eq_366879 * s1_100;
		word32 s2_101;
		word32 s4_103;
		word32 s3_102;
		Eq_2 a4_109;
		pvPortMalloc(ra, a0, 0x18, a3, a4_27, a5_31, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_100, out a0_92, out a1_433, out a2_434, out a3_435, out a4_109, out a5_436, out a6_437, out s2_101, out s3_102, out s4_103, out s8_438);
		if (a0_92 == 0x00)
		{
			a4_109 = (word32) g_b420266B4;
			if (a4_109 <= 0x04)
			{
				a4_109 = (word32) g_b420266B5;
				if (a4_109 <= 0x04)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_440;
						xTaskGetTickCountFromISR(out a5_440);
					}
					else
					{
						word32 a5_439;
						xTaskGetTickCount(out a5_439);
					}
					word32 a0_459;
					word32 a1_460;
					word32 a2_461;
					word32 a3_462;
					word32 a5_463;
					word32 s5_464;
					word32 s7_465;
					word32 s8_466;
					word32 s9_467;
					word32 s10_468;
					word32 s11_469;
					ra = bl_printk(ra, &g_t230C1350, 0x230C120C, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_100, out a0_459, out a1_460, out a2_461, out a3_462, out a4_109, out a5_463, out s2_101, out s3_102, out s4_103, out s5_464, out s6, out s7_465, out s8_466, out s9_467, out s10_468, out s11_469);
				}
			}
		}
		s1_100->t0008 = a0_92;
		*((word32) a0_92 + 0x0C) = s2_101;
		*((word32) a0_92 + 16) = s4_103;
		*((word32) a0_92 + 20) = s3_102;
		Eq_2 a5_169 = *((word32) a4_109 + 4);
		*a5_169 = a0_92;
		*((word32) a4_109 + 4) = a0_92;
		*((word32) a0_92 + 4) = a5_169;
		*a0_92 = a4_109;
	}
	else if ((word32) g_b420266B4 <= 0x04 && (word32) g_b420266B5 <= 0x04)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_416;
			xTaskGetTickCountFromISR(out a5_416);
		}
		else
		{
			word32 a5_415;
			xTaskGetTickCount(out a5_415);
		}
		word32 s1_417;
		word32 a0_418;
		word32 a1_419;
		word32 a2_420;
		word32 a3_421;
		word32 a4_422;
		word32 a5_423;
		word32 s2_424;
		word32 s3_425;
		word32 s4_426;
		word32 s5_427;
		word32 s7_428;
		word32 s8_429;
		word32 s9_430;
		word32 s10_431;
		word32 s11_432;
		ra = bl_printk(ra, &g_t230C12F4, 0x230C120C, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_417, out a0_418, out a1_419, out a2_420, out a3_421, out a4_422, out a5_423, out s2_424, out s3_425, out s4_426, out s5_427, out s6, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432);
	}
l2306531E:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s6Out = s6;
	return ra;
}

