pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23065422: Register Eq_2 bl_dma_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 s6Out)
// Called from:
//      bfl_main
Eq_2 bl_dma_init(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg9C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & s6Out)
{
	struct Eq_274 * a0_161;
	utils_list_init(&g_dw4200F58C);
	word32 a0_18;
	Eq_2 a3_21;
	Eq_2 a4_22;
	Eq_2 a5_23;
	Eq_2 s1_26;
	word32 a1_318;
	word32 a2_319;
	word32 s2_321;
	word32 a6_320;
	word32 s3_322;
	word32 s4_323;
	word32 s8_324;
	Eq_2 s0_118 = pvPortMalloc(ra, s1, 0x04, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_26, out a0_18, out a1_318, out a2_319, out a3_21, out a4_22, out a5_23, out a6_320, out s2_321, out s3_322, out s4_323, out s8_324);
	if (a0_18 == 0x00)
	{
		if ((word32) g_b420266B4 > 0x04 || (word32) g_b420266B5 > 0x04)
			goto l2306548E;
		if (g_t4200F560 != 0x00)
		{
			word32 a5_334;
			xTaskGetTickCountFromISR(out a5_334);
		}
		else
		{
			word32 a5_333;
			xTaskGetTickCount(out a5_333);
		}
		a0_161 = (struct Eq_274 *) &g_t230C1294;
	}
	else
	{
		Eq_2 a0_35;
		struct Eq_367081 * a5_40;
		Eq_2 s1_43;
		Eq_2 s2_44;
		word32 a1_325;
		word32 a2_326;
		word32 a3_327;
		word32 a4_328;
		word32 a6_329;
		word32 s3_330;
		word32 s4_331;
		word32 s8_332;
		s0_118 = pvPortMalloc(ra, s1_26, 0x08, a3_21, a4_22, a5_23, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_43, out a0_35, out a1_325, out a2_326, out a3_327, out a4_328, out a5_40, out a6_329, out s2_44, out s3_330, out s4_331, out s8_332);
		*a0_35 = s0_118;
		if (a0_35 != 0x00)
		{
			*((word32) a0_35 + 4) = a0_35;
			*a0_35 = a0_35;
			DMA_Enable(a5_40);
			DMA_IntMask(0x02, 0x01);
			DMA_IntMask(0x00, 0x00);
			DMA_IntMask(0x01, 0x00);
			DMA_LLI_Init(fp + ~0x13);
			Eq_2 s0_88;
			Eq_2 s3_91;
			word32 s1_335;
			word32 a3_336;
			word32 s2_337;
			ra = bl_dma_irq_register(bl_irq_register_with_ctx(ra, s1_43, 0x1F, 587616588, s0_118, s2_44, dwLoc18, dwArg08, dwArg20, dwArg24, dwArg30, dwArg34, dwArg50, dwArg54, dwArg58, ra, dwArg78, dwArg7C, dwArg9C, out s0_88, out s1_335, out a3_336, out s2_337, out s3_91), s0_88, 0x00, 0x23065226, 0x00, s3_91, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg48, dwArg4C, ra, dwArgE8, dwArg0108, dwArg0128, out s0_118, out s6);
			bl_irq_enable((struct Eq_127708 *) 0x1F);
			goto l2306548E;
		}
		if ((word32) g_b420266B4 > 0x04 || (word32) g_b420266B5 > 0x04)
		{
l2306548E:
			s0Out = s0_118;
			s6Out = s6;
			return ra;
		}
		if (g_t4200F560 != 0x00)
		{
			word32 a5_339;
			xTaskGetTickCountFromISR(out a5_339);
		}
		else
		{
			word32 a5_338;
			xTaskGetTickCount(out a5_338);
		}
		a0_161 = (struct Eq_274 *) &g_t230C12C0;
	}
	word32 s1_340;
	word32 a0_341;
	word32 a1_342;
	word32 a2_343;
	word32 a3_344;
	word32 a4_345;
	word32 a5_346;
	word32 s2_347;
	word32 s3_348;
	word32 s4_349;
	word32 s5_350;
	word32 s7_351;
	word32 s8_352;
	word32 s9_353;
	word32 s10_354;
	word32 s11_355;
	ra = bl_printk(ra, a0_161, 0x230C120C, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_340, out a0_341, out a1_342, out a2_343, out a3_344, out a4_345, out a5_346, out s2_347, out s3_348, out s4_349, out s5_350, out s6, out s7_351, out s8_352, out s9_353, out s10_354, out s11_355);
	goto l2306548E;
}

// 2306554A: void _irq_num_check.part.0(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      bl_irq_ctx_get
//      bl_irq_register
//      bl_irq_unregister
void _irq_num_check.part.0(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if ((word32) g_b420266B4 > 0x04 || (word32) g_b420266B6 > 0x04)
	{
		while (true)
			;
	}
	else
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_73;
			xTaskGetTickCountFromISR(out a5_73);
		}
		else
		{
			word32 a5_72;
			xTaskGetTickCount(out a5_72);
		}
		word32 a2_77;
		word32 a1_76;
		word32 a0_75;
		word32 s1_74;
		word32 a3_78;
		word32 a4_79;
		word32 a5_80;
		word32 s2_81;
		word32 s3_82;
		word32 s4_83;
		word32 s5_84;
		word32 s6_85;
		word32 s7_86;
		word32 s8_87;
		word32 s9_88;
		word32 s10_89;
		word32 s11_90;
		bl_printk(ra, &g_t230C13E4, 587994072, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_74, out a0_75, out a1_76, out a2_77, out a3_78, out a4_79, out a5_80, out s2_81, out s3_82, out s4_83, out s5_84, out s6_85, out s7_86, out s8_87, out s9_88, out s10_89, out s11_90);
		while (true)
			;
	}
}

// 230655A8: void bl_irq_enable(Register (ptr32 Eq_127708) a0)
// Called from:
//      ble_controller_init
//      bl_uart_int_enable
//      bl_dma_init
//      bl_sec_init
//      bl_wifi_enable_irq
//      bl_timer_tick_enable
void bl_irq_enable(struct Eq_127708 * a0)
{
	a0->b2800400 = 0x01;
}

// 230655BA: Register word32 bl_irq_disable(Register (ptr32 Eq_127833) a0)
// Called from:
//      ble_controller_deinit
//      bl_uart_int_disable
word32 bl_irq_disable(struct Eq_127833 * a0)
{
	a0->b2800400 = 0x00;
	return 0x02800400;
}

// 230655CA: void bl_irq_pending_clear(Register (ptr32 Eq_127663) a0)
// Called from:
//      ble_controller_init
void bl_irq_pending_clear(struct Eq_127663 * a0)
{
	a0->b2800000 = 0x00;
}

// 230655D6: Register Eq_2 bl_irq_register_with_ctx(Register Eq_2 ra, Register Eq_2 s1, Register Eq_127676 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgBC, Register out Eq_2 s0Out, Register out (ptr32 word32) s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out Eq_2 s3Out)
// Called from:
//      bl_dma_init
//      bl_irq_register
Eq_2 bl_irq_register_with_ctx(Eq_2 ra, Eq_2 s1, Eq_127676 a0, word32 a1, Eq_2 a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgBC, union Eq_2 & s0Out, word32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, union Eq_2 & s3Out)
{
	if (a0 > 79)
		_irq_num_check.part.0(ra, dwLoc08, dwArg40, dwArg44, s1, dwArg8C);
	word32 * s1_20 = a0 << 0x02;
	word32 a5_22 = g_a420188F4[a0 * 0x04];
	word32 s4_25 = a1;
	Eq_2 s3_27 = a2;
	ptr32 s2_28 = 0x420188F4;
	if (a5_22 != 0x00)
	{
		if (a5_22 == a1)
			goto l230656D6;
		if ((word32) g_b420266B4 <= 0x03)
		{
			if ((word32) g_b420266B6 > 0x03)
			{
				if (a1 == 0x00)
				{
l23065676:
					if ((word32) g_b420266B6 <= 0x04)
					{
						if (g_t4200F560 != 0x00)
						{
							word32 a5_366;
							xTaskGetTickCountFromISR(out a5_366);
						}
						else
						{
							word32 a5_380;
							xTaskGetTickCount(out a5_380);
						}
						ptr32 a3_149;
						word32 * s1_153;
						ptr32 s2_156;
						Eq_2 s3_157;
						word32 a0_367;
						word32 a1_368;
						word32 a2_369;
						word32 a4_370;
						word32 a5_371;
						word32 s4_372;
						word32 s5_373;
						word32 s6_374;
						word32 s7_375;
						word32 s8_376;
						word32 s9_377;
						word32 s10_378;
						word32 s11_379;
						Eq_2 ra_152 = bl_printk(ra, &g_t230C1478, 587994072, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_153, out a0_367, out a1_368, out a2_369, out a3_149, out a4_370, out a5_371, out s2_156, out s3_157, out s4_372, out s5_373, out s6_374, out s7_375, out s8_376, out s9_377, out s10_378, out s11_379);
						s0Out.u0 = <invalid>;
						s1Out = s1_153;
						a3Out = a3_149;
						s2Out = s2_156;
						s3Out = s3_157;
						return ra_152;
					}
					goto l230656EC;
				}
l230656D6:
				s1_20 += s2_28;
				*s1_20 = s4_25;
				union Eq_2 * s0_92 = ((word32) a0.u1 + 80 << 2) + s2_28;
				if (s3_27 == 0x00)
					*s0_92 = (union Eq_2 *) 0x00;
				else
					*s0_92 = (union Eq_2 *) s3_27;
l230656EC:
				s0Out.u0 = <invalid>;
				s1Out = s1_20;
				a3Out = a3;
				s2Out = s2_28;
				s3Out = s3_27;
				return ra;
			}
			if (g_t4200F560 != 0x00)
			{
				word32 a5_353;
				xTaskGetTickCountFromISR(out a5_353);
			}
			else
			{
				word32 a5_381;
				xTaskGetTickCount(out a5_381);
			}
			word32 a0_354;
			word32 a1_355;
			word32 a2_356;
			word32 a4_357;
			word32 a5_358;
			word32 s5_359;
			word32 s6_360;
			word32 s7_361;
			word32 s8_362;
			word32 s9_363;
			word32 s10_364;
			word32 s11_365;
			ra = bl_printk(ra, &g_t230C1440, 587994072, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_20, out a0_354, out a1_355, out a2_356, out a3, out a4_357, out a5_358, out s2_28, out s3_27, out s4_25, out s5_359, out s6_360, out s7_361, out s8_362, out s9_363, out s10_364, out s11_365);
		}
	}
	if (s4_25 == 0x00)
	{
		if ((word32) g_b420266B4 > 0x04)
			goto l230656EC;
		goto l23065676;
	}
	goto l230656D6;
}

