pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 230656FC: Register word32 bl_irq_ctx_get(Register Eq_2 ra, Register Eq_366548 a0, Register ptr32 a1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
// Called from:
//      bl_dma_int_process
//      bl_dma_irq_register
word32 bl_irq_ctx_get(Eq_2 ra, Eq_366548 a0, ptr32 a1, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	if (a0 <= 79)
	{
		g_a420188F4[((word32) a0.u1 + 80) * 0x04] + 0x00 = a1;
		return 0x420188F4;
	}
	else
		_irq_num_check.part.0(ra, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C);
}

// 23065722: Register Eq_2 bl_irq_register(Register Eq_2 ra, Register Eq_2 s1, Register Eq_127676 a0, Register word32 a1, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgBC, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      ble_controller_init
//      bl_uart_int_enable
//      bl_sec_init
//      bl_wifi_enable_irq
//      bl_timer_tick_enable
Eq_2 bl_irq_register(Eq_2 ra, Eq_2 s1, Eq_127676 a0, word32 a1, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgBC, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out)
{
	ptr32 s0_13;
	ptr32 s1_14;
	ptr32 s2_15;
	ptr32 s3_16;
	ptr32 a3_23;
	Eq_2 ra_25 = bl_irq_register_with_ctx(ra, s1, a0, a1, 0x00, s2, dwArg08, dwArg28, dwArg40, dwArg44, dwArg50, dwArg54, dwArg70, dwArg74, dwArg78, dwArg8C, dwArg98, dwArg9C, dwArgBC, out s0_13, out s1_14, out a3_23, out s2_15, out s3_16);
	s0Out = s0_13;
	s1Out = s1_14;
	a3Out = a3_23;
	s2Out = s2_15;
	s3Out = s3_16;
	return ra_25;
}

// 23065728: void bl_irq_unregister(Register Eq_2 ra, Register Eq_2 s1, Register Eq_366263 a0, Register word32 a1, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C)
// Called from:
//      bl_uart_int_disable
void bl_irq_unregister(Eq_2 ra, Eq_2 s1, Eq_366263 a0, word32 a1, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg9C)
{
	if (a0 <= 79)
	{
		struct Eq_367553 * s3_18 = a0 << 0x02;
		word32 s2_23 = a1;
		if (g_a420188F4[a0 * 0x04] != a1 && ((word32) g_b420266B4 <= 0x03 && (word32) g_b420266B6 <= 0x03))
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_153;
				xTaskGetTickCountFromISR(out a5_153);
			}
			else
			{
				word32 a5_152;
				xTaskGetTickCount(out a5_152);
			}
			word32 s1_154;
			word32 a0_155;
			word32 a1_156;
			word32 a2_157;
			word32 a3_158;
			word32 a4_159;
			word32 a5_160;
			word32 s4_161;
			word32 s5_162;
			word32 s6_163;
			word32 s7_164;
			word32 s8_165;
			word32 s9_166;
			word32 s10_167;
			word32 s11_168;
			bl_printk(ra, &g_t230C14A8, 587994072, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_154, out a0_155, out a1_156, out a2_157, out a3_158, out a4_159, out a5_160, out s2_23, out s3_18, out s4_161, out s5_162, out s6_163, out s7_164, out s8_165, out s9_166, out s10_167, out s11_168);
		}
		s3_18->dw420188F4 = s2_23;
	}
	else
		_irq_num_check.part.0(ra, dwLoc08, dwArg40, dwArg44, s1, dwArg8C);
}

// 230657CC: void interrupt_entry(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void interrupt_entry(Eq_2 ra, word32 a0, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	Eq_367633 a2_5 = (word32) (word27) a0;
	if (a2_5 > 79 || g_a420188F4[a2_5 * 0x04] == 0x00)
	{
		word32 a4_67;
		word32 a3_66;
		word32 a2_65;
		word32 a1_64;
		word32 a0_63;
		word32 s1_62;
		word32 a5_68;
		word32 a7_69;
		word32 s2_70;
		word32 s3_71;
		word32 s4_72;
		word32 s5_73;
		word32 s6_74;
		word32 s7_75;
		word32 s8_76;
		word32 s9_77;
		word32 s10_78;
		word32 s11_79;
		word32 t4_80;
		printf(ra, &g_t230C1750, (word32) a2_5.u1 - 16, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_62, out a0_63, out a1_64, out a2_65, out a3_66, out a4_67, out a5_68, out a7_69, out s2_70, out s3_71, out s4_72, out s5_73, out s6_74, out s7_75, out s8_76, out s9_77, out s10_78, out s11_79, out t4_80);
		while (true)
			;
	}
	else if (a0 == 0x00)
		;
}

// 2306581A: void exception_entry(Register Eq_2 ra, Register Eq_2 gp, Register ui32 a0, Register (ptr32 Eq_367697) a1, Register (ptr32 word32) a3, Register (ptr32 (ptr32 Eq_367697)) a5, Register Eq_2 s2, Register word32 fs0, Register word32 fs1, Register word32 fa0, Register word32 fa1, Register word32 fa2, Register word32 fa3, Register word32 fa4, Register word32 fa5, Register ptr32 mstatus, Register ptr32 mcause, Register ptr32 mtval, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg08, Stack word32 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack word32 dwArg84, Stack Eq_2 dwArg9C)
void exception_entry(Eq_2 ra, Eq_2 gp, ui32 a0, struct Eq_367697 * a1, word32 * a3, struct Eq_367697 ** a5, Eq_2 s2, word32 fs0, word32 fs1, word32 fa0, word32 fa1, word32 fa2, word32 fa3, word32 fa4, word32 fa5, ptr32 mstatus, ptr32 mcause, ptr32 mtval, word32 dwArg00, word32 dwArg04, Eq_2 dwArg08, word32 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, word32 dwArg84, Eq_2 dwArg9C)
{
	if ((a0 & 0x03FF) != 0x04)
	{
		if ((a0 & 0x03FF) != 0x06)
		{
			word32 a0_283;
			word32 a1_284;
			word32 a2_285;
			word32 a4_286;
			word32 a5_287;
			word32 s4_288;
			word32 s8_289;
			puts(0x230C14E4, out a0_283, out a1_284, out a2_285, out a4_286, out a5_287, out s4_288, out s8_289);
			Eq_2 a3_46;
			word32 a0_68;
			word32 a1_71;
			word32 a2_72;
			word32 a3_73;
			word32 s1_77;
			word32 s2_80;
			word32 s1_290;
			word32 a0_291;
			word32 a1_292;
			word32 a2_293;
			word32 a4_294;
			word32 a5_295;
			word32 a7_296;
			word32 s2_297;
			word32 s3_298;
			word32 s4_299;
			word32 s5_300;
			word32 s6_301;
			word32 s7_302;
			word32 s8_303;
			word32 s9_304;
			word32 s10_305;
			word32 s11_306;
			word32 t4_307;
			word32 a4_308;
			word32 a5_309;
			word32 a7_310;
			word32 s3_311;
			word32 s4_312;
			word32 s5_313;
			word32 s6_314;
			word32 s7_315;
			word32 s8_316;
			word32 s9_317;
			word32 s10_318;
			word32 s11_319;
			word32 t4_320;
			Eq_2 ra_76 = printf(printf(ra, &g_t230C14FC, 0x06, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_290, out a0_291, out a1_292, out a2_293, out a3_46, out a4_294, out a5_295, out a7_296, out s2_297, out s3_298, out s4_299, out s5_300, out s6_301, out s7_302, out s8_303, out s9_304, out s10_305, out s11_306, out t4_307), &g_t230C1524, a3_46, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_77, out a0_68, out a1_71, out a2_72, out a3_73, out a4_308, out a5_309, out a7_310, out s2_80, out s3_311, out s4_312, out s5_313, out s6_314, out s7_315, out s8_316, out s9_317, out s10_318, out s11_319, out t4_320);
			if ((word32) (word16) a0 > 0x0F)
			{
				word32 a0_321;
				word32 a1_322;
				word32 a2_323;
				word32 a4_324;
				word32 a5_325;
				word32 s4_326;
				word32 s8_327;
				puts(587994924, out a0_321, out a1_322, out a2_323, out a4_324, out a5_325, out s4_326, out s8_327);
				backtrace_riscv();
				while (true)
					;
			}
			else
			{
				word32 tp_126;
				word32 s10_128;
				word32 s11_129;
				word32 s3_130;
				word32 s5_131;
				word32 s6_132;
				word32 s7_133;
				word32 s9_134;
				word32 t5_225;
				word32 t6_226;
				g_t230C1398();
			}
		}
		else
			misaligned_store_trap(gp, a3, a1, a5, fs0, fs1, fa0, fa1, fa2, fa3, fa4, fa5, mstatus, mcause, mtval);
	}
	else
		misaligned_load_trap(gp, a3, a1, a5, mstatus, mcause, mtval);
}

// 2306595A: void bl_irq_init()
// Called from:
//      bfl_main
void bl_irq_init()
{
	word32 s8_59;
	word32 a5_57;
	word32 s4_58;
	word32 a2_55;
	word32 a4_56;
	word32 a0_53;
	word32 a1_54;
	puts(0x230C140C, out a0_53, out a1_54, out a2_55, out a4_56, out a5_57, out s4_58, out s8_59);
	byte * a4_19 = (byte *) 0x02800400;
	do
	{
		*a4_19 = 0x00;
		++a4_19;
	} while (a4_19 != (byte *) 0x02800480);
	byte * a5_25 = (byte *) 0x02800000;
	do
	{
		*a5_25 = 0x00;
		++a5_25;
	} while (a5_25 != (byte *) 0x02800080);
}

