pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23065998: Register ui32 _trng_trigger(Register (ptr32 Eq_64398) a2, Register out Eq_367931 a4Out)
// Called from:
//      bl_sec_get_random_word
//      bl_rand_stream
//      bl_sec_init
ui32 _trng_trigger(struct Eq_64398 * a2, union Eq_367931 & a4Out)
{
	Eq_367931 a4_10 = *(union Eq_367931 *) 0x40004200;
	ui32 a3_12 = a4_10 & 1;
	if ((a4_10 & 1) == 0x00)
	{
		struct Eq_367941 * a3_9 = a2->dw0000;
		*(struct Eq_64398 **) 0x4000422C = a2;
		a3_12 = a3_9->dw0004;
		*(ui32 *) 0x40004230 = a3_12;
		*(union Eq_367931 *) 0x40004200 = a4_10 | 0x0606;
		a4_10 |= 0x0606;
	}
	a4Out = a4_10;
	return a3_12;
}

// 230659C4: Register Eq_2 wait_trng4feed(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_367963 s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_367966) a4Out, Register out (ptr32 Eq_367967) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_367971 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      bl_rand_stream
//      bl_sec_init
Eq_2 wait_trng4feed(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_367963 & s1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_367966 & a4Out, struct Eq_367967 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_367971 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_367931 a5_11 = *(union Eq_367931 *) 0x40004200;
	ptr32 a3_10 = 0x40004000;
	while ((a5_11 & 1) != 0x00)
		a5_11 = *(union Eq_367931 *) 0x40004200;
	*(union Eq_367931 *) 0x40004200 = a5_11 & ~0x02 | 0x0200;
	word32 s0_24 = 0x42018BC4;
	if ((word32) g_b420266B4 <= 0x01 && (word32) g_b420266B7 <= 0x01)
	{
		word32 * a5_30;
		if (g_t4200F560 != 0x00)
			xTaskGetTickCountFromISR(out a5_30);
		else
			xTaskGetTickCount(out a5_30);
		s0_24 = *a5_30;
		word32 a0_187;
		word32 a1_188;
		word32 a2_189;
		word32 a4_190;
		word32 a5_191;
		word32 s8_192;
		word32 s11_193;
		ra = bl_printk(ra, &g_t230C18A0, 0x230C188C, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_187, out a1_188, out a2_189, out a3_10, out a4_190, out a5_191, out s2, out s3, out s4, out s5, out s6, out s7, out s8_192, out s9, out s10, out s11_193);
	}
	**(word32 **) 0x40004208 = s0_24;
	(*(struct Eq_368002 **) 0x4000420C)->dw0004 = s0_24;
	(*(struct Eq_368007 **) 0x40004210)->dw0008 = s0_24;
	(*(struct Eq_368012 **) 0x40004214)->dw000C = s0_24;
	(*(struct Eq_368017 **) 0x40004218)->dw0010 = s0_24;
	(*(struct Eq_368022 **) 0x4000421C)->dw0014 = s0_24;
	struct Eq_367966 * a4_88 = *(struct Eq_367966 **) 0x40004220;
	a4_88->dw0018 = s0_24;
	struct Eq_367967 * a5_90 = *(struct Eq_367967 **) 0x40004224;
	a5_90->dw001C = s0_24;
	s1Out = s1;
	a2Out = dwArg10;
	a3Out = a3_10;
	a4Out = a4_88;
	a5Out = a5_90;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

// 23065A86: void sec_trng_IRQHandler(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void sec_trng_IRQHandler(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	Eq_368107 a0_9;
	int32 a1_10;
	word32 a5_216;
	word32 a2_214;
	word32 a4_215;
	aos_now_ms(a3, out a0_9, out a1_10, out a2_214, out a4_215, out a5_216);
	if (a1_10 <= 0x00 && (a1_10 != 0x00 || a0_9 <= 1999))
	{
		word32 s4_222;
		word32 s8_223;
		word32 a4_220;
		word32 a5_221;
		word32 a1_218;
		word32 a2_219;
		word32 a0_217;
		puts(587995188, out a0_217, out a1_218, out a2_219, out a4_220, out a5_221, out s4_222, out s8_223);
	}
	*(union Eq_367931 *) 0x40004200 = *(union Eq_367931 *) 0x40004200 & ~0x02 | 0x0200;
	word32 s0_34 = 0x42018BC4;
	if ((word32) g_b420266B4 <= 0x01 && (word32) g_b420266B7 <= 0x01)
	{
		word32 * a5_46;
		if (g_t4200F560 != 0x00)
			xTaskGetTickCountFromISR(out a5_46);
		else
			xTaskGetTickCount(out a5_46);
		s0_34 = *a5_46;
		word32 s4_233;
		word32 s3_232;
		word32 a5_230;
		word32 s6_235;
		word32 s5_234;
		word32 s7_236;
		word32 s8_237;
		word32 s10_239;
		word32 s9_238;
		word32 s2_231;
		word32 a3_228;
		word32 a4_229;
		word32 a1_226;
		word32 a2_227;
		word32 s1_224;
		word32 a0_225;
		word32 s11_240;
		bl_printk(ra, &g_t230C1850, 0x230C188C, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_224, out a0_225, out a1_226, out a2_227, out a3_228, out a4_229, out a5_230, out s2_231, out s3_232, out s4_233, out s5_234, out s6_235, out s7_236, out s8_237, out s9_238, out s10_239, out s11_240);
	}
	**(word32 **) 0x40004208 = s0_34;
	(*(struct Eq_368002 **) 0x4000420C)->dw0004 = s0_34;
	(*(struct Eq_368007 **) 0x40004210)->dw0008 = s0_34;
	(*(struct Eq_368012 **) 0x40004214)->dw000C = s0_34;
	(*(struct Eq_368017 **) 0x40004218)->dw0010 = s0_34;
	(*(struct Eq_368022 **) 0x4000421C)->dw0014 = s0_34;
	(*(struct Eq_367966 **) 0x40004220)->dw0018 = s0_34;
	(*(struct Eq_367967 **) 0x40004224)->dw001C = s0_34;
}

// 23065B52: Register (ptr32 Eq_64398) bl_sec_get_random_word(Register (ptr32 ptr32) s0, Register (ptr32 Eq_64398) a2, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bl_rand
struct Eq_64398 * bl_sec_get_random_word(ptr32 * s0, struct Eq_64398 * a2, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a4_11 = *s0;
	*(s0 & 0x07) = a4_11;
	if ((s0 & 0x07) == 0x00)
		a3 = _trng_trigger(a2, out a4_11);
	(s0 & 0x07)->dw0001 = 0x4200F598;
	a3Out = a3;
	a4Out = a4_11;
	a5Out = 0x42018BC4;
	return dwArg10;
}

// 23065B90: Register Eq_2 bl_rand_stream(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register (ptr32 Eq_64398) a2, Register Eq_2 s5, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      supplicantGenerateRand
Eq_2 bl_rand_stream(Eq_2 ra, word32 a0, Eq_2 a1, struct Eq_64398 * a2, Eq_2 s5, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s9Out, ptr32 & s10Out)
{
	word32 ** a5_112 = g_ptr4200F598;
	word32 s4_100 = a0;
	Eq_2 s1_126 = a1;
	word32 * s0_159 = &g_ptr4200F598;
	if (a5_112 != null)
	{
		word32 a4_270;
		_trng_trigger(a2, out a4_270);
		word32 s3_274;
		word32 s9_278;
		word32 s10_279;
		word32 s7_277;
		word32 s5_275;
		word32 s6_276;
		word32 s2_273;
		word32 a3_271;
		word32 a4_272;
		ra = wait_trng4feed(ra, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out s1_126, out a2, out a3_271, out a4_272, out a5_112, out s2_273, out s3_274, out s4_100, out s5_275, out s6_276, out s7_277, out s9_278, out s10_279);
		g_ptr4200F598 = null;
	}
	word32 s3_102 = 0x00;
	Eq_2 s5_57 = 32;
	word32 s6_108 = 0x42019000;
	word32 s7_128 = 0x1F;
	for (; s1_126 > 0x00; s1_126 -= s2_105)
	{
		s0_159 = *a5_112;
		if (a5_112 != null)
		{
			word32 a4_289;
			_trng_trigger(a2, out a4_289);
			word32 s2_294;
			word32 s9_295;
			word32 s10_296;
			word32 a2_290;
			word32 a5_293;
			word32 a3_291;
			word32 a4_292;
			ra = wait_trng4feed(ra, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out s1_126, out a2_290, out a3_291, out a4_292, out a5_293, out s2_294, out s3_102, out s4_100, out s5_57, out s6_108, out s7_128, out s9_295, out s10_296);
			*s0_159 = 0x00;
		}
		Eq_2 s2_105 = s1_126;
		if (s5_57 < s1_126)
			s2_105.u0 = 32;
		word32 a3_298;
		word32 a7_301;
		word32 a4_299;
		word32 a6_300;
		word32 a1_297;
		memcpy(s4_100 + s3_102, s6_108 + -0x043C, s2_105, out a1_297, out a2, out a3_298, out a4_299, out a5_112, out a6_300, out a7_301);
		*s0_159 = s7_128;
		s3_102 = (word32) s2_105 + s3_102;
	}
	word32 a4_280;
	_trng_trigger(a2, out a4_280);
	ptr32 a3_137;
	ptr32 a4_138;
	ptr32 s10_145;
	ptr32 s2_147;
	ptr32 s9_154;
	word32 s5_286;
	word32 s6_287;
	word32 s7_288;
	word32 a2_282;
	word32 s4_285;
	word32 a5_283;
	word32 s3_284;
	word32 s1_281;
	Eq_2 ra_143 = wait_trng4feed(ra, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out s1_281, out a2_282, out a3_137, out a4_138, out a5_283, out s2_147, out s3_284, out s4_285, out s5_286, out s6_287, out s7_288, out s9_154, out s10_145);
	*s0_159 = 0x00;
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	a3Out = a3_137;
	a4Out = a4_138;
	s2Out = s2_147;
	s9Out = s9_154;
	s10Out = s10_145;
	return ra_143;
}

// 23065C28: Register Eq_2 bl_rand(Register Eq_2 a0, Register (ptr32 Eq_64398) a2, Register out Eq_135220 a0Out, Register out Eq_135221 a1Out, Register out ptr32 a2Out, Register out (ptr32 (ptr32 Eq_367941)) a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      ecc_gen_new_secret_key
//      lld_con_start
//      llm_init
//      llc_task_random_gen_request
//      hci_le_rand_cmd_handler
//      k_get_random_byte_array
//      bl_sec_test
//      dhcp_create_msg
//      igmp_delaying_member
//      igmp_joingroup_netif
//      tcp_init
//      udp_init
//      sntp_init
//      mbedtls_platform_entropy_poll
Eq_2 bl_rand(Eq_2 a0, struct Eq_64398 * a2, union Eq_135220 & a0Out, union Eq_135221 & a1Out, ptr32 & a2Out, struct Eq_367941 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 * s0_10 = (ptr32 *) 0x13;
	do
	{
		struct Eq_367941 ** a3_18;
		ptr32 a4_14;
		ptr32 a5_15;
		a2 = bl_sec_get_random_word(s0_10, a2, out a3_18, out a4_14, out a5_15);
		s0_10 = (ptr32 *) ((char *) s0_10 - 1);
		Eq_2 s1_21 = a0;
		if (s0_10 == null)
		{
			word32 a0_80;
			word32 a2_81;
			s1_21 = puts(587995040, out a0_80, out a1, out a2_81, out a4_14, out a5_15, out s4, out s8);
			break;
		}
	} while (a0 == 0x00);
	a0Out = s1_21 >> 0x01;
	a1Out = a1;
	a2Out = dwArg10;
	a3Out = a3_18;
	a4Out = a4_14;
	a5Out = a5_15;
	s4Out = s4;
	s8Out = s8;
	return s1_21;
}

