pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23065C5A: Register Eq_2 bl_sec_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a3Out)
// Called from:
//      bfl_main
Eq_2 bl_sec_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a3Out)
{
	struct Eq_64398 * a2_11;
	Eq_2 a0_22;
	word32 a3_144;
	word32 a4_145;
	xQueueCreateMutexStatic(0x01, &g_t42018B74, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0108, dwArg0138, dwArg0178, out a0_22, out a2_11, out a3_144, out a4_145);
	g_t4200F594 = a0_22;
	word32 a4_146;
	_trng_trigger(a2_11, out a4_146);
	struct Eq_64398 * a2_37;
	word32 s1_147;
	word32 a3_148;
	word32 a4_149;
	word32 a5_150;
	word32 s2_151;
	word32 s3_152;
	word32 s4_153;
	word32 s5_154;
	word32 s6_155;
	word32 s7_156;
	word32 s9_157;
	word32 s10_158;
	Eq_2 ra_44 = wait_trng4feed(ra, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_147, out a2_37, out a3_148, out a4_149, out a5_150, out s2_151, out s3_152, out s4_153, out s5_154, out s6_155, out s7_156, out s9_157, out s10_158);
	word32 a4_159;
	_trng_trigger(a2_37, out a4_159);
	Eq_2 s1_70;
	Eq_2 s2_73;
	ptr32 a3_90;
	word32 a2_160;
	word32 a3_161;
	word32 a4_162;
	word32 a5_163;
	word32 s3_164;
	word32 s4_165;
	word32 s5_166;
	word32 s6_167;
	word32 s7_168;
	word32 s9_169;
	word32 s10_170;
	word32 s0_171;
	word32 s1_172;
	word32 s2_173;
	word32 s3_174;
	Eq_2 ra_95 = bl_irq_register(wait_trng4feed(ra_44, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_70, out a2_160, out a3_161, out a4_162, out a5_163, out s2_73, out s3_164, out s4_165, out s5_166, out s6_167, out s7_168, out s9_169, out s10_170), s1_70, 0x1C, 0x23065A86, s2_73, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s0_171, out s1_172, out a3_90, out s2_173, out s3_174);
	bl_irq_enable((struct Eq_127708 *) 0x1C);
	a3Out = a3_90;
	return ra_95;
}

// 23065CA0: Register Eq_2 bl_sec_test(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bfl_main
Eq_2 bl_sec_test(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_13;
	struct Eq_64398 * a2_15;
	word32 s1_145;
	word32 a1_146;
	word32 a3_147;
	word32 a4_148;
	word32 a5_149;
	word32 s2_150;
	word32 s3_151;
	word32 s4_152;
	word32 s5_153;
	word32 s6_154;
	word32 s7_155;
	word32 s8_156;
	word32 s9_157;
	word32 s10_158;
	word32 s11_159;
	Eq_2 ra_19 = bl_printk(ra, &g_t230C17C4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_145, out a0_13, out a1_146, out a2_15, out a3_147, out a4_148, out a5_149, out s2_150, out s3_151, out s4_152, out s5_153, out s6_154, out s7_155, out s8_156, out s9_157, out s10_158, out s11_159);
	Eq_2 a3_35;
	word32 a0_160;
	word32 a1_161;
	word32 a2_162;
	word32 a4_163;
	word32 a5_164;
	word32 s4_165;
	word32 s8_166;
	bl_rand(a0_13, a2_15, out a0_160, out a1_161, out a2_162, out a3_35, out a4_163, out a5_164, out s4_165, out s8_166);
	Eq_2 a0_49;
	struct Eq_64398 * a2_51;
	word32 s1_167;
	word32 a1_168;
	word32 a3_169;
	word32 a4_170;
	word32 a5_171;
	word32 s2_172;
	word32 s3_173;
	word32 s4_174;
	word32 s5_175;
	word32 s6_176;
	word32 s7_177;
	word32 s8_178;
	word32 s9_179;
	word32 s10_180;
	word32 s11_181;
	Eq_2 ra_55 = bl_printk(ra_19, &g_t230C1804, a3_35, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_167, out a0_49, out a1_168, out a2_51, out a3_169, out a4_170, out a5_171, out s2_172, out s3_173, out s4_174, out s5_175, out s6_176, out s7_177, out s8_178, out s9_179, out s10_180, out s11_181);
	Eq_2 a3_71;
	word32 a0_182;
	word32 a1_183;
	word32 a2_184;
	word32 a4_185;
	word32 a5_186;
	word32 s4_187;
	word32 s8_188;
	bl_rand(a0_49, a2_51, out a0_182, out a1_183, out a2_184, out a3_71, out a4_185, out a5_186, out s4_187, out s8_188);
	Eq_2 a3_87;
	ptr32 a5_106;
	ptr32 a3_111;
	ptr32 a4_112;
	ptr32 s1_115;
	word32 s1_189;
	word32 a0_190;
	word32 a1_191;
	word32 a2_192;
	word32 a4_193;
	word32 a5_194;
	word32 s2_195;
	word32 s3_196;
	word32 s4_197;
	word32 s5_198;
	word32 s6_199;
	word32 s7_200;
	word32 s8_201;
	word32 s9_202;
	word32 s10_203;
	word32 s11_204;
	word32 a0_205;
	word32 a1_206;
	word32 a2_207;
	word32 s2_208;
	word32 s3_209;
	word32 s4_210;
	word32 s5_211;
	word32 s6_212;
	word32 s7_213;
	word32 s8_214;
	word32 s9_215;
	word32 s10_216;
	word32 s11_217;
	Eq_2 ra_114 = bl_printk(bl_printk(ra_55, &g_t230C1804, a3_71, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_189, out a0_190, out a1_191, out a2_192, out a3_87, out a4_193, out a5_194, out s2_195, out s3_196, out s4_197, out s5_198, out s6_199, out s7_200, out s8_201, out s9_202, out s10_203, out s11_204), &g_t230B4414, a3_87, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_115, out a0_205, out a1_206, out a2_207, out a3_111, out a4_112, out a5_106, out s2_208, out s3_209, out s4_210, out s5_211, out s6_212, out s7_213, out s8_214, out s9_215, out s10_216, out s11_217);
	s1Out = s1_115;
	a3Out = a3_111;
	a4Out = a4_112;
	a5Out = a5_106;
	return ra_114;
}

// 23065CE8: void cmd_gpio_get(Register Eq_2 ra, Register word32 s0, Register Eq_2 a0, Register up32 a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void cmd_gpio_get(Eq_2 ra, word32 s0, Eq_2 a0, up32 a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	byte bLoc11_173 = SLICE(s0, byte, 24);
	if (a2 != 0x02)
	{
		if ((word32) g_b420266B4 <= 0x02 && (word32) g_b420266B8 <= 0x02)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_279;
				xTaskGetTickCountFromISR(out a5_279);
			}
			else
			{
				word32 a5_278;
				xTaskGetTickCount(out a5_278);
			}
			word32 s1_289;
			word32 a0_290;
			word32 a1_291;
			word32 a2_292;
			word32 a3_293;
			word32 a4_294;
			word32 a5_295;
			word32 s2_296;
			word32 s3_297;
			word32 s4_298;
			word32 s5_299;
			word32 s6_300;
			word32 s7_301;
			word32 s8_302;
			word32 s9_303;
			word32 s10_304;
			word32 s11_305;
			bl_printk(ra, &g_t230C199C, 587995532, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_289, out a0_290, out a1_291, out a2_292, out a3_293, out a4_294, out a5_295, out s2_296, out s3_297, out s4_298, out s5_299, out s6_300, out s7_301, out s8_302, out s9_303, out s10_304, out s11_305);
		}
	}
	else
	{
		word32 a4_276;
		word32 a5_277;
		word32 a3_275;
		word32 a1_273;
		word32 a2_274;
		Eq_2 a0_19 = atoi(a0, out a1_273, out a2_274, out a3_275, out a4_276, out a5_277);
		if (a0_19 < 0x00)
		{
			word32 s8_286;
			word32 s4_285;
			word32 a5_284;
			word32 a2_282;
			word32 a4_283;
			word32 a1_281;
			word32 a0_280;
			puts(587995604, out a0_280, out a1_281, out a2_282, out a4_283, out a5_284, out s4_285, out s8_286);
		}
		else
		{
			word32 a0_37 = bl_gpio_input_get(a0_19 & 0x00FF, fp + ~0x10);
			if (a2 >= (word32) g_b420266B4 && a2 >= (word32) g_b420266B8)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_288;
					xTaskGetTickCountFromISR(out a5_288);
				}
				else
				{
					word32 a5_287;
					xTaskGetTickCount(out a5_287);
				}
				word32 s1_306;
				word32 a0_307;
				word32 a1_308;
				word32 a2_309;
				word32 a3_310;
				word32 a4_311;
				word32 a5_312;
				word32 s2_313;
				word32 s3_314;
				word32 s4_315;
				word32 s5_316;
				word32 s6_317;
				word32 s7_318;
				word32 s8_319;
				word32 s9_320;
				word32 s10_321;
				word32 s11_322;
				bl_printk(ra, &g_t230C19E4, 587995532, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_306, out a0_307, out a1_308, out a2_309, out a3_310, out a4_311, out a5_312, out s2_313, out s3_314, out s4_315, out s5_316, out s6_317, out s7_318, out s8_319, out s9_320, out s10_321, out s11_322);
			}
		}
	}
}

// 23065DF8: void cmd_gpio_set(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC)
void cmd_gpio_set(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC)
{
	if (a2 != 0x03)
	{
		if ((word32) g_b420266B4 <= 0x02 && (word32) g_b420266B8 <= 0x02)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_453;
				xTaskGetTickCountFromISR(out a5_453);
			}
			else
			{
				word32 a5_452;
				xTaskGetTickCount(out a5_452);
			}
			0x00 = dwArg38;
			word32 s11_470;
			word32 s10_469;
			word32 s9_468;
			word32 s7_466;
			word32 s8_467;
			word32 s4_463;
			word32 s5_464;
			word32 s6_465;
			word32 s3_462;
			word32 a5_460;
			word32 s2_461;
			word32 a2_457;
			word32 a3_458;
			word32 a4_459;
			word32 a1_456;
			word32 a0_455;
			word32 s1_454;
			bl_printk(ra, &g_t230C1A10, 587995532, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_454, out a0_455, out a1_456, out a2_457, out a3_458, out a4_459, out a5_460, out s2_461, out s3_462, out s4_463, out s5_464, out s6_465, out s7_466, out s8_467, out s9_468, out s10_469, out s11_470);
			return;
		}
	}
	else
	{
		word32 a4_446;
		word32 a5_447;
		word32 a1_443;
		word32 a2_444;
		word32 a3_445;
		Eq_2 a0_19 = atoi(a0, out a1_443, out a2_444, out a3_445, out a4_446, out a5_447);
		word32 a2_449;
		word32 a4_450;
		word32 a5_451;
		word32 a1_448;
		word32 * a3_118;
		Eq_2 a0_36 = atoi(a0_19, out a1_448, out a2_449, out a3_118, out a4_450, out a5_451);
		Eq_2 s1_114 = a0_36;
		up32 a4_52 = (word32) g_b420266B4;
		if (a0_19 >= 0x00 && a0_36 >= 0x00)
		{
			if (a4_52 <= 0x02 && (word32) g_b420266B8 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_491;
					xTaskGetTickCountFromISR(out a5_491);
				}
				else
				{
					word32 a5_490;
					xTaskGetTickCount(out a5_490);
				}
				word32 a0_492;
				word32 a1_493;
				word32 a2_494;
				word32 a4_495;
				word32 a5_496;
				word32 s2_497;
				word32 s3_498;
				word32 s4_499;
				word32 s5_500;
				word32 s6_501;
				word32 s7_502;
				word32 s8_503;
				word32 s9_504;
				word32 s10_505;
				word32 s11_506;
				bl_printk(ra, &g_t230C1A78, 587995532, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_114, out a0_492, out a1_493, out a2_494, out a3_118, out a4_495, out a5_496, out s2_497, out s3_498, out s4_499, out s5_500, out s6_501, out s7_502, out s8_503, out s9_504, out s10_505, out s11_506);
			}
			0x00 = dwArg38;
			word32 a1_115 = (word32) (s1_114 != 0x00);
			bl_gpio_output_set(a0_19 & 0x00FF, a1_115, a3_118);
			return;
		}
		if (a4_52 <= 0x04 && (word32) g_b420266B8 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_472;
				xTaskGetTickCountFromISR(out a5_472);
			}
			else
			{
				word32 a5_471;
				xTaskGetTickCount(out a5_471);
			}
			0x00 = dwArg38;
			word32 s9_487;
			word32 s8_486;
			word32 s6_484;
			word32 s7_485;
			word32 s5_483;
			word32 s4_482;
			word32 s2_480;
			word32 s10_488;
			word32 s11_489;
			word32 s3_481;
			word32 a4_478;
			word32 a5_479;
			word32 a2_476;
			word32 a3_477;
			word32 a0_474;
			word32 a1_475;
			word32 s1_473;
			bl_printk(ra, &g_t230C1A54, 587995532, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_473, out a0_474, out a1_475, out a2_476, out a3_477, out a4_478, out a5_479, out s2_480, out s3_481, out s4_482, out s5_483, out s6_484, out s7_485, out s8_486, out s9_487, out s10_488, out s11_489);
			return;
		}
	}
	0x00 = dwArg38;
}

// 23065F54: void cmd_gpio_func(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register (ptr32 Eq_369184) a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack word32 dwArg0100, Stack word32 dwArg0128)
void cmd_gpio_func(Eq_2 ra, Eq_2 a0, word32 a2, struct Eq_369184 * a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgBC, word32 dwArg0100, word32 dwArg0128)
{
	if (a2 != 0x05)
	{
		if ((word32) g_b420266B4 <= 0x02 && (word32) g_b420266B8 <= 0x02)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_591;
				xTaskGetTickCountFromISR(out a5_591);
			}
			else
			{
				word32 a5_590;
				xTaskGetTickCount(out a5_590);
			}
			0x00 = dwArg0128;
			word32 s7_604;
			word32 s8_605;
			word32 s6_603;
			word32 s3_600;
			word32 a4_597;
			word32 s5_602;
			word32 a3_596;
			word32 a2_595;
			word32 s4_601;
			word32 s2_599;
			word32 a5_598;
			word32 s9_606;
			word32 s10_607;
			word32 s11_608;
			word32 a1_594;
			word32 s1_592;
			word32 a0_593;
			bl_printk(ra, &g_t230C18EC, 587995532, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_592, out a0_593, out a1_594, out a2_595, out a3_596, out a4_597, out a5_598, out s2_599, out s3_600, out s4_601, out s5_602, out s6_603, out s7_604, out s8_605, out s9_606, out s10_607, out s11_608);
			return;
		}
	}
	else
	{
		word32 a1_570;
		word32 a2_571;
		word32 a3_572;
		word32 a4_573;
		word32 a5_574;
		Eq_2 a0_23 = atoi(a0, out a1_570, out a2_571, out a3_572, out a4_573, out a5_574);
		word32 a4_578;
		word32 a5_579;
		word32 a3_577;
		word32 a1_575;
		word32 a2_576;
		Eq_2 a0_40 = atoi(a3->t0008, out a1_575, out a2_576, out a3_577, out a4_578, out a5_579);
		word32 a4_583;
		word32 a5_584;
		word32 a1_580;
		word32 a2_581;
		word32 a3_582;
		Eq_2 a0_57 = atoi(a3->t000C, out a1_580, out a2_581, out a3_582, out a4_583, out a5_584);
		Eq_2 s3_158 = a0_40;
		Eq_2 s1_154 = a0_57;
		word32 a3_587;
		word32 a4_588;
		word32 a5_589;
		word32 a2_586;
		word32 a1_585;
		Eq_2 a0_74 = atoi(a3->t0010, out a1_585, out a2_586, out a3_587, out a4_588, out a5_589);
		if (a0_23 >= 0x00 && (a0_40 >= 0x00 && (a0_57 >= 0x00 && a0_74 >= 0x00)))
		{
			if ((word32) g_b420266B4 <= 0x02 && (word32) g_b420266B8 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_629;
					xTaskGetTickCountFromISR(out a5_629);
				}
				else
				{
					word32 a5_628;
					xTaskGetTickCount(out a5_628);
				}
				word32 a0_630;
				word32 a1_631;
				word32 a2_632;
				word32 a3_633;
				word32 a4_634;
				word32 a5_635;
				word32 s2_636;
				word32 s4_637;
				word32 s5_638;
				word32 s6_639;
				word32 s7_640;
				word32 s8_641;
				word32 s9_642;
				word32 s10_643;
				word32 s11_644;
				bl_printk(ra, &g_t230C1938, 587995532, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_154, out a0_630, out a1_631, out a2_632, out a3_633, out a4_634, out a5_635, out s2_636, out s3_158, out s4_637, out s5_638, out s6_639, out s7_640, out s8_641, out s9_642, out s10_643, out s11_644);
			}
			word32 a1_170 = (word32) (s1_154 != 0x00);
			if (s3_158 == 0x00)
			{
				0x00 = dwArg0128;
				bl_gpio_enable_output(a1_170, dwArg0100);
				return;
			}
			else
			{
				0x00 = dwArg0128;
				bl_gpio_enable_input(a1_170, dwArg0100);
				return;
			}
		}
		if ((word32) g_b420266B4 <= 0x04 && (word32) g_b420266B8 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_610;
				xTaskGetTickCountFromISR(out a5_610);
			}
			else
			{
				word32 a5_609;
				xTaskGetTickCount(out a5_609);
			}
			0x00 = dwArg0128;
			word32 s1_611;
			word32 a1_613;
			word32 a0_612;
			word32 a4_616;
			word32 a2_614;
			word32 s2_618;
			word32 a3_615;
			word32 a5_617;
			word32 s3_619;
			word32 s4_620;
			word32 s5_621;
			word32 s7_623;
			word32 s6_622;
			word32 s8_624;
			word32 s9_625;
			word32 s10_626;
			word32 s11_627;
			bl_printk(ra, &g_t230C1A54, 587995532, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_611, out a0_612, out a1_613, out a2_614, out a3_615, out a4_616, out a5_617, out s2_618, out s3_619, out s4_620, out s5_621, out s6_622, out s7_623, out s8_624, out s9_625, out s10_626, out s11_627);
			return;
		}
	}
	0x00 = dwArg0128;
}

// 23066130: void bl_gpio_cli_init()
// Called from:
//      aos_loop_proc
void bl_gpio_cli_init()
{
}

// 23066134: Register Eq_2 bl_efuse_read_mac(Register Eq_2 ra, Register (ptr32 Eq_122719) s0, Register Eq_2 s1, Register ptr32 a0, Register Eq_2 s2, Register word32 s3, Register word32 s4, Register out (ptr32 Eq_122725) s0Out, Register out ptr32 s1Out, Register out Eq_122727 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      wifi_mgmr_ap_mac_get
//      hal_board_cfg
Eq_2 bl_efuse_read_mac(Eq_2 ra, struct Eq_122719 * s0, Eq_2 s1, ptr32 a0, Eq_2 s2, word32 s3, word32 s4, struct Eq_122725 & s0Out, ptr32 & s1Out, union Eq_122727 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	struct Eq_122725 * s0_19;
	ptr32 s1_20;
	Eq_122727 s2_21;
	ptr32 s3_22;
	ptr32 s4_23;
	Eq_2 ra_18 = EF_Ctrl_Read_MAC_Address(ra, s0, s1, a0, s2, s3, s4, out s0_19, out s1_20, out s2_21, out s3_22, out s4_23);
	s0Out = s0_19;
	s1Out = s1_20;
	s2Out = s2_21;
	s3Out = s3_22;
	s4Out = s4_23;
	return ra_18;
}

