pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23066144: Register Eq_2 bl_efuse_read_mac_factory(Register Eq_2 ra, Register (ptr32 Eq_122719) s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register (ptr32 word32) a4, Register Eq_2 s2, Register word32 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_369523) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_369527 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      hal_board_cfg
Eq_2 bl_efuse_read_mac_factory(Eq_2 ra, struct Eq_122719 * s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, word32 * a4, Eq_2 s2, word32 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg9C, struct Eq_369523 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_369527 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a0_16;
	ptr32 a3_19;
	struct Eq_369523 * s0_25;
	ptr32 s1_26;
	ptr32 s10_27;
	ptr32 s11_28;
	Eq_369527 s2_29;
	ptr32 s3_30;
	ptr32 s4_31;
	ptr32 s5_32;
	ptr32 s6_33;
	ptr32 s7_34;
	ptr32 mstatus_40;
	Eq_2 ra_24 = mfg_media_read_macaddr(ra, s0, s1, a0, 0x01, a3, a4, s2, s3, s4, mstatus, dwLoc08, dwArg08, dwArg28, dwArg40, dwArg44, dwArg50, dwArg54, dwArg68, dwArg78, dwArg8C, dwArg9C, out s0_25, out s1_26, out a0_16, out a3_19, out s2_29, out s3_30, out s4_31, out s5_32, out s6_33, out s7_34, out s10_27, out s11_28, out mstatus_40);
	s0Out = s0_25;
	s1Out = s1_26;
	a0Out = 0x00 - (word32) (a0_16 != 0x00);
	a3Out = a3_19;
	s2Out = s2_29;
	s3Out = s3_30;
	s4Out = s4_31;
	s5Out = s5_32;
	s6Out = s6_33;
	s7Out = s7_34;
	s10Out = s10_27;
	s11Out = s11_28;
	mstatusOut = mstatus_40;
	return ra_24;
}

// 2306615C: Register Eq_2 bl_efuse_read_capcode(Register Eq_2 ra, Register (ptr32 Eq_369609) s0, Register Eq_2 s1, Register (ptr32 byte) a0, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_479606)) a4, Register int32 s2, Register (ptr32 Eq_369615) s3, Register ptr32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Register out (ptr32 Eq_369623) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      hal_board_cfg
Eq_2 bl_efuse_read_capcode(Eq_2 ra, struct Eq_369609 * s0, Eq_2 s1, byte * a0, Eq_2 a3, struct Eq_479606 ** a4, int32 s2, struct Eq_369615 * s3, ptr32 s4, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, struct Eq_369623 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a0_16;
	ptr32 a3_19;
	struct Eq_369623 * s0_25;
	ptr32 s1_26;
	ptr32 s10_27;
	ptr32 s11_28;
	ptr32 s2_29;
	ptr32 s3_30;
	ptr32 s4_31;
	ptr32 s5_32;
	ptr32 s6_33;
	ptr32 s7_34;
	ptr32 s8_35;
	ptr32 mstatus_40;
	Eq_2 ra_24 = mfg_media_read_xtal_capcode(ra, s0, s1, a0, 0x01, a3, a4, s2, s3, s4, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg68, dwArg8C, out s0_25, out s1_26, out a0_16, out a3_19, out s2_29, out s3_30, out s4_31, out s5_32, out s6_33, out s7_34, out s8_35, out s10_27, out s11_28, out mstatus_40);
	s0Out = s0_25;
	s1Out = s1_26;
	a0Out = 0x00 - (word32) (a0_16 != 0x00);
	a3Out = a3_19;
	s2Out = s2_29;
	s3Out = s3_30;
	s4Out = s4_31;
	s5Out = s5_32;
	s6Out = s6_33;
	s7Out = s7_34;
	s8Out = s8_35;
	s10Out = s10_27;
	s11Out = s11_28;
	mstatusOut = mstatus_40;
	return ra_24;
}

// 23066174: Register Eq_2 bl_efuse_read_pwroft(Register Eq_2 ra, Register (ptr32 Eq_369708) s0, Register Eq_2 s1, Register ptr32 a0, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_479606)) a4, Register (ptr32 byte) s2, Register Eq_2 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_369723) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      hal_board_cfg
Eq_2 bl_efuse_read_pwroft(Eq_2 ra, struct Eq_369708 * s0, Eq_2 s1, ptr32 a0, Eq_2 a3, struct Eq_479606 ** a4, byte * s2, Eq_2 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0118, struct Eq_369723 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	word32 a0_16;
	ptr32 a3_19;
	struct Eq_369723 * s0_25;
	ptr32 s1_26;
	ptr32 s2_29;
	ptr32 s4_31;
	ptr32 s5_32;
	ptr32 s6_33;
	ptr32 s7_34;
	ptr32 s8_35;
	ptr32 s9_36;
	ptr32 mstatus_42;
	Eq_2 ra_24 = mfg_media_read_poweroffset(ra, s0, s1, a0, 0x01, a3, a4, s2, s3, s4, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0118, out s0_25, out s1_26, out a0_16, out a3_19, out s2_29, out s4_31, out s5_32, out s6_33, out s7_34, out s8_35, out s9_36, out mstatus_42);
	s0Out = s0_25;
	s1Out = s1_26;
	a0Out = 0x00 - (word32) (a0_16 != 0x00);
	a3Out = a3_19;
	s2Out = s2_29;
	s4Out = s4_31;
	s5Out = s5_32;
	s6Out = s6_33;
	s7Out = s7_34;
	s8Out = s8_35;
	s9Out = s9_36;
	mstatusOut = mstatus_42;
	return ra_24;
}

// 2306618C: void bl_wifi_clock_enable(Register (ptr32 Eq_2) a4)
// Called from:
//      bl606a0_wifi_init
void bl_wifi_clock_enable(union Eq_2 * a4)
{
	Eq_2 a5_6 = *a4;
	if (a4 == null)
		*(union Eq_2 *) 0x01 = a5_6;
}

// 230661A0: Register Eq_2 bl_wifi_enable_irq(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_wifi_enable_irq(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out)
{
	Eq_2 s1_21;
	Eq_2 s2_24;
	ptr32 a3_41;
	ptr32 s3_52;
	word32 s0_102;
	word32 a3_103;
	word32 s3_104;
	word32 s0_105;
	word32 s1_106;
	word32 s2_107;
	Eq_2 ra_46 = bl_irq_register(bl_irq_register(ra, s1, 70, 587231578, s2, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s0_102, out s1_21, out a3_103, out s2_24, out s3_104), s1_21, 79, 0x230071AA, s2_24, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s0_105, out s1_106, out a3_41, out s2_107, out s3_52);
	bl_irq_enable((struct Eq_127708 *) 70);
	bl_irq_enable((struct Eq_127708 *) 79);
	ptr32 a5_72;
	ptr32 a4_75;
	word32 a0_108;
	word32 a1_109;
	word32 a2_110;
	word32 s4_111;
	word32 s8_112;
	puts(587995972, out a0_108, out a1_109, out a2_110, out a4_75, out a5_72, out s4_111, out s8_112);
	a3Out = a3_41;
	a4Out = a4_75;
	a5Out = a5_72;
	s3Out = s3_52;
	return ra_46;
}

