pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 230661E8: void bl_wifi_sta_mac_addr_set(Register Eq_2 a0)
// Called from:
//      hal_board_cfg
void bl_wifi_sta_mac_addr_set(Eq_2 a0)
{
	word32 a1_29;
	word32 a2_30;
	word32 a3_31;
	word32 a4_32;
	word32 a5_33;
	word32 a6_34;
	word32 a7_35;
	memcpy(0x420266BC, a0, 0x06, out a1_29, out a2_30, out a3_31, out a4_32, out a5_33, out a6_34, out a7_35);
}

// 23066204: void bl_wifi_ap_mac_addr_set(Register Eq_2 a0)
// Called from:
//      hal_board_cfg
void bl_wifi_ap_mac_addr_set(Eq_2 a0)
{
	word32 a1_29;
	word32 a2_30;
	word32 a3_31;
	word32 a4_32;
	word32 a5_33;
	word32 a6_34;
	word32 a7_35;
	memcpy(0x420266C8, a0, 0x06, out a1_29, out a2_30, out a3_31, out a4_32, out a5_33, out a6_34, out a7_35);
}

// 23066220: void bl_wifi_mac_addr_get(Register Eq_2 a0)
// Called from:
//      cmd_wifi_ap_start
//      wifi_mgmr_sta_enable
//      wifi_mgmr_ap_enable
//      bl606a0_wifi_init
//      bdaddr_init
void bl_wifi_mac_addr_get(Eq_2 a0)
{
	word32 a1_28;
	word32 a2_29;
	word32 a3_30;
	word32 a4_31;
	word32 a5_32;
	word32 a6_33;
	word32 a7_34;
	memcpy(a0, 0x420266BC, 0x06, out a1_28, out a2_29, out a3_30, out a4_31, out a5_32, out a6_33, out a7_34);
}

// 2306623A: Register word32 bl_wifi_country_code_set(Register ui32 a0)
// Called from:
//      hal_board_cfg
word32 bl_wifi_country_code_set(ui32 a0)
{
	g_b420266D4 = (byte) a0;
	return 0x42026000;
}

// 23066246: Register Eq_2 bl_wifi_ap_info_set(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 s2Out)
// Called from:
//      hal_board_cfg
Eq_2 bl_wifi_ap_info_set(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & s2Out)
{
	word32 t1_99;
	word32 a0_100;
	word32 a1_101;
	word32 a2_102;
	word32 a3_103;
	word32 a4_104;
	word32 a5_105;
	Eq_2 ra_34 = memset(ra, 0x420266D5, 0x00, 99, out t1_99, out a0_100, out a1_101, out a2_102, out a3_103, out a4_104, out a5_105);
	Eq_2 a3_45;
	word32 a1_106;
	word32 a2_107;
	word32 a4_108;
	word32 a5_109;
	word32 a6_110;
	word32 a7_111;
	memcpy(0x420266D5, a0, a1, out a1_106, out a2_107, out a3_45, out a4_108, out a5_109, out a6_110, out a7_111);
	word32 a4_58;
	word32 a1_112;
	word32 a2_113;
	word32 a3_114;
	word32 a5_115;
	word32 a6_116;
	word32 a7_117;
	memcpy(0x420266F6, a2, a3_45, out a1_112, out a2_113, out a3_114, out a4_58, out a5_115, out a6_116, out a7_117);
	g_b42026737 = (byte) a4_58;
	g_b42026738 = 0x01;
	0x00 = (int8) dwArg0128;
	s1Out = a2;
	s2Out = a0;
	return ra_34;
}

// 230662B0: Register Eq_2 bl_wifi_sta_info_set(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 s2Out)
// Called from:
//      hal_board_cfg
Eq_2 bl_wifi_sta_info_set(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & s2Out)
{
	word32 t1_96;
	word32 a0_97;
	word32 a1_98;
	word32 a2_99;
	word32 a3_100;
	word32 a4_101;
	word32 a5_102;
	Eq_2 ra_34 = memset(ra, 1107453753, 0x00, 99, out t1_96, out a0_97, out a1_98, out a2_99, out a3_100, out a4_101, out a5_102);
	Eq_2 a3_45;
	word32 a1_103;
	word32 a2_104;
	word32 a4_105;
	word32 a5_106;
	word32 a6_107;
	word32 a7_108;
	memcpy(1107453753, a0, a1, out a1_103, out a2_104, out a3_45, out a4_105, out a5_106, out a6_107, out a7_108);
	word32 a4_58;
	word32 a1_109;
	word32 a2_110;
	word32 a3_111;
	word32 a5_112;
	word32 a6_113;
	word32 a7_114;
	memcpy(0x4202675A, a2, a3_45, out a1_109, out a2_110, out a3_111, out a4_58, out a5_112, out a6_113, out a7_114);
	g_b4202679C = (byte) a4_58;
	0x00 = (int8) dwArg0128;
	s1Out = a2;
	s2Out = a0;
	return ra_34;
}

// 23066310: void cmd_timer_start(Register Eq_2 ra, Stack word32 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C)
void cmd_timer_start(Eq_2 ra, word32 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C)
{
	bl_timer_tick_enable(ra, dwArg08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg40, dwArg44, dwArg48, dwArg5C, dwArg68, dwArg6C, dwArg8C);
}

// 23066314: void cmd_wdt_disable()
void cmd_wdt_disable()
{
	bl_wdt_disable();
}

// 23066318: void cmd_wdt_feed()
void cmd_wdt_feed()
{
	bl_wdt_feed();
}

// 2306631C: void cmd_wdt_init(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgBC)
void cmd_wdt_init(Eq_2 ra, Eq_2 a0, word32 a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgBC)
{
	if (a2 == 0x02)
	{
		word32 a5_232;
		word32 a4_231;
		word32 a3_230;
		word32 a2_229;
		word32 a1_228;
		Eq_2 a0_23 = atoi(a0, out a1_228, out a2_229, out a3_230, out a4_231, out a5_232);
		if (g_t4200F560 != 0x00)
		{
			word32 a5_253;
			xTaskGetTickCountFromISR(out a5_253);
		}
		else
		{
			word32 a5_252;
			xTaskGetTickCount(out a5_252);
		}
		word32 s1_254;
		word32 a0_255;
		word32 a1_256;
		word32 a2_257;
		word32 a3_258;
		word32 a4_259;
		word32 a5_260;
		word32 s2_261;
		word32 s3_262;
		word32 s4_263;
		word32 s5_264;
		word32 s6_265;
		word32 s7_266;
		word32 s8_267;
		word32 s9_268;
		word32 s10_269;
		word32 s11_270;
		bl_printk(ra, &g_t230C1B8C, 587995992, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_254, out a0_255, out a1_256, out a2_257, out a3_258, out a4_259, out a5_260, out s2_261, out s3_262, out s4_263, out s5_264, out s6_265, out s7_266, out s8_267, out s9_268, out s10_269, out s11_270);
		if (a0_23 <= 0x00)
			return;
		bl_wdt_init(a0_23);
	}
	else
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_234;
			xTaskGetTickCountFromISR(out a5_234);
		}
		else
		{
			word32 a5_233;
			xTaskGetTickCount(out a5_233);
		}
		word32 s1_235;
		word32 a0_236;
		word32 a1_237;
		word32 a2_238;
		word32 a3_239;
		word32 a4_240;
		word32 a5_241;
		word32 s2_242;
		word32 s3_243;
		word32 s4_244;
		word32 s5_245;
		word32 s6_246;
		word32 s7_247;
		word32 s8_248;
		word32 s9_249;
		word32 s10_250;
		word32 s11_251;
		bl_printk(ra, &g_t230C1B68, 587995992, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_235, out a0_236, out a1_237, out a2_238, out a3_239, out a4_240, out a5_241, out s2_242, out s3_243, out s4_244, out s5_245, out s6_246, out s7_247, out s8_248, out s9_249, out s10_250, out s11_251);
	}
}

// 230663CC: void bl_wdt_cli_init()
// Called from:
//      aos_loop_proc
void bl_wdt_cli_init()
{
}

