pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23067530: Register Eq_2 _dump_partition(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s6, Stack word32 dwArg1C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0128, Register out Eq_373536 s2Out)
// Called from:
//      hal_boot2_dump
//      hal_boot2_init
Eq_2 _dump_partition(Eq_2 ra, Eq_2 a3, Eq_2 s6, word32 dwArg1C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0128, union Eq_373536 & s2Out)
{
	Eq_2 a3_39;
	Eq_2 a3_64;
	Eq_2 a3_89;
	Eq_2 a3_114;
	Eq_2 a3_139;
	Eq_2 a3_164;
	word32 s1_193;
	word32 a5_540;
	word32 a4_539;
	word32 a2_538;
	word32 a1_537;
	word32 a0_536;
	word32 s1_535;
	word32 s2_541;
	word32 s3_542;
	word32 s4_543;
	word32 s5_544;
	word32 s6_545;
	word32 s7_546;
	word32 s8_547;
	word32 s9_548;
	word32 s10_549;
	word32 s11_550;
	word32 s1_551;
	word32 a0_552;
	word32 a1_553;
	word32 a2_554;
	word32 a4_555;
	word32 a5_556;
	word32 s2_557;
	word32 s3_558;
	word32 s4_559;
	word32 s5_560;
	word32 s6_561;
	word32 s7_562;
	word32 s8_563;
	word32 s9_564;
	word32 s10_565;
	word32 s11_566;
	word32 s1_567;
	word32 a0_568;
	word32 a1_569;
	word32 a2_570;
	word32 a4_571;
	word32 a5_572;
	word32 s2_573;
	word32 s3_574;
	word32 s4_575;
	word32 s5_576;
	word32 s6_577;
	word32 s7_578;
	word32 s8_579;
	word32 s9_580;
	word32 s10_581;
	word32 s11_582;
	word32 s1_583;
	word32 a0_584;
	word32 a1_585;
	word32 a2_586;
	word32 a4_587;
	word32 a5_588;
	word32 s2_589;
	word32 s3_590;
	word32 s4_591;
	word32 s5_592;
	word32 s6_593;
	word32 s7_594;
	word32 s8_595;
	word32 s9_596;
	word32 s10_597;
	word32 s11_598;
	word32 s1_599;
	word32 a0_600;
	word32 a1_601;
	word32 a2_602;
	word32 a4_603;
	word32 a5_604;
	word32 s2_605;
	word32 s3_606;
	word32 s4_607;
	word32 s5_608;
	word32 s6_609;
	word32 s7_610;
	word32 s8_611;
	word32 s9_612;
	word32 s10_613;
	word32 s11_614;
	word32 s1_615;
	word32 a0_616;
	word32 a1_617;
	word32 a2_618;
	word32 a4_619;
	word32 a5_620;
	word32 s2_621;
	word32 s3_622;
	word32 s4_623;
	word32 s5_624;
	word32 s6_625;
	word32 s7_626;
	word32 s8_627;
	word32 s9_628;
	word32 s10_629;
	word32 s11_630;
	word32 a0_631;
	word32 a1_632;
	word32 a2_633;
	word32 a4_634;
	word32 a5_635;
	word32 s2_636;
	word32 s3_637;
	word32 s4_638;
	word32 s5_639;
	word32 s6_640;
	word32 s7_641;
	word32 s8_642;
	word32 s9_643;
	word32 s10_644;
	word32 s11_645;
	Eq_2 a3_189;
	Eq_2 ra_192 = bl_printk(bl_printk(bl_printk(bl_printk(bl_printk(bl_printk(bl_printk(ra, &g_t230C2258, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_535, out a0_536, out a1_537, out a2_538, out a3_39, out a4_539, out a5_540, out s2_541, out s3_542, out s4_543, out s5_544, out s6_545, out s7_546, out s8_547, out s9_548, out s10_549, out s11_550), &g_t230C227C, a3_39, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_551, out a0_552, out a1_553, out a2_554, out a3_64, out a4_555, out a5_556, out s2_557, out s3_558, out s4_559, out s5_560, out s6_561, out s7_562, out s8_563, out s9_564, out s10_565, out s11_566), &g_t230C2290, a3_64, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_567, out a0_568, out a1_569, out a2_570, out a3_89, out a4_571, out a5_572, out s2_573, out s3_574, out s4_575, out s5_576, out s6_577, out s7_578, out s8_579, out s9_580, out s10_581, out s11_582), &g_t230C22A4, a3_89, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_583, out a0_584, out a1_585, out a2_586, out a3_114, out a4_587, out a5_588, out s2_589, out s3_590, out s4_591, out s5_592, out s6_593, out s7_594, out s8_595, out s9_596, out s10_597, out s11_598), &g_t230C22B4, a3_114, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_599, out a0_600, out a1_601, out a2_602, out a3_139, out a4_603, out a5_604, out s2_605, out s3_606, out s4_607, out s5_608, out s6_609, out s7_610, out s8_611, out s9_612, out s10_613, out s11_614), &g_t230C22C0, a3_139, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_615, out a0_616, out a1_617, out a2_618, out a3_164, out a4_619, out a5_620, out s2_621, out s3_622, out s4_623, out s5_624, out s6_625, out s7_626, out s8_627, out s9_628, out s10_629, out s11_630), &g_t230C22D0, a3_164, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_193, out a0_631, out a1_632, out a2_633, out a3_189, out a4_634, out a5_635, out s2_636, out s3_637, out s4_638, out s5_639, out s6_640, out s7_641, out s8_642, out s9_643, out s10_644, out s11_645);
	Eq_373536 s2_206 = 0x00;
	struct Eq_373800 * s1_207 = s1_193 + -88;
	word32 s5_208 = 0x230C2000;
	while (s2_206 < (word32) s1_207->w000A)
	{
		Eq_2 a3_232;
		word32 s6_243;
		Eq_2 a3_257;
		word32 s7_269;
		Eq_2 a3_281;
		word32 s8_294;
		Eq_2 a3_305;
		word32 s9_319;
		Eq_2 a3_329;
		word32 s4_338;
		Eq_2 a3_353;
		word32 s4_362;
		Eq_2 a3_378;
		word32 s4_387;
		Eq_2 a3_402;
		word32 s4_411;
		Eq_2 a3_426;
		word32 s10_431;
		word32 s1_646;
		word32 a0_647;
		word32 a1_648;
		word32 a2_649;
		word32 a4_650;
		word32 a5_651;
		word32 s2_652;
		word32 s3_653;
		word32 s4_654;
		word32 s5_655;
		word32 s7_656;
		word32 s8_657;
		word32 s9_658;
		word32 s10_659;
		word32 s11_660;
		word32 s1_661;
		word32 a0_662;
		word32 a1_663;
		word32 a2_664;
		word32 a4_665;
		word32 a5_666;
		word32 s2_667;
		word32 s3_668;
		word32 s4_669;
		word32 s5_670;
		word32 s6_671;
		word32 s8_672;
		word32 s9_673;
		word32 s10_674;
		word32 s11_675;
		word32 s1_676;
		word32 a0_677;
		word32 a1_678;
		word32 a2_679;
		word32 a4_680;
		word32 a5_681;
		word32 s2_682;
		word32 s3_683;
		word32 s4_684;
		word32 s5_685;
		word32 s6_686;
		word32 s7_687;
		word32 s9_688;
		word32 s10_689;
		word32 s11_690;
		word32 s1_691;
		word32 a0_692;
		word32 a1_693;
		word32 a2_694;
		word32 a4_695;
		word32 a5_696;
		word32 s2_697;
		word32 s3_698;
		word32 s4_699;
		word32 s5_700;
		word32 s6_701;
		word32 s7_702;
		word32 s8_703;
		word32 s10_704;
		word32 s11_705;
		word32 s1_706;
		word32 a0_707;
		word32 a1_708;
		word32 a2_709;
		word32 a4_710;
		word32 a5_711;
		word32 s2_712;
		word32 s3_713;
		word32 s5_714;
		word32 s6_715;
		word32 s7_716;
		word32 s8_717;
		word32 s9_718;
		word32 s10_719;
		word32 s11_720;
		word32 s1_721;
		word32 a0_722;
		word32 a1_723;
		word32 a2_724;
		word32 a4_725;
		word32 a5_726;
		word32 s2_727;
		word32 s3_728;
		word32 s5_729;
		word32 s6_730;
		word32 s7_731;
		word32 s8_732;
		word32 s9_733;
		word32 s10_734;
		word32 s11_735;
		word32 s1_736;
		word32 a0_737;
		word32 a1_738;
		word32 a2_739;
		word32 a4_740;
		word32 a5_741;
		word32 s2_742;
		word32 s3_743;
		word32 s5_744;
		word32 s6_745;
		word32 s7_746;
		word32 s8_747;
		word32 s9_748;
		word32 s10_749;
		word32 s11_750;
		word32 s1_751;
		word32 a0_752;
		word32 a1_753;
		word32 a2_754;
		word32 a4_755;
		word32 a5_756;
		word32 s2_757;
		word32 s3_758;
		word32 s5_759;
		word32 s6_760;
		word32 s7_761;
		word32 s8_762;
		word32 s9_763;
		word32 s10_764;
		word32 s11_765;
		word32 s1_766;
		word32 a0_767;
		word32 a1_768;
		word32 a2_769;
		word32 a4_770;
		word32 a5_771;
		word32 s2_772;
		word32 s3_773;
		word32 s4_774;
		word32 s5_775;
		word32 s6_776;
		word32 s7_777;
		word32 s8_778;
		word32 s9_779;
		word32 s11_780;
		word32 a0_781;
		word32 a1_782;
		word32 a2_783;
		word32 a4_784;
		word32 a5_785;
		word32 s3_786;
		word32 s4_787;
		word32 s6_788;
		word32 s7_789;
		word32 s8_790;
		word32 s9_791;
		word32 s10_792;
		word32 s11_793;
		ra_192 = bl_printk(bl_printk(bl_printk(bl_printk(bl_printk(bl_printk(bl_printk(bl_printk(bl_printk(bl_printk(ra_192, s5_208 + 0x0330, a3_189, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_646, out a0_647, out a1_648, out a2_649, out a3_232, out a4_650, out a5_651, out s2_652, out s3_653, out s4_654, out s5_655, out s6_243, out s7_656, out s8_657, out s9_658, out s10_659, out s11_660), s6_243 + 0x0338, a3_232, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_661, out a0_662, out a1_663, out a2_664, out a3_257, out a4_665, out a5_666, out s2_667, out s3_668, out s4_669, out s5_670, out s6_671, out s7_269, out s8_672, out s9_673, out s10_674, out s11_675), s7_269 + 0x0344, a3_257, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_676, out a0_677, out a1_678, out a2_679, out a3_281, out a4_680, out a5_681, out s2_682, out s3_683, out s4_684, out s5_685, out s6_686, out s7_687, out s8_294, out s9_688, out s10_689, out s11_690), s8_294 + 832, a3_281, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_691, out a0_692, out a1_693, out a2_694, out a3_305, out a4_695, out a5_696, out s2_697, out s3_698, out s4_699, out s5_700, out s6_701, out s7_702, out s8_703, out s9_319, out s10_704, out s11_705), s9_319 + 844, a3_305, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_706, out a0_707, out a1_708, out a2_709, out a3_329, out a4_710, out a5_711, out s2_712, out s3_713, out s4_338, out s5_714, out s6_715, out s7_716, out s8_717, out s9_718, out s10_719, out s11_720), s4_338 + 856, a3_329, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_721, out a0_722, out a1_723, out a2_724, out a3_353, out a4_725, out a5_726, out s2_727, out s3_728, out s4_362, out s5_729, out s6_730, out s7_731, out s8_732, out s9_733, out s10_734, out s11_735), s4_362 + 856, a3_353, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_736, out a0_737, out a1_738, out a2_739, out a3_378, out a4_740, out a5_741, out s2_742, out s3_743, out s4_387, out s5_744, out s6_745, out s7_746, out s8_747, out s9_748, out s10_749, out s11_750), s4_387 + 856, a3_378, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_751, out a0_752, out a1_753, out a2_754, out a3_402, out a4_755, out a5_756, out s2_757, out s3_758, out s4_411, out s5_759, out s6_760, out s7_761, out s8_762, out s9_763, out s10_764, out s11_765), s4_411 + 856, a3_402, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_766, out a0_767, out a1_768, out a2_769, out a3_426, out a4_770, out a5_771, out s2_772, out s3_773, out s4_774, out s5_775, out s6_776, out s7_777, out s8_778, out s9_779, out s10_431, out s11_780), s10_431 + 864, a3_426, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_207, out a0_781, out a1_782, out a2_783, out a3_189, out a4_784, out a5_785, out s2_206, out s3_786, out s4_787, out s5_208, out s6_788, out s7_789, out s8_790, out s9_791, out s10_792, out s11_793);
	}
	0x00 = (int8) dwArg0128;
	0x00 = dwArg1C;
	s2Out = s2_206;
	return ra_192;
}

// 2306767C: void hal_boot2_update_ptable(Register Eq_2 a0)
// Called from:
//      ota_tcp_cmd
void hal_boot2_update_ptable(Eq_2 a0)
{
	struct Eq_374188 * a5_10 = (word32) ((word32) *((word32) a0 + 2) < 1);
	*((word32) a0 + 2) = (byte) a5_10;
	Eq_2 a0_12 = a5_10->t0020;
	Eq_374204 a1_13 = (word32) g_b4200EFA8;
	a5_10->t0021 = a0_12;
	PtTable_Update_Entry((word32) (a1_13 < 1), 0x4200EFAC, a0_12);
}

// 230676B2: Register word32 hal_boot2_get_flash_addr(Register out ptr32 a5Out)
// Called from:
//      bl602_start
word32 hal_boot2_get_flash_addr(ptr32 & a5Out)
{
	word32 a5_5 = (word32) g_w4200EFB2;
	a5Out = a5_5 + 36;
	return a5_5 + 0x42049C3C;
}

// 230676CE: Register word32 hal_boot2_partition_bus_addr(Register Eq_2 a0, Register (ptr32 Eq_374388) a1, Register (ptr32 Eq_374398) a2, Register (ptr32 (ptr32 Eq_374235)) a3, Register (ptr32 Eq_374235) a4, Register (ptr32 Eq_374235) a5, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out Eq_374239 a0Out, Register out (ptr32 (ptr32 Eq_374235)) a3Out, Register out (ptr32 Eq_374235) a4Out, Register out (ptr32 Eq_374235) a5Out, Register out (ptr32 Eq_374398) s2Out, Register out (ptr32 Eq_374388) s3Out, Register out ptr32 s6Out)
// Called from:
//      hal_boot2_partition_bus_addr_active
//      hal_boot2_partition_bus_addr_inactive
word32 hal_boot2_partition_bus_addr(Eq_2 a0, union Eq_374388 * a1, union Eq_374398 * a2, struct Eq_374235 ** a3, struct Eq_374235 * a4, struct Eq_374235 * a5, Eq_2 dwArg0128, ptr32 & s1Out, union Eq_374239 & a0Out, struct Eq_374235 & a3Out, struct Eq_374235 & a4Out, struct Eq_374235 & a5Out, union Eq_374398 & s2Out, union Eq_374388 & s3Out, ptr32 & s6Out)
{
	if (g_dw4200EFAC != 0x54504642)
	{
		s1Out = s1;
		a0Out.u0 = ~0x04;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s6Out = s6;
		return s0;
	}
	ptr32 s6_111 = 0x4200EFA8;
	word32 s4_47 = 0x4200EFBF;
	struct Eq_374235 * s0_48 = null;
	a4_106 = a4;
	a3_105 = a3;
	while (true)
	{
		struct Eq_374235 * a4_106;
		struct Eq_374235 ** a3_105;
		if (s0_48 >= (word32) g_w4200EFB2)
			break;
		s4_47 += 36;
		word32 a2_402;
		word32 a5_403;
		word32 a1_401;
		if (strcmp(s4_47 + 0, a0, out a1_401, out a2_402, out a3_105, out a4_106, out a5_403) == 0x00)
			break;
		s0_48 = (struct Eq_374235 *) ((char *) &s0_48->ptr0000 + 1);
	}
	struct Eq_374235 * a5_115 = (word32) g_w4200EFB2;
	Eq_374239 a0_116 = ~0x01;
	if (s0_48 != a5_115)
	{
		struct Eq_374288 * a2_74 = &s0_48->ptr0024;
		a4_106 = (word32) a2_74->b4200EFBE;
		struct Eq_374235 * s5_79 = a2_74->ptr4200EFC8;
		struct Eq_374235 * s4_80 = a2_74->ptr4200EFCC;
		a5->ptr0000 = a4_106;
		*a3 = (struct Eq_374235 **) a4_106;
		a4->ptr0000 = (struct Eq_374235 *) 36;
		struct Eq_374235 * s0_112 = null;
		while (s0_112 < (word32) g_w4200EFB2)
		{
			s6_111 += 36;
			word32 a1_404;
			word32 a5_406;
			word32 a2_405;
			if (strcmp(s6_111 + 23, 0x230BEF20, out a1_404, out a2_405, out a3_105, out a4_106, out a5_406) == 0x00)
				break;
			s0_112 = (struct Eq_374235 *) ((char *) &s0_112->ptr0000 + 1);
		}
		a5_115 = (word32) g_w4200EFB2;
		a0_116.u0 = -72;
		if (s0_112 == a5_115)
			goto l2306773A;
		if (s5_79 != null)
		{
			a0_116.u0 = ~0x15;
			a5_115 = a4_106->ptr0020;
			if (s5_79 < a4_106)
				goto l2306773A;
			a5_115 = a5_115->ptr0024;
			if (s5_79 < a5_115)
				goto l2306773A;
		}
		if (s4_80 != null)
		{
			a0_116.u0 = ~0x15;
			a5_115 = a4_106->ptr0020;
			if (s4_80 < a4_106)
				goto l2306773A;
			a5_115 = a5_115->ptr0024;
			if (s4_80 < a5_115)
				goto l2306773A;
		}
		struct Eq_374355 * a4_140 = &s0_112->ptr0024;
		a3_105 = (struct Eq_374235 **) 0x01;
		a0_116.u0 = ~0x0D;
		a4_106 = (struct Eq_374235 *) ((char *) a4_140 + 1107357608);
		a5_115 = (word32) a4_140->b4200EFBE;
		if (a5_115 <= (struct Eq_374235 *) 0x01)
		{
			Mem169[a1 + 0x00:word32] = s5_79 + 0x22FFF000 - 0x4200EFB8[((a5_115 + (s0_112 + 0x09)) + 0x04) * 0x04];
			a5_115 = (word32) a4_140->b4200EFBE;
			*a2 = (union Eq_374398 *) ((char *) &s4_80->ptr0024 + 0x22FFEFDC - a5_115);
			a3_105 = (struct Eq_374235 **) 0x22FFF000;
			a0_116.u0 = 0x00;
		}
		goto l2306773A;
	}
	else
	{
l2306773A:
		0x00 = (int8) dwArg0128;
		s1Out = 0x4200EFA8;
		a0Out = a0_116;
		a3Out = a3_105;
		a4Out = a4_106;
		a5Out = a5_115;
		s2Out = a2;
		s3Out = a1;
		s6Out = s6_111;
		return s4;
	}
}

// 23067842: Register word32 hal_boot2_partition_bus_addr_active(Register Eq_2 a0, Stack Eq_2 dwArgF8, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out (ptr32 word32) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      hal_board_cfg
//      bl_mtd_open
word32 hal_boot2_partition_bus_addr_active(Eq_2 a0, Eq_2 dwArgF8, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, word32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s6Out)
{
	ptr32 a0_20;
	ptr32 a3_26;
	ptr32 * a4_27;
	word32 * a5_28;
	ptr32 s1_30;
	ptr32 s2_31;
	ptr32 s3_32;
	ptr32 s6_35;
	word32 s0_29 = hal_boot2_partition_bus_addr(a0, fp + -36, fp + -32, fp + -28, fp + -24, fp + -20, dwArgF8, out s1_30, out a0_20, out a3_26, out a4_27, out a5_28, out s2_31, out s3_32, out s6_35);
	if (a0_20 == 0x00)
	{
		*a4_27 = s1_30;
		*a5_28 = s0_29;
	}
	s1Out = s1_30;
	a0Out = a0_20;
	a3Out = a3_26;
	a5Out = a5_28;
	s2Out = s2_31;
	s3Out = s3_32;
	s6Out = s6_35;
	return dwArgE4;
}

