pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306787E: Register word32 hal_boot2_partition_bus_addr_inactive(Register Eq_2 a0, Stack Eq_2 dwArgF8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out (ptr32 word32) a5Out)
// Called from:
//      bl_mtd_open
word32 hal_boot2_partition_bus_addr_inactive(Eq_2 a0, Eq_2 dwArgF8, ptr32 & a0Out, ptr32 & a3Out, word32 & a5Out)
{
	ptr32 a0_20;
	ptr32 a3_26;
	word32 * a4_27;
	word32 * a5_28;
	word32 s1_30;
	word32 s6_144;
	word32 s2_142;
	word32 s3_143;
	word32 s0_29 = hal_boot2_partition_bus_addr(a0, fp + -36, fp + -32, fp + -28, fp + -24, fp + -20, dwArgF8, out s1_30, out a0_20, out a3_26, out a4_27, out a5_28, out s2_142, out s3_143, out s6_144);
	if (a0_20 == 0x00)
	{
		*a4_27 = s1_30;
		*a5_28 = s0_29;
	}
	a0Out = a0_20;
	a3Out = a3_26;
	a5Out = a5_28;
	return s1_30;
}

// 230678BA: Register word32 hal_boot2_partition_addr(Register Eq_2 a0, Register (ptr32 (ptr32 Eq_374519)) a1, Register (ptr32 (ptr32 Eq_374519)) a2, Register (ptr32 (ptr32 Eq_374519)) a3, Register (ptr32 Eq_374519) a4, Register (ptr32 Eq_374520) a5, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 Eq_374519)) a3Out, Register out (ptr32 Eq_374519) a4Out, Register out (ptr32 Eq_374520) a5Out, Register out ptr32 s2Out)
// Called from:
//      hal_boot2_partition_addr_active
//      hal_boot2_partition_addr_inactive
word32 hal_boot2_partition_addr(Eq_2 a0, struct Eq_374519 ** a1, struct Eq_374519 ** a2, struct Eq_374519 ** a3, struct Eq_374519 * a4, struct Eq_374520 * a5, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & a0Out, struct Eq_374519 & a3Out, struct Eq_374519 & a4Out, struct Eq_374520 & a5Out, ptr32 & s2Out)
{
	ptr32 a0_158;
	ptr32 s1_170 = 0x4200F000;
	if (g_dw4200EFAC == 0x54504642)
	{
		s2 = 0x4200EFA8;
		s1_170 = 0x4200EFA8;
		struct Eq_374520 * s0_44 = null;
		while (s0_44 < (word32) g_w4200EFB2)
		{
			s1_170 += 36;
			word32 a1_195;
			word32 a2_196;
			word32 a5_197;
			if (strcmp(s1_170 + 23, a0, out a1_195, out a2_196, out a3, out a4, out a5_197) == 0x00)
				break;
			s0_44 = (struct Eq_374520 *) ((char *) &s0_44->ptr0000 + 1);
		}
		a5 = (word32) g_w4200EFB2;
		a0_158 = ~0x01;
		if (s0_44 != a5)
		{
			*a1 = (struct Eq_374519 **) a4;
			*a2 = (struct Eq_374519 **) a4;
			struct Eq_374570 * a0_83 = a4->ptr0028;
			*a3 = (struct Eq_374519 **) a4;
			a4->dw0000 = 36;
			a5 = (word32) a0_83->b0016;
			a5->ptr0000 = a5;
			a0_158 = 0x00;
		}
	}
	else
		a0_158 = ~0x04;
	0x00 = (int8) dwArg0128;
	s1Out = s1_170;
	a0Out = a0_158;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	return s4;
}

// 23067976: Register word32 hal_boot2_partition_addr_active(Register Eq_2 a0, Stack Eq_2 dwArgF8, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_374601) a5Out, Register out ptr32 s2Out)
// Called from:
//      hal_board_cfg
//      bl_mtd_open
word32 hal_boot2_partition_addr_active(Eq_2 a0, Eq_2 dwArgF8, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, struct Eq_374601 & a5Out, ptr32 & s2Out)
{
	ptr32 a0_20;
	ptr32 s1_25;
	struct Eq_374601 * a5_30;
	ptr32 s2_31;
	ptr32 a3_37;
	ptr32 * a4_38;
	word32 s0_24 = hal_boot2_partition_addr(a0, fp + -36, fp + -32, fp + -28, fp + -24, fp + -20, dwArgF8, out s1_25, out a0_20, out a3_37, out a4_38, out a5_30, out s2_31);
	if (a0_20 == 0x00)
	{
		*a4_38 = s1_25;
		a5_30->dw0000 = s0_24;
	}
	s1Out = s1_25;
	a0Out = a0_20;
	a3Out = a3_37;
	a5Out = a5_30;
	s2Out = s2_31;
	return dwArgE4;
}

// 230679B2: Register Eq_2 hal_boot2_partition_addr_inactive(Register Eq_2 a0, Stack Eq_2 dwArgF8, Register out ptr32 a3Out, Register out (ptr32 Eq_374646) a5Out)
// Called from:
//      bl_mtd_open
Eq_2 hal_boot2_partition_addr_inactive(Eq_2 a0, Eq_2 dwArgF8, ptr32 & a3Out, struct Eq_374646 & a5Out)
{
	Eq_2 a0_20;
	word32 s1_25;
	struct Eq_374646 * a5_30;
	ptr32 a3_37;
	word32 * a4_38;
	word32 s2_137;
	word32 s0_24 = hal_boot2_partition_addr(a0, fp + -36, fp + -32, fp + -28, fp + -24, fp + -20, dwArgF8, out s1_25, out a0_20, out a3_37, out a4_38, out a5_30, out s2_137);
	if (a0_20 == 0x00)
	{
		*a4_38 = s1_25;
		a5_30->dw0000 = s0_24;
	}
	a3Out = a3_37;
	a5Out = a5_30;
	return a0_20;
}

// 230679EE: void hal_boot2_get_active_partition()
// Called from:
//      ota_tcp_cmd
void hal_boot2_get_active_partition()
{
}

// 230679F8: void hal_boot2_get_active_entries(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      ota_tcp_cmd
void hal_boot2_get_active_entries(Eq_2 a0, Eq_2 a1)
{
	PtTable_Get_Active_Entries(&g_dw4200EFAC, a0 & 0x00FF, a1);
}

// 23067A1C: void hal_boot2_dump(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s6, Stack word32 dwArg0C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0118)
// Called from:
//      ota_dump_cmd
void hal_boot2_dump(Eq_2 ra, Eq_2 a3, Eq_2 s6, word32 dwArg0C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg0118)
{
	word32 s2_44;
	_dump_partition(ra, a3, s6, dwArg0C, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out s2_44);
}

// 23067A2C: Register Eq_2 hal_boot2_init(Register Eq_2 ra, Register Eq_2 s6, Stack word32 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      bfl_main
Eq_2 hal_boot2_init(Eq_2 ra, Eq_2 s6, word32 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out)
{
	g_b4200FFA8 = (byte) (word32) *(byte *) 0x42049C00;
	Eq_2 a3_13 = (word32) g_b420266B4;
	if (a3_13 <= 0x02 && (word32) g_b420267A0 <= 0x02)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_179;
			xTaskGetTickCountFromISR(out a5_179);
		}
		else
		{
			word32 a5_178;
			xTaskGetTickCount(out a5_178);
		}
		word32 s11_194;
		word32 s9_192;
		word32 s10_193;
		word32 s7_190;
		word32 s8_191;
		word32 s4_188;
		word32 s5_189;
		word32 s2_186;
		word32 s3_187;
		word32 a4_184;
		word32 a5_185;
		word32 a1_182;
		word32 a2_183;
		word32 s1_180;
		word32 a0_181;
		ra = bl_printk(ra, &g_t230C2374, 587998056, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_180, out a0_181, out a1_182, out a2_183, out a3_13, out a4_184, out a5_185, out s2_186, out s3_187, out s4_188, out s5_189, out s6, out s7_190, out s8_191, out s9_192, out s10_193, out s11_194);
	}
	Eq_2 s2_80;
	ptr32 s4_99;
	ptr32 s8_100;
	ptr32 s1_107;
	ptr32 s10_108;
	ptr32 s2_110;
	ptr32 s6_112;
	ptr32 s9_114;
	Eq_2 ra_106 = bl_flash_config_update(_dump_partition(ra, a3_13, s6, dwArg0C, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out s2_80), s2_80, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_107, out s2_110, out s4_99, out s6_112, out s8_100, out s9_114, out s10_108);
	s1Out = s1_107;
	s2Out = s2_110;
	s4Out = s4_99;
	s6Out = s6_112;
	s8Out = s8_100;
	s9Out = s9_114;
	s10Out = s10_108;
	return ra_106;
}

// 23067AB0: void hal_reboot(Register ptr32 mstatus)
// Called from:
//      ota_tcp_cmd
//      reboot_cmd
//      reset
void hal_reboot(ptr32 mstatus)
{
	bl_sys_reset_por(mstatus);
}

// 23067AB4: void hal_sys_reset(Register ptr32 mstatus)
// Called from:
//      reset_cmd
void hal_sys_reset(ptr32 mstatus)
{
	bl_sys_reset_system(mstatus);
}

// 23067AB8: void hal_poweroff()
// Called from:
//      poweroff_cmd
void hal_poweroff()
{
}

// 23067ABA: Register Eq_2 hal_sys_capcode_update(Register Eq_2 ra, Register int32 a0, Register int32 a1, Register int32 s2, Register int32 s3, Stack ui32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Register out (ptr32 byte) s1Out, Register out ptr32 a3Out)
// Called from:
//      wifi_mgmr_start
//      wifi_capcode_cmd
//      hal_board_cfg
Eq_2 hal_sys_capcode_update(Eq_2 ra, int32 a0, int32 a1, int32 s2, int32 s3, ui32 dwArg00, word32 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, byte & s1Out, ptr32 & a3Out)
{
	<anonymous> * t1_15 = *(<anonymous> **) 0x2101081C;
	if (a0 != 0x00FF)
	{
		s2 = a1;
		if (a1 != 0x00FF)
		{
			byte * s0_57;
			byte * s1_58;
			ptr32 a3_59;
			Eq_2 ra_60;
			word32 s2_61;
			word32 s3_62;
			t1_15();
			*s0_57 = (byte) s3_62;
			*s1_58 = (byte) s2_61;
			s1Out = s1_58;
			a3Out = a3_59;
			return ra_60;
		}
	}
	byte * s1_42;
	ptr32 a3_43;
	Eq_2 ra_44;
	t1_15();
	s1Out = s1_42;
	a3Out = a3_43;
	return ra_44;
}

