pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23067B1C: void hal_sys_capcode_get()
// Called from:
//      wifi_capcode_cmd
void hal_sys_capcode_get()
{
	g_t4200CDAE();
}

// 23067B24: Register Eq_2 fdt32_to_cpu(Register Eq_2 a0)
// Called from:
//      hal_board_cfg
Eq_2 fdt32_to_cpu(Eq_2 a0)
{
	return (a0 >> 16 & 0x00FF) << 8 | ((a0 << 0x18 | a0 >> 0x18) | (a0 >> 0x08 & 0x00FF) << 16);
}

// 23067B46: Register int32 hal_board_get_factory_addr()
// Called from:
//      aos_loop_proc
int32 hal_board_get_factory_addr()
{
	return g_dw4200F5AC;
}

// 23067B50: Register Eq_2 hal_board_cfg(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg94, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgF4, Register out ptr32 gpOut)
// Called from:
//      bfl_main
Eq_2 hal_board_cfg(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s8, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg94, Eq_2 dwArgD4, Eq_2 dwArgF4, ptr32 & gpOut)
{
	byte bLoc79_7707 = SLICE(dwLoc7C, byte, 24);
	byte bLoc7A_7754 = SLICE(dwLoc7C, byte, 16);
	word16 wLoc7C_8114 = (word16) dwLoc7C;
	byte bLoc7C_12274 = (byte) dwLoc7C;
	byte bLoc7B_12275 = SLICE(dwLoc7C, byte, 8);
	int8 bLocAA = SLICE(dwLocAC, int8, 16);
	word16 wLocB0_12029 = (word16) nLocB0;
	word32 s1_45;
	word32 a5_12994;
	word32 a0_12992;
	word32 a3_12993;
	word32 s2_115;
	struct Eq_374877 * s0_44 = hal_boot2_partition_addr_active(0x230C23D4, s1, out s1_45, out a0_12992, out a3_12993, out a5_12994, out s2_115);
	struct Eq_374887 * sp_3 = fp + -0x0100;
	union Eq_2 * s3_108 = s1_45 + 0x05AC;
	if ((word32) s0_44->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_12996;
			xTaskGetTickCountFromISR(out a5_12996);
		}
		else
		{
			word32 a5_12995;
			xTaskGetTickCount(out a5_12995);
		}
		word32 a0_13004;
		word32 a2_13006;
		word32 a4_13008;
		word32 a5_13009;
		word32 s5_13011;
		word32 s7_13013;
		word32 s8_13014;
		word32 s10_13016;
		word32 s11_13017;
		word32 s9_13015;
		word32 s6_13012;
		word32 s4_13010;
		word32 a3_13007;
		word32 a1_13005;
		word32 s1_13003;
		ra = bl_printk(ra, &g_t230C23E8, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13003, out a0_13004, out a1_13005, out a2_13006, out a3_13007, out a4_13008, out a5_13009, out s2_115, out s3_108, out s4_13010, out s5_13011, out s6_13012, out s7_13013, out s8_13014, out s9_13015, out s10_13016, out s11_13017);
	}
	if (*s3_108 == 0x00)
	{
		if ((word32) s0_44->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_13002;
				xTaskGetTickCountFromISR(out a5_13002);
			}
			else
			{
				word32 a5_13001;
				xTaskGetTickCount(out a5_13001);
			}
			word32 s11_13034;
			word32 s7_13030;
			word32 s8_13031;
			word32 s9_13032;
			word32 s10_13033;
			word32 s1_13018;
			word32 a0_13019;
			word32 a3_13022;
			word32 s4_13027;
			word32 s6_13029;
			word32 s5_13028;
			word32 a4_13023;
			word32 s3_13026;
			word32 s2_13025;
			word32 a5_13024;
			word32 a2_13021;
			word32 a1_13020;
			bl_printk(ra, &g_t230C243C, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13018, out a0_13019, out a1_13020, out a2_13021, out a3_13022, out a4_13023, out a5_13024, out s2_13025, out s3_13026, out s4_13027, out s5_13028, out s6_13029, out s7_13030, out s8_13031, out s9_13032, out s10_13033, out s11_13034);
		}
		while (true)
			;
	}
	word32 s1_12997;
	word32 a3_12999;
	word32 a5_13000;
	word32 a0_12998;
	union Eq_2 * s3_128;
	Eq_2 s2_127;
	Eq_2 s6_131;
	struct Eq_374929 * s0_125 = hal_boot2_partition_bus_addr_active(s2_115 + 980, s1, out s1_12997, out a0_12998, out a3_12999, out a5_13000, out s2_127, out s3_128, out s6_131);
	if ((word32) s0_125->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_13036;
			xTaskGetTickCountFromISR(out a5_13036);
		}
		else
		{
			word32 a5_13035;
			xTaskGetTickCount(out a5_13035);
		}
		word32 a3_13047;
		word32 a5_13049;
		word32 s5_13051;
		word32 s11_13056;
		word32 s10_13055;
		word32 s7_13052;
		word32 s9_13054;
		word32 s8_13053;
		word32 s4_13050;
		word32 a4_13048;
		word32 a2_13046;
		word32 a0_13044;
		word32 a1_13045;
		word32 s1_13043;
		ra = bl_printk(ra, &g_t230C249C, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13043, out a0_13044, out a1_13045, out a2_13046, out a3_13047, out a4_13048, out a5_13049, out s2_127, out s3_128, out s4_13050, out s5_13051, out s6_131, out s7_13052, out s8_13053, out s9_13054, out s10_13055, out s11_13056);
	}
	Eq_2 s1_192 = *s3_128;
	if (s1_192 == 0x00)
	{
		if ((word32) s0_125->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_13042;
				xTaskGetTickCountFromISR(out a5_13042);
			}
			else
			{
				word32 a5_13041;
				xTaskGetTickCount(out a5_13041);
			}
			word32 a0_13058;
			word32 a2_13060;
			word32 a3_13061;
			word32 a5_13063;
			word32 s3_13065;
			word32 s4_13066;
			word32 s8_13070;
			word32 s9_13071;
			word32 s11_13073;
			word32 s10_13072;
			word32 s6_13068;
			word32 s7_13069;
			word32 s5_13067;
			word32 s2_13064;
			word32 a4_13062;
			word32 a1_13059;
			word32 s1_13057;
			bl_printk(ra, &g_t230C24F0, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13057, out a0_13058, out a1_13059, out a2_13060, out a3_13061, out a4_13062, out a5_13063, out s2_13064, out s3_13065, out s4_13066, out s5_13067, out s6_13068, out s7_13069, out s8_13070, out s9_13071, out s10_13072, out s11_13073);
		}
		while (true)
			;
	}
	int32 a0_202;
	struct Eq_375073 * s0_211;
	word32 a5_13037;
	word32 s4_13039;
	word32 s5_13040;
	word32 s3_13038;
	Eq_2 s1_212;
	Eq_2 s2_213;
	Eq_2 s6_217;
	Eq_2 ra_210 = fdt_subnode_offset(ra, s1_192, s1_192, 587982952, s2_127, s6_131, dwLocF8, dwLocC8, s9, out s0_211, out s1_212, out a0_202, out a5_13037, out s2_213, out s3_13038, out s4_13039, out s5_13040, out s6_217);
	if (a0_202 <= 0x00 && ((word32) s0_211->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04))
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_13080;
			xTaskGetTickCountFromISR(out a5_13080);
		}
		else
		{
			word32 a5_13079;
			xTaskGetTickCount(out a5_13079);
		}
		word32 a0_13111;
		word32 a2_13113;
		word32 a3_13114;
		word32 s4_13118;
		word32 s5_13119;
		word32 s9_13122;
		word32 s10_13123;
		word32 s11_13124;
		word32 s8_13121;
		word32 s7_13120;
		word32 a5_13116;
		word32 s3_13117;
		word32 a4_13115;
		word32 a1_13112;
		ra_210 = bl_printk(ra_210, &g_t230BE880, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_212, out a0_13111, out a1_13112, out a2_13113, out a3_13114, out a4_13115, out a5_13116, out s2_213, out s3_13117, out s4_13118, out s5_13119, out s6_217, out s7_13120, out s8_13121, out s9_13122, out s10_13123, out s11_13124);
	}
	Eq_2 a0_278;
	Eq_2 s3_290;
	word32 s0_13074;
	word32 a5_13075;
	word32 s5_13078;
	word32 s4_13077;
	word32 s2_13076;
	Eq_2 s1_1327;
	Eq_2 s6_1332;
	Eq_2 ra_1325 = fdt_subnode_offset(ra_210, s1_212, s1_212, 0x230BEB38, s2_213, s6_217, dwLocF8, dwLocC8, s9, out s0_13074, out s1_1327, out a0_278, out a5_13075, out s2_13076, out s3_290, out s4_13077, out s5_13078, out s6_1332);
	Eq_2 s2_1328 = a0_278;
	if (a0_278 > 0x00)
	{
		dwLocD0.u0 = 0x00;
		word32 a0_305;
		word32 s3_317;
		word32 s5_13089;
		word32 s8_13091;
		word32 s6_13090;
		word32 s2_13087;
		word32 s4_13088;
		word32 s0_13086;
		Eq_2 s1_315;
		Eq_2 ra_313 = fdt_stringlist_count(ra_1325, s1_1327, 0x230C254C, a0_278, dwLocF8, dwLocDC, dwLoc48, s9, out s0_13086, out s1_315, out a0_305, out s2_13087, out s3_317, out s4_13088, out s5_13089, out s6_13090, out s8_13091);
		if (a0_305 == 0x01)
		{
			Eq_2 a0_331;
			word32 a5_13104;
			word32 s5_13106;
			word32 s8_13108;
			word32 s6_13107;
			word32 s3_13105;
			word32 a4_13103;
			word32 a3_13102;
			word32 a1_13101;
			Eq_2 a2_333;
			struct Eq_369609 * s0_340;
			int32 s2_342;
			ptr32 s4_344;
			fdt_stringlist_get(ra_313, s1_315, s3_317 + 0x054C, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_340, out s1_315, out a0_331, out a1_13101, out a2_333, out a3_13102, out a4_13103, out a5_13104, out s2_342, out s3_13105, out s4_344, out s5_13106, out s6_13107, out s8_13108);
			Eq_2 s5_353 = a0_331;
			if ((word32) s0_340->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_13110;
					xTaskGetTickCountFromISR(out a5_13110);
				}
				else
				{
					word32 a5_13109;
					xTaskGetTickCount(out a5_13109);
				}
				word32 a4_13142;
				word32 s6_13145;
				word32 s8_13147;
				word32 s10_13149;
				word32 s11_13150;
				word32 s9_13148;
				word32 s7_13146;
				word32 s3_13144;
				word32 a5_13143;
				word32 a3_13141;
				word32 a1_13140;
				word32 a0_13139;
				bl_printk(dwArgF4, &g_t230C2558, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_315, out a0_13139, out a1_13140, out a2_333, out a3_13141, out a4_13142, out a5_13143, out s2_342, out s3_13144, out s4_344, out s5_353, out s6_13145, out s7_13146, out s8_13147, out s9_13148, out s10_13149, out s11_13150);
			}
			ra_313 = dwArg94;
			struct Eq_369615 * s3_399 = (struct Eq_369615 *) 0x02;
			if (a2_333 <= 0x02)
			{
				word32 a7_13269;
				word32 a5_13267;
				word32 a6_13268;
				word32 a3_13265;
				word32 a4_13266;
				word32 a2_13264;
				word32 a1_13263;
				memcpy(fp + -0x00B0, s5_353, a2_333, out a1_13263, out a2_13264, out a3_13265, out a4_13266, out a5_13267, out a6_13268, out a7_13269);
				nLocB0 = (uint24) wLocB0_12029;
				if ((word32) s0_340->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_13275;
						xTaskGetTickCountFromISR(out a5_13275);
					}
					else
					{
						word32 a5_13274;
						xTaskGetTickCount(out a5_13274);
					}
					word32 a0_13292;
					word32 a2_13294;
					word32 a4_13296;
					word32 a5_13297;
					word32 s8_13301;
					word32 s9_13302;
					word32 s11_13304;
					word32 s10_13303;
					word32 s6_13299;
					word32 s7_13300;
					word32 s5_13298;
					word32 a3_13295;
					word32 a1_13293;
					ra_313 = bl_printk(dwArg94, &g_t230C2584, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_315, out a0_13292, out a1_13293, out a2_13294, out a3_13295, out a4_13296, out a5_13297, out s2_342, out s3_399, out s4_344, out s5_13298, out s6_13299, out s7_13300, out s8_13301, out s9_13302, out s10_13303, out s11_13304);
				}
				word32 a2_13271;
				word32 a5_13273;
				word32 a4_13272;
				word32 a1_13270;
				Eq_2 a3_467;
				Eq_2 s10_472 = strlen(fp + -0x00B0, out a1_13270, out a2_13271, out a3_467, out a4_13272, out a5_13273);
				Eq_2 s5_473 = 0x00;
				struct Eq_376165 * s7_475 = &g_t4200F000;
				word32 s11_478 = 0x230C2000;
				do
				{
					int32 s5_670;
					int32 s3_679;
					if (s5_473 >= s10_472)
						break;
					word32 s5_510;
					struct Eq_274 * a0_587;
					Eq_2 a3_582;
					word32 a5_485 = CONVERT(Mem484[sp_3 + 80 + s5_473:byte], byte, word32);
					if (a5_485 != 70)
					{
						if (a5_485 != 77)
						{
							if (g_t4200F560 != 0x00)
							{
								word32 a5_13309;
								xTaskGetTickCountFromISR(out a5_13309);
							}
							else
							{
								word32 a5_13308;
								xTaskGetTickCount(out a5_13308);
							}
							word32 s10_13325;
							word32 s11_13326;
							word32 s1_13310;
							word32 a1_13312;
							word32 a2_13313;
							word32 a3_13314;
							word32 s9_13324;
							word32 s8_13323;
							word32 a4_13315;
							word32 s7_13322;
							word32 s6_13321;
							word32 a5_13316;
							word32 s2_13317;
							word32 s3_13318;
							word32 s5_13320;
							word32 s4_13319;
							word32 a0_13311;
							bl_printk(ra_313, &g_t230B1CAC, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13310, out a0_13311, out a1_13312, out a2_13313, out a3_13314, out a4_13315, out a5_13316, out s2_13317, out s3_13318, out s4_13319, out s5_13320, out s6_13321, out s7_13322, out s8_13323, out s9_13324, out s10_13325, out s11_13326);
							while (true)
								;
						}
						sp_3->t0080.u1 = 0x00;
						word32 a0_732;
						struct Eq_376346 * s6_750;
						word32 s8_752;
						ra_313 = bl_efuse_read_capcode(ra_313, s0_340, s1_315, &sp_3->t0080, a3_467, (struct Eq_479606 **) 77, s2_342, s3_399, s4_344, mstatus, sp_3->t0028, sp_3->t0040, sp_3->t0044, sp_3->t0068, sp_3->t008C, out s0_340, out s1_315, out a0_732, out a3_467, out s2_342, out s3_399, out s4_344, out s5_510, out s6_750, out s7_475, out s8_752, out s10_472, out s11_478, out mstatus);
						if (a0_732 == 0x00)
						{
							s5_670 = (word32) sp_3->t0080;
							if ((word32) s0_340->b06B4 <= 0x01)
							{
								s3_679 = s5_670;
								if ((word32) g_b420267A1 > 0x01)
									goto l23067FC6;
								if (g_t4200F560 != 0x00)
								{
									word32 a5_13350;
									xTaskGetTickCountFromISR(out a5_13350);
								}
								else
								{
									word32 a5_13349;
									xTaskGetTickCount(out a5_13349);
								}
								word32 a1_13375;
								word32 a3_13377;
								word32 a5_13379;
								word32 s3_13380;
								word32 s6_13382;
								word32 s8_13384;
								word32 s9_13385;
								word32 s11_13387;
								word32 s10_13386;
								word32 s7_13383;
								word32 s4_13381;
								word32 a4_13378;
								word32 a2_13376;
								word32 a0_13374;
								word32 s1_13373;
								ra_313 = bl_printk(ra_313, &g_t230C2660, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13373, out a0_13374, out a1_13375, out a2_13376, out a3_13377, out a4_13378, out a5_13379, out s2_342, out s3_13380, out s4_13381, out s5_670, out s6_13382, out s7_13383, out s8_13384, out s9_13385, out s10_13386, out s11_13387);
							}
							s3_679 = s5_670;
							goto l23067FC6;
						}
						if ((word32) s0_340->b06B4 > 0x01 || (word32) s6_750->b07A1 > 0x01)
							goto l23068334;
						if (s7_475->dw0560 != 0x00)
						{
							word32 a5_13389;
							xTaskGetTickCountFromISR(out a5_13389);
						}
						else
						{
							word32 a5_13388;
							xTaskGetTickCount(out a5_13388);
						}
						a3_582 = s8_752 + 988;
						a0_587 = (struct Eq_274 *) &g_t230C268C;
						goto l23068330;
					}
					sp_3->t0040.u0 = 0x00;
					struct Eq_369615 * a0_496;
					word32 a4_500;
					word32 a1_13305;
					word32 a5_13306;
					word32 s3_13307;
					struct Eq_376301 * s6_511;
					word32 s8_512;
					ra_313 = fdt_getprop(ra_313, s1_315, 0x230BEB40, sp_3->t0008, sp_3->t0028, sp_3->t0044, sp_3->t00D8, sp_3->t0108, out s0_340, out s1_315, out a0_496, out a1_13305, out a3_467, out a4_500, out a5_13306, out s2_342, out s3_13307, out s4_344, out s5_510, out s6_511, out s8_512);
					sp_3 = sp_3->ptr00C4;
					s3_399 = a0_496;
					if (a4_500 == 0x14)
					{
						if ((word32) s0_340->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
						{
							Eq_2 a0_594;
							if (g_t4200F560 != 0x00)
							{
								word32 a5_13329;
								a0_594 = xTaskGetTickCountFromISR(out a5_13329);
							}
							else
							{
								word32 a5_13328;
								a0_594 = xTaskGetTickCount(out a5_13328);
							}
							sp_3->t0090 = a0_594;
							fdt32_to_cpu(a0_496->dw0000);
							fdt32_to_cpu(a0_496->dw0004);
							fdt32_to_cpu(a0_496->t0008);
							Eq_2 a0_618 = fdt32_to_cpu(a0_496->t000C);
							sp_3->t0080 = fdt32_to_cpu(a0_496->t0010) & 0x00FF;
							sp_3->dw0000 = a0_618 & 0x00FF;
							word32 s1_13330;
							word32 a1_13332;
							word32 a2_13333;
							word32 a4_13335;
							word32 s4_13337;
							word32 s5_13338;
							word32 s6_13339;
							word32 s11_13344;
							word32 s10_13343;
							word32 s7_13340;
							word32 s9_13342;
							word32 s8_13341;
							word32 a5_13336;
							word32 a3_13334;
							word32 a0_13331;
							ra_313 = bl_printk(ra_313, &g_t230C25AC, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13330, out a0_13331, out a1_13332, out a2_13333, out a3_13334, out a4_13335, out a5_13336, out s2_342, out s3_399, out s4_13337, out s5_13338, out s6_13339, out s7_13340, out s8_13341, out s9_13342, out s10_13343, out s11_13344);
						}
						s5_670 = fdt32_to_cpu(s3_399->dw0000) & 0x00FF;
						s3_679 = fdt32_to_cpu(s3_399->dw0004) & 0x00FF;
						if ((word32) s0_340->b06B4 <= 0x01 && (word32) g_b420267A1 <= 0x01)
						{
							if (g_t4200F560 != 0x00)
							{
								word32 a5_13346;
								xTaskGetTickCountFromISR(out a5_13346);
							}
							else
							{
								word32 a5_13345;
								xTaskGetTickCount(out a5_13345);
							}
							word32 s6_13359;
							word32 s8_13361;
							word32 s10_13363;
							word32 s11_13364;
							word32 s9_13362;
							word32 s7_13360;
							word32 a5_13357;
							word32 s4_13358;
							word32 a3_13355;
							word32 a4_13356;
							word32 a1_13353;
							word32 a2_13354;
							word32 a0_13352;
							word32 s1_13351;
							ra_313 = bl_printk(ra_313, &g_t230C2608, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13351, out a0_13352, out a1_13353, out a2_13354, out a3_13355, out a4_13356, out a5_13357, out s2_342, out s3_679, out s4_13358, out s5_670, out s6_13359, out s7_13360, out s8_13361, out s9_13362, out s10_13363, out s11_13364);
						}
						goto l23067FC6;
					}
					if ((word32) s0_340->b06B4 <= 0x04)
					{
						if ((word32) s6_511->b07A1 <= 0x04)
						{
							if (s7_475->dw0560 != 0x00)
							{
								word32 a5_13348;
								xTaskGetTickCountFromISR(out a5_13348);
							}
							else
							{
								word32 a5_13347;
								xTaskGetTickCount(out a5_13347);
							}
							word32 a1_13368;
							word32 a4_13370;
							word32 a5_13371;
							word32 s9_13372;
							word32 a2_13369;
							word32 a0_13367;
							ra_313 = bl_printk(ra_313, s11_478 + 0x05E4, s8_512 + 988, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_315, out a0_13367, out a1_13368, out a2_13369, out a3_467, out a4_13370, out a5_13371, out s2_342, out s3_399, out s4_344, out s5_510, out s6_511, out s7_475, out s8_512, out s9_13372, out s10_472, out s11_478);
						}
						if ((word32) s0_340->b06B4 <= 0x01 && (word32) s6_511->b07A1 <= 0x01)
						{
							if (s7_475->dw0560 != 0x00)
							{
								word32 a5_13366;
								xTaskGetTickCountFromISR(out a5_13366);
							}
							else
							{
								word32 a5_13365;
								xTaskGetTickCount(out a5_13365);
							}
							a3_582 = s8_512 + 988;
							a0_587 = (struct Eq_274 *) &g_t230C2634;
l23068330:
							word32 a0_13390;
							word32 a4_13393;
							word32 a5_13394;
							word32 s9_13397;
							word32 s8_13396;
							word32 s6_13395;
							word32 a2_13392;
							word32 a1_13391;
							ra_313 = bl_printk(ra_313, a0_587, a3_582, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_315, out a0_13390, out a1_13391, out a2_13392, out a3_467, out a4_13393, out a5_13394, out s2_342, out s3_399, out s4_344, out s5_510, out s6_13395, out s7_475, out s8_13396, out s9_13397, out s10_472, out s11_478);
						}
					}
l23068334:
					s5_473 = s5_510 + 0x01;
				} while (s5_473 != 0x02);
				if ((word32) s0_340->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_13399;
						xTaskGetTickCountFromISR(out a5_13399);
					}
					else
					{
						word32 a5_13398;
						xTaskGetTickCount(out a5_13398);
					}
					word32 s9_13413;
					word32 s11_13415;
					word32 s10_13414;
					word32 s1_13400;
					word32 a0_13401;
					word32 a1_13402;
					word32 s8_13412;
					word32 s7_13411;
					word32 a2_13403;
					word32 s6_13410;
					word32 s5_13409;
					word32 a3_13404;
					word32 a4_13405;
					word32 a5_13406;
					word32 s4_13408;
					word32 s3_13407;
					ra_313 = bl_printk(ra_313, &g_t230C26B8, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13400, out a0_13401, out a1_13402, out a2_13403, out a3_13404, out a4_13405, out a5_13406, out s2_342, out s3_13407, out s4_13408, out s5_13409, out s6_13410, out s7_13411, out s8_13412, out s9_13413, out s10_13414, out s11_13415);
				}
				s3_679 = 50;
				s5_670 = 50;
l23067FC6:
				word32 a3_13327;
				ra_313 = hal_sys_capcode_update(ra_313, s5_670, s3_679 & 0x00FF, s2_342, s3_679, sp_3->dw0000, sp_3->dw0004, sp_3->t0028, sp_3->t0048, out s1_315, out a3_13327);
			}
		}
		int32 a4_969;
		struct Eq_375294 * s0_974;
		word32 s2_13095;
		word32 s4_13097;
		word32 s6_13099;
		word32 s8_13100;
		word32 s5_13098;
		word32 s3_13096;
		word32 a5_13094;
		word32 a1_13092;
		word32 a3_13093;
		Eq_2 a0_1034;
		Eq_2 s1_1019;
		Eq_2 ra_1018 = fdt_getprop(ra_313, s1_315, 0x230BEBB4, sp_3->t0008, sp_3->t0028, sp_3->t0044, sp_3->t00D8, sp_3->t0108, out s0_974, out s1_1019, out a0_1034, out a1_13092, out a3_13093, out a4_969, out a5_13094, out s2_13095, out s3_13096, out s4_13097, out s5_13098, out s6_13099, out s8_13100);
		Eq_2 s6_1088 = a0_1034;
		if (a4_969 == 60)
		{
			int32 s3_1032;
			Eq_2 s5_1033 = 60;
			for (s3_1032 = 0x00; s3_1032 != 60; s3_1032 += 0x04)
			{
				a0_1034 = fdt32_to_cpu(a0_1034);
				*a0_1034 = (char *) &sp_3->t0080 + s3_1032;
			}
			if ((word32) s0_974->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_13138;
					xTaskGetTickCountFromISR(out a5_13138);
				}
				else
				{
					word32 a5_13137;
					xTaskGetTickCount(out a5_13137);
				}
				word32 s8_13176;
				word32 s10_13178;
				word32 s11_13179;
				word32 s9_13177;
				word32 s4_13174;
				word32 s7_13175;
				word32 s1_13165;
				word32 s2_13172;
				word32 s3_13173;
				word32 a0_13166;
				word32 a4_13170;
				word32 a5_13171;
				word32 a1_13167;
				word32 a3_13169;
				word32 a2_13168;
				ra_1018 = bl_printk(ra_1018, &g_t230BEBFC, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13165, out a0_13166, out a1_13167, out a2_13168, out a3_13169, out a4_13170, out a5_13171, out s2_13172, out s3_13173, out s4_13174, out s5_1033, out s6_1088, out s7_13175, out s8_13176, out s9_13177, out s10_13178, out s11_13179);
			}
			word32 a4_13127;
			word32 s2_13129;
			word32 s3_13130;
			word32 s4_13131;
			word32 s5_13132;
			word32 s6_13133;
			word32 s7_13134;
			word32 s8_13135;
			word32 s9_13136;
			word32 a5_13128;
			word32 a3_13126;
			word32 s0_13125;
			ra_1018 = log_buf_out(ra_1018, &sp_3->t0080, (union Eq_485217 *) 60, 0x00, s5_1033, s6_1088, sp_3->t0014, sp_3->t0020, sp_3->t0024, sp_3->t0030, sp_3->t0058, sp_3->t006C, sp_3->t007C, sp_3->dw010C, out s0_13125, out s1_1019, out a3_13126, out a4_13127, out a5_13128, out s2_13129, out s3_13130, out s4_13131, out s5_13132, out s6_13133, out s7_13134, out s8_13135, out s9_13136);
		}
		else if ((word32) s0_974->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_13262;
				xTaskGetTickCountFromISR(out a5_13262);
			}
			else
			{
				word32 a5_13261;
				xTaskGetTickCount(out a5_13261);
			}
			word32 a1_13277;
			word32 a2_13278;
			word32 a4_13280;
			word32 s2_13282;
