pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
			word32 s7_13287;
			word32 s9_13289;
			word32 s11_13291;
			word32 s10_13290;
			word32 s8_13288;
			word32 s6_13286;
			word32 s3_13283;
			word32 s5_13285;
			word32 s4_13284;
			word32 a5_13281;
			word32 a3_13279;
			word32 a0_13276;
			ra_1018 = bl_printk(ra_1018, &g_t230BEC3C, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_1019, out a0_13276, out a1_13277, out a2_13278, out a3_13279, out a4_13280, out a5_13281, out s2_13282, out s3_13283, out s4_13284, out s5_13285, out s6_13286, out s7_13287, out s8_13288, out s9_13289, out s10_13290, out s11_13291);
		}
		int32 * a0_1141;
		int32 a4_1145;
		struct Eq_375571 * s0_1150;
		word32 s5_13258;
		word32 s8_13260;
		word32 s6_13259;
		word32 s3_13256;
		word32 s4_13257;
		word32 s2_13255;
		word32 a1_13252;
		word32 a5_13254;
		word32 a3_13253;
		Eq_2 s1_1151;
		Eq_2 ra_1149 = fdt_getprop(ra_1018, s1_1019, 587983912, sp_3->t0008, sp_3->t0028, sp_3->t0044, sp_3->t00D8, sp_3->t0108, out s0_1150, out s1_1151, out a0_1141, out a1_13252, out a3_13253, out a4_1145, out a5_13254, out s2_13255, out s3_13256, out s4_13257, out s5_13258, out s6_13259, out s8_13260);
		if (a4_1145 == 56)
		{
			Eq_2 s5_1207 = (char *) &sp_3->t0058 + 8;
			int32 * s3_1208 = a0_1141;
			Eq_2 s6_1210 = s5_1207;
			do
			{
				s5_1207 = (word32) s5_1207 + 2;
				*((word32) s5_1207 + 0x0FFE) = (word16) fdt32_to_cpu(*s3_1208);
				++s3_1208;
			} while (a0_1141 + 0x0E != s3_1208);
			if ((word32) s0_1150->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_13164;
					xTaskGetTickCountFromISR(out a5_13164);
				}
				else
				{
					word32 a5_13163;
					xTaskGetTickCount(out a5_13163);
				}
				word32 s4_13189;
				word32 a5_13186;
				word32 a1_13182;
				word32 a2_13183;
				word32 s7_13190;
				word32 s9_13192;
				word32 s11_13194;
				word32 s10_13193;
				word32 s8_13191;
				word32 s2_13187;
				word32 s3_13188;
				word32 a3_13184;
				word32 a4_13185;
				word32 s1_13180;
				word32 a0_13181;
				ra_1149 = bl_printk(ra_1149, &g_t230BEC6C, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13180, out a0_13181, out a1_13182, out a2_13183, out a3_13184, out a4_13185, out a5_13186, out s2_13187, out s3_13188, out s4_13189, out s5_1207, out s6_1210, out s7_13190, out s8_13191, out s9_13192, out s10_13193, out s11_13194);
			}
			word32 a3_13152;
			word32 a5_13154;
			word32 s2_13155;
			word32 s3_13156;
			word32 s8_13161;
			word32 s9_13162;
			word32 s7_13160;
			word32 s4_13157;
			word32 s6_13159;
			word32 s5_13158;
			word32 a4_13153;
			word32 s0_13151;
			ra_1149 = log_buf_out(ra_1149, s6_1210, (union Eq_485217 *) 56, 0x00, s5_1207, s6_1210, sp_3->t0014, sp_3->t0020, sp_3->t0024, sp_3->t0030, sp_3->t0058, sp_3->t006C, sp_3->t007C, sp_3->dw010C, out s0_13151, out s1_1151, out a3_13152, out a4_13153, out a5_13154, out s2_13155, out s3_13156, out s4_13157, out s5_13158, out s6_13159, out s7_13160, out s8_13161, out s9_13162);
		}
		else if ((word32) s0_1150->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_13205;
				xTaskGetTickCountFromISR(out a5_13205);
			}
			else
			{
				word32 a5_13204;
				xTaskGetTickCount(out a5_13204);
			}
			word32 a2_13222;
			word32 a4_13224;
			word32 a5_13225;
			word32 s2_13226;
			word32 s11_13235;
			word32 s3_13227;
			word32 s10_13234;
			word32 s9_13233;
			word32 s4_13228;
			word32 s5_13229;
			word32 s6_13230;
			word32 s8_13232;
			word32 s7_13231;
			word32 a3_13223;
			word32 a1_13221;
			word32 a0_13220;
			ra_1149 = bl_printk(ra_1149, &g_t230BECA4, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_1151, out a0_13220, out a1_13221, out a2_13222, out a3_13223, out a4_13224, out a5_13225, out s2_13226, out s3_13227, out s4_13228, out s5_13229, out s6_13230, out s7_13231, out s8_13232, out s9_13233, out s10_13234, out s11_13235);
		}
		union Eq_2 * a0_1317;
		word32 a4_1321;
		struct Eq_375786 * s0_1326;
		word32 a5_13199;
		word32 s4_13201;
		word32 s8_13203;
		word32 s5_13202;
		word32 s3_13200;
		word32 a3_13198;
		word32 a1_13197;
		ra_1325 = fdt_getprop(ra_1149, s1_1151, 587984024, sp_3->t0008, sp_3->t0028, sp_3->t0044, sp_3->t00D8, sp_3->t0108, out s0_1326, out s1_1327, out a0_1317, out a1_13197, out a3_13198, out a4_1321, out a5_13199, out s2_1328, out s3_13200, out s4_13201, out s5_13202, out s6_1332, out s8_13203);
		if (a4_1321 == 0x04)
		{
			if ((word32) s0_1326->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
			{
				Eq_2 a0_1389;
				Eq_2 s2_1388 = *a0_1317;
				if (g_t4200F560 != 0x00)
				{
					word32 a5_13196;
					a0_1389 = xTaskGetTickCountFromISR(out a5_13196);
				}
				else
				{
					word32 a5_13195;
					a0_1389 = xTaskGetTickCount(out a5_13195);
				}
				sp_3->t0090 = a0_1389;
				fdt32_to_cpu(s2_1388);
				word32 a0_13206;
				word32 a2_13208;
				word32 a3_13209;
				word32 s4_13213;
				word32 s5_13214;
				word32 s9_13217;
				word32 s10_13218;
				word32 s11_13219;
				word32 s8_13216;
				word32 s7_13215;
				word32 a5_13211;
				word32 s3_13212;
				word32 a4_13210;
				word32 a1_13207;
				ra_1325 = bl_printk(ra_1325, &g_t230C26E0, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_1327, out a0_13206, out a1_13207, out a2_13208, out a3_13209, out a4_13210, out a5_13211, out s2_1328, out s3_13212, out s4_13213, out s5_13214, out s6_1332, out s7_13215, out s8_13216, out s9_13217, out s10_13218, out s11_13219);
			}
		}
		else if ((word32) s0_1326->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_13237;
				xTaskGetTickCountFromISR(out a5_13237);
			}
			else
			{
				word32 a5_13236;
				xTaskGetTickCount(out a5_13236);
			}
			word32 a2_13240;
			word32 a4_13242;
			word32 s3_13244;
			word32 s4_13245;
			word32 s7_13247;
			word32 s9_13249;
			word32 s10_13250;
			word32 s11_13251;
			word32 s8_13248;
			word32 s5_13246;
			word32 a5_13243;
			word32 a3_13241;
			word32 a1_13239;
			word32 a0_13238;
			ra_1325 = bl_printk(ra_1325, &g_t230BECF8, 0x230C23DC, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_1327, out a0_13238, out a1_13239, out a2_13240, out a3_13241, out a4_13242, out a5_13243, out s2_1328, out s3_13244, out s4_13245, out s5_13246, out s6_1332, out s7_13247, out s8_13248, out s9_13249, out s10_13250, out s11_13251);
		}
	}
	int32 a0_1445;
	word32 a5_13082;
	word32 s3_13083;
	word32 s4_13084;
	word32 s5_13085;
	word32 s0_13081;
	Eq_2 s1_1455;
	Eq_2 s2_1456;
	Eq_2 s6_1460;
	Eq_2 ra_1453 = fdt_subnode_offset(ra_1325, s1_1327, s1_1327, 0x230BE910, s2_1328, s6_1332, dwLocF8, dwLocC8, s9, out s0_13081, out s1_1455, out a0_1445, out a5_13082, out s2_1456, out s3_13083, out s4_13084, out s5_13085, out s6_1460);
	if (a0_1445 > 0x00)
	{
		word32 a0_1471;
		word32 s0_13420;
		word32 s3_13421;
		word32 s5_13423;
		word32 s8_13424;
		word32 s4_13422;
		ra_1453 = fdt_stringlist_count(ra_1453, s1_1455, 588010744, 0x230C5000, dwLocF8, dwLocDC, dwLoc48, s9, out s0_13420, out s1_1455, out a0_1471, out s2_1456, out s3_13421, out s4_13422, out s5_13423, out s6_1460, out s8_13424);
		if (a0_1471 == 0x01)
		{
			Eq_2 a2_1525;
			word32 s8_13447;
			word32 s10_13449;
			word32 s11_13450;
			word32 s9_13448;
			word32 s1_13425;
			word32 a0_13426;
			word32 s5_13445;
			word32 s7_13446;
			word32 a1_13427;
			word32 s4_13434;
			word32 s6_13436;
			word32 s3_13443;
			word32 s4_13444;
			word32 s8_13437;
			word32 a4_13441;
			word32 a5_13442;
			word32 a0_13438;
			word32 a3_13440;
			word32 a1_13439;
			word32 s5_13435;
			word32 s2_13432;
			word32 s3_13433;
			word32 a5_13431;
			word32 a2_13428;
			word32 a4_13430;
			word32 a3_13429;
			struct Eq_122719 * s0_1506;
			ra_1453 = bl_printk(fdt_stringlist_get(ra_1453, s1_1455, (word32) s2_1456 + 1272, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_1506, out s1_13425, out a0_13426, out a1_13427, out a2_13428, out a3_13429, out a4_13430, out a5_13431, out s2_13432, out s3_13433, out s4_13434, out s5_13435, out s6_13436, out s8_13437), &g_t230C2708, dwLoc9C, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13438, out a1_13439, out a2_1525, out a3_13440, out a4_13441, out a5_13442, out s2_1456, out s3_13443, out s4_13444, out s5_13445, out s6_1460, out s7_13446, out s8_13447, out s9_13448, out s10_13449, out s11_13450);
			if (a2_1525 <= 0x03)
			{
				Eq_2 a3_1552;
				word32 a4_13453;
				word32 a5_13454;
				word32 a6_13455;
				word32 a7_13456;
				word32 a1_13451;
				word32 a2_13452;
				memcpy(fp - 0x00B0, s2_1456, a2_1525, out a1_13451, out a2_13452, out a3_1552, out a4_13453, out a5_13454, out a6_13455, out a7_13456);
				word32 a0_13457;
				word32 a1_13458;
				word32 a3_13460;
				word32 a5_13462;
				word32 s8_13467;
				word32 s10_13469;
				word32 s11_13470;
				word32 s9_13468;
				word32 s7_13466;
				word32 s2_13463;
				word32 s6_13465;
				word32 s5_13464;
				word32 a4_13461;
				word32 a2_13459;
				word32 s4_1578;
				word32 s3_1577;
				ra_1453 = bl_printk(ra_1453, &g_t230C2728, a3_1552, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13457, out a1_13458, out a2_13459, out a3_13460, out a4_13461, out a5_13462, out s2_13463, out s3_1577, out s4_1578, out s5_13464, out s6_13465, out s7_13466, out s8_13467, out s9_13468, out s10_13469, out s11_13470);
				word32 a1_13471;
				word32 a2_13472;
				word32 a5_13474;
				word32 a4_13473;
				Eq_2 a3_1588;
				Eq_2 s10_1593 = strlen(fp - 0x00B0, out a1_13471, out a2_13472, out a3_1588, out a4_13473, out a5_13474);
				s2_1456.u0 = 0x00;
				struct Eq_377198 * s5_1595 = &g_dw42026000;
				s6_1460.u0 = 0x4200F000;
				word32 s7_1597 = 0x230C2000;
				word32 s11_1600 = 0x230BF000;
				Eq_2 dwLocB0_12051 = (uint32) nLocB0;
				do
				{
					bLocAA = SLICE(dwLocAC, int8, 16);
					if (s2_1456 >= s10_1593)
						break;
					struct Eq_274 * a0_1843;
					Eq_2 a3_1839;
					struct Eq_274 * a0_1767;
					int32 a5_1607 = (word32) *((byte) s2_1456.u0 + (fp - 0x00B0));
					if (a5_1607 != 70)
					{
						if (a5_1607 != 77)
						{
							if (a5_1607 != 66)
							{
								if (g_t4200F560 != 0x00)
								{
									word32 a5_13508;
									xTaskGetTickCountFromISR(out a5_13508);
								}
								else
								{
									word32 a5_13507;
									xTaskGetTickCount(out a5_13507);
								}
								word32 s10_13538;
								word32 s11_13539;
								word32 s8_13536;
								word32 s9_13537;
								word32 a1_13525;
								word32 a3_13527;
								word32 s6_13534;
								word32 s7_13535;
								word32 a4_13528;
								word32 s4_13532;
								word32 s5_13533;
								word32 a5_13529;
								word32 s3_13531;
								word32 s2_13530;
								word32 a2_13526;
								word32 s1_13523;
								word32 a0_13524;
								bl_printk(ra_1453, &g_t230B1CAC, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13523, out a0_13524, out a1_13525, out a2_13526, out a3_13527, out a4_13528, out a5_13529, out s2_13530, out s3_13531, out s4_13532, out s5_13533, out s6_13534, out s7_13535, out s8_13536, out s9_13537, out s10_13538, out s11_13539);
								while (true)
									;
							}
							ui32 a0_1995 = (word32) bLoc80;
							ui32 a6_1996 = (word32) bLoc7F;
							ui32 a1_1997 = (word32) bLoc7E;
							ui32 a2_1998 = (word32) bLoc7D;
							ui32 a3_1999 = (word32) bLoc7C_12274;
							ui32 a4_2002 = (word32) bLoc7B_12275;
							a3_1588 = a3_1999 | (a2_1998 | (a1_1997 | (a0_1995 | a6_1996)));
							ra_1453 = bl_efuse_read_mac(ra_1453, s0_1506, s1_1455, fp - 0x0080, s2_1456, s3_1577, s4_1578, out s0_1506, out s1_1455, out s2_1456, out s3_1577, out s4_1578);
							ui32 a5_2009 = a0_1995 & a6_1996 & a1_1997 & a2_1998 & a3_1999 & a4_2002;
							if ((a4_2002 | a3_1588) == 0x00 || a5_2009 == 0x01)
							{
								if ((word32) s0_1506->b06B4 > 0x01 || (word32) s5_1595->b07A1 > 0x01)
									goto l2306829E;
								if (*((byte) s6_1460.u0 + 0x0560) != 0x00)
								{
									word32 a5_13479;
									xTaskGetTickCountFromISR(out a5_13479);
								}
								else
								{
									word32 a5_13478;
									xTaskGetTickCount(out a5_13478);
								}
								a3_1839 = s7_1597 + 988;
								a0_1843 = (struct Eq_274 *) &g_t230C2770;
								goto l2306829A;
							}
							if ((word32) s0_1506->b06B4 > 0x01)
								goto l2306858A;
							if ((word32) g_b420267A1 > 0x01)
								goto l23068594;
							if (g_t4200F560 != 0x00)
							{
								word32 a5_13488;
								xTaskGetTickCountFromISR(out a5_13488);
							}
							else
							{
								word32 a5_13487;
								xTaskGetTickCount(out a5_13487);
							}
							a0_1767 = (struct Eq_274 *) &g_t230C2744;
						}
						else
						{
							word32 a0_1850;
							ra_1453 = bl_efuse_read_mac_factory(ra_1453, s0_1506, s1_1455, fp - 0x0080, a3_1588, (word32 *) 77, s2_1456, s3_1577, s4_1578, mstatus, dwLocF8, dwLocD8, dwLocC0, dwLocBC, dwLocB0_12051, dwLocAC, s10, s2, dwLoc74, dwLoc64, out s0_1506, out s1_1455, out a0_1850, out a3_1588, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s7_1597, out s10_1593, out s11_1600, out mstatus);
							if (a0_1850 != 0x00)
							{
l23068BF0:
								if ((word32) s0_1506->b06B4 > 0x01 || (word32) s5_1595->b07A1 > 0x01)
									goto l2306829E;
								if (*((byte) s6_1460.u0 + 0x0560) != 0x00)
								{
									word32 a5_13582;
									xTaskGetTickCountFromISR(out a5_13582);
								}
								else
								{
									word32 a5_13581;
									xTaskGetTickCount(out a5_13581);
								}
								a3_1839 = s7_1597 + 988;
								a0_1843 = (struct Eq_274 *) &g_t230C2848;
								goto l2306829A;
							}
							ui32 a0_1879 = (word32) bLoc80;
							ui32 a6_1880 = (word32) bLoc7F;
							ui32 a1_1881 = (word32) bLoc7E;
							ui32 a2_1882 = (word32) bLoc7D;
							ui32 a3_1883 = (word32) bLoc7C_12274;
							ui32 a4_1886 = (word32) bLoc7B_12275;
							a3_1588 = a3_1883 | (a2_1882 | (a1_1881 | (a0_1879 | a6_1880)));
							ui32 a5_1893 = a0_1879 & a6_1880 & a1_1881 & a2_1882 & a3_1883 & a4_1886;
							if ((a4_1886 | a3_1588) == 0x00 || a5_1893 == 0x01)
								goto l23068BF0;
							if ((word32) s0_1506->b06B4 > 0x01)
								goto l2306858A;
							if ((word32) g_b420267A1 > 0x01)
								goto l23068594;
							if (g_t4200F560 != 0x00)
							{
								word32 a5_13541;
								xTaskGetTickCountFromISR(out a5_13541);
							}
							else
							{
								word32 a5_13540;
								xTaskGetTickCount(out a5_13540);
							}
							a0_1767 = (struct Eq_274 *) &g_t230C281C;
						}
						goto l23068586;
					}
					struct Eq_274 * a0_1660;
					Eq_2 a3_1654;
					Eq_2 a0_1617;
					word32 a5_1622;
					word32 a4_13476;
					word32 s8_13477;
					word32 a1_13475;
					fdt_getprop(ra_1453, s1_1455, 0x230BE914, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_1506, out s1_1455, out a0_1617, out a1_13475, out a3_1588, out a4_13476, out a5_1622, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s8_13477);
					ra_1453 = dwArgF4;
					if (a5_1622 == 0x06)
					{
						word32 a1_13556;
						word32 a3_13558;
						word32 a4_13559;
						word32 a6_13561;
						word32 a7_13562;
						word32 a5_13560;
						word32 a2_13557;
						memcpy(fp - 0x0080, a0_1617, 0x06, out a1_13556, out a2_13557, out a3_13558, out a4_13559, out a5_13560, out a6_13561, out a7_13562);
						bl_wifi_sta_mac_addr_set(fp - 0x0080);
						Eq_2 a0_1696;
						word32 a4_1700;
						word32 a5_1701;
						word32 a1_13563;
						word32 s8_13564;
						fdt_getprop(dwArgF4, s1_1455, 587983172, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_1506, out s1_1455, out a0_1696, out a1_13563, out a3_1588, out a4_1700, out a5_1701, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s8_13564);
						ra_1453 = dwArgD4;
						if (a4_1700 != a5_1701)
						{
							if ((word32) s0_1506->b06B4 > 0x04)
								goto l2306829E;
							if ((word32) s5_1595->b07A1 > 0x04)
								goto l23068AC8;
							if (*((byte) s6_1460.u0 + 0x0560) != 0x00)
							{
								word32 a5_13573;
								xTaskGetTickCountFromISR(out a5_13573);
							}
							else
							{
								word32 a5_13572;
								xTaskGetTickCount(out a5_13572);
							}
							a3_1654 = s7_1597 + 988;
							a0_1660 = (struct Eq_274 *) &g_t230C279C;
							goto l23068AC4;
						}
						word32 a4_13568;
						word32 a5_13569;
						word32 a7_13571;
						word32 a6_13570;
						word32 a2_13566;
						word32 a3_13567;
						word32 a1_13565;
						memcpy(fp - 0x0080, a0_1696, 0x06, out a1_13565, out a2_13566, out a3_13567, out a4_13568, out a5_13569, out a6_13570, out a7_13571);
						bl_wifi_ap_mac_addr_set(fp - 0x0080);
						if ((word32) s0_1506->b06B4 > 0x01)
							goto l2306858A;
						if ((word32) g_b420267A1 > 0x01)
							goto l23068594;
						if (g_t4200F560 != 0x00)
						{
							word32 a5_13593;
							xTaskGetTickCountFromISR(out a5_13593);
						}
						else
						{
							word32 a5_13592;
							xTaskGetTickCount(out a5_13592);
						}
						a0_1767 = (struct Eq_274 *) &g_t230C27C4;
l23068586:
						word32 a2_13544;
						word32 a3_13545;
						word32 a5_13547;
						word32 s4_13549;
						word32 s10_13554;
						word32 s11_13555;
						word32 s9_13553;
						word32 s5_13550;
						word32 s8_13552;
						word32 s7_13551;
						word32 s3_13548;
						word32 a4_13546;
						word32 a0_13542;
						word32 a1_13543;
						ra_1453 = bl_printk(ra_1453, a0_1767, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13542, out a1_13543, out a2_13544, out a3_13545, out a4_13546, out a5_13547, out s2_1456, out s3_13548, out s4_13549, out s5_13550, out s6_1460, out s7_13551, out s8_13552, out s9_13553, out s10_13554, out s11_13555);
						goto l2306858A;
					}
					if ((word32) s0_1506->b06B4 <= 0x04)
					{
						if ((word32) s5_1595->b07A1 <= 0x04)
						{
							if (*((byte) s6_1460.u0 + 0x0560) != 0x00)
							{
								word32 a5_13595;
								xTaskGetTickCountFromISR(out a5_13595);
							}
							else
							{
								word32 a5_13594;
								xTaskGetTickCount(out a5_13594);
							}
							a3_1654 = s7_1597 + 988;
							a0_1660 = s11_1600 + -1712;
l23068AC4:
							word32 a4_13577;
							word32 s8_13579;
							word32 s9_13580;
							word32 a5_13578;
							word32 a2_13576;
							word32 a1_13575;
							word32 a0_13574;
							ra_1453 = bl_printk(ra_1453, a0_1660, a3_1654, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13574, out a1_13575, out a2_13576, out a3_1588, out a4_13577, out a5_13578, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s7_1597, out s8_13579, out s9_13580, out s10_1593, out s11_1600);
						}
l23068AC8:
						if ((word32) s0_1506->b06B4 <= 0x01 && (word32) s5_1595->b07A1 <= 0x01)
						{
							if (*((byte) s6_1460.u0 + 0x0560) != 0x00)
							{
								word32 a5_13591;
								xTaskGetTickCountFromISR(out a5_13591);
							}
							else
							{
								word32 a5_13590;
								xTaskGetTickCount(out a5_13590);
							}
							a3_1839 = s7_1597 + 988;
							a0_1843 = (struct Eq_274 *) &g_t230C27F0;
l2306829A:
							word32 s9_13589;
							word32 s8_13588;
							word32 a0_13583;
							word32 a1_13584;
							word32 a2_13585;
							word32 a5_13587;
							word32 a4_13586;
							ra_1453 = bl_printk(ra_1453, a0_1843, a3_1839, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13583, out a1_13584, out a2_13585, out a3_1588, out a4_13586, out a5_13587, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s7_1597, out s8_13588, out s9_13589, out s10_1593, out s11_1600);
						}
					}
l2306829E:
					s2_1456 = (byte) s2_1456.u0 + 1;
				} while (s2_1456 != 0x03);
				if ((word32) s0_1506->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_13506;
						xTaskGetTickCountFromISR(out a5_13506);
					}
					else
					{
						word32 a5_13505;
						xTaskGetTickCount(out a5_13505);
					}
					word32 a0_13509;
					word32 a2_13511;
					word32 a3_13512;
					word32 a5_13514;
					word32 s4_13516;
					word32 s5_13517;
					word32 s7_13518;
					word32 s11_13522;
					word32 s8_13519;
					word32 s10_13521;
					word32 s9_13520;
					word32 s3_13515;
					word32 a4_13513;
					word32 a1_13510;
					ra_1453 = bl_printk(ra_1453, &g_t230C2874, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13509, out a1_13510, out a2_13511, out a3_13512, out a4_13513, out a5_13514, out s2_1456, out s3_13515, out s4_13516, out s5_13517, out s6_1460, out s7_13518, out s8_13519, out s9_13520, out s10_13521, out s11_13522);
				}
				word32 a2_13481;
				word32 a3_13482;
				word32 a6_13485;
				word32 a7_13486;
				word32 a5_13484;
				word32 a4_13483;
				word32 a1_13480;
				memcpy(fp - 0x0080, 588036816, 0x06, out a1_13480, out a2_13481, out a3_13482, out a4_13483, out a5_13484, out a6_13485, out a7_13486);
l2306858A:
				wLoc7C_8114 = (word16) dwLoc7C;
				if ((word32) s0_1506->b06B4 <= 0x02)
				{
l23068594:
					if ((word32) g_b420267A1 <= 0x02)
					{
						if (g_t4200F560 != 0x00)
						{
							word32 a5_13490;
							xTaskGetTickCountFromISR(out a5_13490);
						}
						else
						{
							word32 a5_13489;
							xTaskGetTickCount(out a5_13489);
						}
						word32 a1_13492;
						word32 a2_13493;
						word32 a3_13494;
						word32 s11_13504;
						word32 s10_13503;
						word32 a4_13495;
						word32 s9_13502;
						word32 s8_13501;
						word32 a5_13496;
						word32 s3_13497;
						word32 s4_13498;
						word32 s7_13500;
						word32 s5_13499;
						word32 a0_13491;
						ra_1453 = bl_printk(ra_1453, &g_t230C28A4, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13491, out a1_13492, out a2_13493, out a3_13494, out a4_13495, out a5_13496, out s2_1456, out s3_13497, out s4_13498, out s5_13499, out s6_1460, out s7_13500, out s8_13501, out s9_13502, out s10_13503, out s11_13504);
					}
				}
				bl_wifi_ap_mac_addr_set(fp - 0x0080);
				bl_wifi_sta_mac_addr_set(fp - 0x0080);
			}
		}
	}
	int32 a0_2355;
	word32 s0_13416;
	word32 s4_13418;
	word32 s5_13419;
	word32 s3_13417;
	Eq_2 s1_2365;
	word32 a5_2360;
	Eq_2 s2_2366;
	Eq_2 s6_2370;
	Eq_2 ra_2363 = fdt_subnode_offset(ra_1453, s1_1455, s1_1455, 587983008, s2_1456, s6_1460, dwLocF8, dwLocC8, s9, out s0_13416, out s1_2365, out a0_2355, out a5_2360, out s2_2366, out s3_13417, out s4_13418, out s5_13419, out s6_2370);
	if (a0_2355 > 0x00)
	{
		Eq_2 a0_2380;
		word32 a4_2384;
		struct Eq_377937 * s0_2389;
		word32 a3_13602;
		word32 s2_13604;
		word32 s3_13605;
		word32 s4_13606;
		word32 s5_13607;
		word32 s8_13608;
		word32 a5_13603;
		word32 a1_13601;
		ra_2363 = fdt_getprop(ra_2363, s1_2365, 0x230BE8A8, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_2389, out s1_2365, out a0_2380, out a1_13601, out a3_13602, out a4_2384, out a5_13603, out s2_13604, out s3_13605, out s4_13606, out s5_13607, out s6_2370, out s8_13608);
		a5_2360 = 0x04;
		s2_2366 = a0_2380;
		if (a4_2384 == 0x04)
		{
			if ((word32) s0_2389->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_13610;
					xTaskGetTickCountFromISR(out a5_13610);
				}
				else
				{
