pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
					word32 a5_13609;
					xTaskGetTickCount(out a5_13609);
				}
				fdt32_to_cpu(*a0_2380);
				word32 a4_13632;
				word32 a5_13633;
				word32 s5_13636;
				word32 s4_13635;
				word32 s3_13634;
				word32 s7_13637;
				word32 s8_13638;
				word32 s10_13640;
				word32 s11_13641;
				word32 s9_13639;
				word32 a0_13628;
				word32 a2_13630;
				word32 a3_13631;
				word32 a1_13629;
				ra_2363 = bl_printk(ra_2363, &g_t230C28E8, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2365, out a0_13628, out a1_13629, out a2_13630, out a3_13631, out a4_13632, out a5_13633, out s2_2366, out s3_13634, out s4_13635, out s5_13636, out s6_2370, out s7_13637, out s8_13638, out s9_13639, out s10_13640, out s11_13641);
			}
			a5_2360 = bl_wifi_country_code_set(fdt32_to_cpu(*s2_2366) & 0x00FF);
		}
		else if ((word32) s0_2389->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_14160;
				xTaskGetTickCountFromISR(out a5_14160);
			}
			else
			{
				word32 a5_14159;
				xTaskGetTickCount(out a5_14159);
			}
			word32 s8_14188;
			word32 s9_14189;
			word32 s11_14191;
			word32 s10_14190;
			word32 a1_14180;
			word32 a4_14183;
			word32 s3_14184;
			word32 s7_14187;
			word32 s4_14185;
			word32 s5_14186;
			word32 a2_14181;
			word32 a3_14182;
			word32 a0_14179;
			ra_2363 = bl_printk(ra_2363, &g_t230BE8E8, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2365, out a0_14179, out a1_14180, out a2_14181, out a3_14182, out a4_14183, out a5_2360, out s2_2366, out s3_14184, out s4_14185, out s5_14186, out s6_2370, out s7_14187, out s8_14188, out s9_14189, out s10_14190, out s11_14191);
		}
	}
	int32 a0_2522;
	word32 a5_13597;
	word32 s4_13599;
	word32 s5_13600;
	word32 s3_13598;
	word32 s0_13596;
	Eq_2 s2_2533;
	Eq_2 s6_2537;
	Eq_2 s1_2532;
	Eq_2 ra_2530 = fdt_subnode_offset(ra_2363, s1_2365, s1_2365, a5_2360 + -1224, s2_2366, s6_2370, dwLocF8, dwLocC8, s9, out s0_13596, out s1_2532, out a0_2522, out a5_13597, out s2_2533, out s3_13598, out s4_13599, out s5_13600, out s6_2537);
	if (a0_2522 > 0x00)
	{
		word32 a4_2552;
		struct Eq_378030 * s0_2557;
		word32 s6_13624;
		word32 s8_13625;
		word32 s4_13622;
		word32 s5_13623;
		word32 s2_13620;
		word32 s3_13621;
		word32 a1_13617;
		word32 a5_13619;
		word32 a3_13618;
		Eq_2 a0_2548;
		Eq_2 s1_2558;
		Eq_2 ra_2556 = fdt_getprop(ra_2530, s1_2532, 0x230C2910, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_2557, out s1_2558, out a0_2548, out a1_13617, out a3_13618, out a4_2552, out a5_13619, out s2_13620, out s3_13621, out s4_13622, out s5_13623, out s6_13624, out s8_13625);
		if (a4_2552 == 0x10)
		{
			int32 s2_2616;
			for (s2_2616 = 0x00; s2_2616 != 0x04; ++s2_2616)
			{
				a0_2548 = fdt32_to_cpu(a0_2548);
				fp - 0x0080 + s2_2616 = (byte *) (byte) a0_2548;
			}
			if ((word32) s0_2557->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_13627;
					xTaskGetTickCountFromISR(out a5_13627);
				}
				else
				{
					word32 a5_13626;
					xTaskGetTickCount(out a5_13626);
				}
				word32 a5_13647;
				word32 s3_13649;
				word32 s5_13651;
				word32 s10_13656;
				word32 s11_13657;
				word32 s9_13655;
				word32 s6_13652;
				word32 s8_13654;
				word32 s7_13653;
				word32 s4_13650;
				word32 s2_13648;
				word32 a3_13645;
				word32 a4_13646;
				word32 a2_13644;
				word32 a0_13642;
				word32 a1_13643;
				ra_2556 = bl_printk(ra_2556, &g_t230C2920, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2558, out a0_13642, out a1_13643, out a2_13644, out a3_13645, out a4_13646, out a5_13647, out s2_13648, out s3_13649, out s4_13650, out s5_13651, out s6_13652, out s7_13653, out s8_13654, out s9_13655, out s10_13656, out s11_13657);
			}
			bl_tpc_update_power_rate_11b(fp - 0x0080);
		}
		else if ((word32) s0_2557->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_13993;
				xTaskGetTickCountFromISR(out a5_13993);
			}
			else
			{
				word32 a5_13992;
				xTaskGetTickCount(out a5_13992);
			}
			word32 a1_13995;
			word32 a3_13997;
			word32 a5_13999;
			word32 s2_14000;
			word32 s4_14002;
			word32 s6_14004;
			word32 s7_14005;
			word32 s8_14006;
			word32 s9_14007;
			word32 s11_14009;
			word32 s10_14008;
			word32 s5_14003;
			word32 s3_14001;
			word32 a4_13998;
			word32 a2_13996;
			word32 a0_13994;
			ra_2556 = bl_printk(ra_2556, &g_t230C2950, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2558, out a0_13994, out a1_13995, out a2_13996, out a3_13997, out a4_13998, out a5_13999, out s2_14000, out s3_14001, out s4_14002, out s5_14003, out s6_14004, out s7_14005, out s8_14006, out s9_14007, out s10_14008, out s11_14009);
		}
		Eq_2 dwLoc7C_12983;
		int32 a4_2710;
		struct Eq_378188 * s0_2715;
		word32 s8_13991;
		word32 s6_13990;
		word32 s5_13989;
		word32 s4_13988;
		word32 a1_13983;
		word32 a3_13984;
		word32 a5_13985;
		word32 s3_13987;
		word32 s2_13986;
		Eq_2 a0_2706;
		Eq_2 s1_2716;
		Eq_2 ra_2714 = fdt_getprop(ra_2556, s1_2558, 0x230C2988, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_2715, out s1_2716, out a0_2706, out a1_13983, out a3_13984, out a4_2710, out a5_13985, out s2_13986, out s3_13987, out s4_13988, out s5_13989, out s6_13990, out s8_13991);
		if (a4_2710 == 32)
		{
			int32 s2_2774;
			for (s2_2774 = 0x00; s2_2774 != 0x08; ++s2_2774)
			{
				a0_2706 = fdt32_to_cpu(a0_2706);
				fp - 0x0080 + s2_2774 = (byte *) (byte) a0_2706;
			}
			Eq_2 dwLoc7C_12988 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8114);
			if ((word32) s0_2715->b06B4 <= 0x02)
			{
				dwLoc7C_12988 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8114);
				if ((word32) g_b420267A1 <= 0x02)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_13659;
						xTaskGetTickCountFromISR(out a5_13659);
					}
					else
					{
						word32 a5_13658;
						xTaskGetTickCount(out a5_13658);
					}
					Eq_2 a5_2803 = (word32) bLoc79_7707;
					dwLocF8 = a5_2803;
					dwLoc7C_12988 = (word32) bLoc7A_7754;
					word32 a1_13663;
					word32 a3_13665;
					word32 a4_13666;
					word32 s4_13670;
					word32 s5_13671;
					word32 s8_13674;
					word32 s9_13675;
					word32 s11_13677;
					word32 s10_13676;
					word32 s7_13673;
					word32 s6_13672;
					word32 s2_13668;
					word32 s3_13669;
					word32 a5_13667;
					word32 a2_13664;
					word32 a0_13662;
					ra_2714 = bl_printk(ra_2714, &g_t230C2998, 0x230C23DC, a5_2803, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2716, out a0_13662, out a1_13663, out a2_13664, out a3_13665, out a4_13666, out a5_13667, out s2_13668, out s3_13669, out s4_13670, out s5_13671, out s6_13672, out s7_13673, out s8_13674, out s9_13675, out s10_13676, out s11_13677);
				}
			}
			bl_tpc_update_power_rate_11g(fp - 0x0080);
			dwLoc7C_12983 = dwLoc7C_12988;
		}
		else
		{
			dwLoc7C_12983 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8114);
			if ((word32) s0_2715->b06B4 <= 0x04)
			{
				dwLoc7C_12983 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8114);
				if ((word32) g_b420267A1 <= 0x04)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_13794;
						xTaskGetTickCountFromISR(out a5_13794);
					}
					else
					{
						word32 a5_13793;
						xTaskGetTickCount(out a5_13793);
					}
					word32 s8_13944;
					word32 s10_13946;
					word32 s11_13947;
					word32 s9_13945;
					word32 s7_13943;
					word32 s6_13942;
					word32 s5_13941;
					word32 s4_13940;
					word32 a0_13932;
					word32 s3_13939;
					word32 s2_13938;
					word32 a1_13933;
					word32 a2_13934;
					word32 a3_13935;
					word32 a5_13937;
					word32 a4_13936;
					ra_2714 = bl_printk(ra_2714, &g_t230C29D4, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2716, out a0_13932, out a1_13933, out a2_13934, out a3_13935, out a4_13936, out a5_13937, out s2_13938, out s3_13939, out s4_13940, out s5_13941, out s6_13942, out s7_13943, out s8_13944, out s9_13945, out s10_13946, out s11_13947);
					dwLoc7C_12983 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8114);
				}
			}
		}
		byte bLoc7A_7866 = SLICE(dwLoc7C_12983, byte, 16);
		byte bLoc79_7847 = SLICE(dwLoc7C_12983, byte, 24);
		int32 a4_2875;
		struct Eq_378242 * s0_2880;
		word32 s3_13788;
		word32 s6_13791;
		word32 s8_13792;
		word32 s5_13790;
		word32 s4_13789;
		word32 s2_13787;
		word32 a5_13786;
		word32 a3_13785;
		word32 a1_13784;
		Eq_2 a0_2871;
		Eq_2 s1_2881;
		Eq_2 ra_2879 = fdt_getprop(ra_2714, s1_2716, 0x230C2A0C, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_2880, out s1_2881, out a0_2871, out a1_13784, out a3_13785, out a4_2875, out a5_13786, out s2_13787, out s3_13788, out s4_13789, out s5_13790, out s6_13791, out s8_13792);
		Eq_2 dwLoc7C_7870 = dwLoc7C_12983;
		if (a4_2875 == 32)
		{
			int32 s2_2939;
			for (s2_2939 = 0x00; s2_2939 != 0x08; ++s2_2939)
			{
				a0_2871 = fdt32_to_cpu(a0_2871);
				fp - 0x0080 + s2_2939 = (byte *) (byte) a0_2871;
			}
			if ((word32) s0_2880->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_13661;
					xTaskGetTickCountFromISR(out a5_13661);
				}
				else
				{
					word32 a5_13660;
					xTaskGetTickCount(out a5_13660);
				}
				Eq_2 a5_2968 = (word32) bLoc79_7847;
				dwLocF8 = a5_2968;
				dwLoc7C_7870 = (word32) bLoc7A_7866;
				word32 s9_13698;
				word32 s5_13694;
				word32 s2_13691;
				word32 a3_13688;
				word32 a0_13685;
				word32 s6_13695;
				word32 s3_13692;
				word32 a4_13689;
				word32 a1_13686;
				word32 s10_13699;
				word32 s11_13700;
				word32 s7_13696;
				word32 s8_13697;
				word32 s4_13693;
				word32 a5_13690;
				word32 a2_13687;
				ra_2879 = bl_printk(ra_2879, &g_t230C2A1C, 0x230C23DC, a5_2968, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2881, out a0_13685, out a1_13686, out a2_13687, out a3_13688, out a4_13689, out a5_13690, out s2_13691, out s3_13692, out s4_13693, out s5_13694, out s6_13695, out s7_13696, out s8_13697, out s9_13698, out s10_13699, out s11_13700);
			}
			bl_tpc_update_power_rate_11n(fp - 0x0080);
		}
		else if ((word32) s0_2880->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_13684;
				xTaskGetTickCountFromISR(out a5_13684);
			}
			else
			{
				word32 a5_13683;
				xTaskGetTickCount(out a5_13683);
			}
			word32 s9_13714;
			word32 s5_13710;
			word32 s3_13708;
			word32 a5_13706;
			word32 a1_13702;
			word32 a2_13703;
			word32 s6_13711;
			word32 s10_13715;
			word32 s11_13716;
			word32 s7_13712;
			word32 s8_13713;
			word32 s4_13709;
			word32 s2_13707;
			word32 a3_13704;
			word32 a4_13705;
			word32 a0_13701;
			ra_2879 = bl_printk(ra_2879, &g_t230C2A58, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2881, out a0_13701, out a1_13702, out a2_13703, out a3_13704, out a4_13705, out a5_13706, out s2_13707, out s3_13708, out s4_13709, out s5_13710, out s6_13711, out s7_13712, out s8_13713, out s9_13714, out s10_13715, out s11_13716);
		}
		dwLocDC.u0 = 0x00;
		word32 a0_3034;
		word32 s8_13682;
		word32 s3_13679;
		word32 s5_13681;
		word32 s4_13680;
		word32 s0_13678;
		ra_2530 = fdt_stringlist_count(ra_2879, s1_2881, 587999888, 0x230C3000, dwLocF8, 0x00, dwLoc48, s9, out s0_13678, out s1_2532, out a0_3034, out s2_2533, out s3_13679, out s4_13680, out s5_13681, out s6_2537, out s8_13682);
		if (a0_3034 == 0x01)
		{
			Eq_2 a0_3061;
			word32 s8_13724;
			word32 s3_13723;
			word32 s2_13722;
			word32 a5_13721;
			word32 a4_13720;
			word32 a3_13719;
			word32 a1_13718;
			word32 s1_13717;
			Eq_2 a2_3063;
			struct Eq_369708 * s0_3070;
			Eq_2 s5_3075;
			word32 s4_3074;
			ra_2530 = fdt_stringlist_get(ra_2530, s1_2532, (word32) s2_2533 - 0x0570, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_3070, out s1_13717, out a0_3061, out a1_13718, out a2_3063, out a3_13719, out a4_13720, out a5_13721, out s2_13722, out s3_13723, out s4_3074, out s5_3075, out s6_2537, out s8_13724);
			Eq_2 s3_3083 = a0_3061;
			if ((word32) s0_3070[1716] <= 0x02 && (word32) g_b420267A1 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_13726;
					xTaskGetTickCountFromISR(out a5_13726);
				}
				else
				{
					word32 a5_13725;
					xTaskGetTickCount(out a5_13725);
				}
				word32 s9_13736;
				word32 s11_13738;
				word32 s10_13737;
				word32 s8_13735;
				word32 s7_13734;
				word32 s2_13733;
				word32 a5_13732;
				word32 s1_13727;
				word32 a0_13728;
				word32 a1_13729;
				word32 a4_13731;
				word32 a3_13730;
				ra_2530 = bl_printk(ra_2530, &g_t230C2A9C, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13727, out a0_13728, out a1_13729, out a2_3063, out a3_13730, out a4_13731, out a5_13732, out s2_13733, out s3_3083, out s4_3074, out s5_3075, out s6_2537, out s7_13734, out s8_13735, out s9_13736, out s10_13737, out s11_13738);
			}
			s1_2532 = dwLoc7C_7870;
			s2_2533.u0 = 0x02;
			if (a2_3063 <= 0x02)
			{
				word32 a1_13739;
				word32 a3_13741;
				word32 a5_13743;
				word32 a6_13744;
				word32 a7_13745;
				word32 a4_13742;
				word32 a2_13740;
				memcpy(fp - 0x00C4, s3_3083, a2_3063, out a1_13739, out a2_13740, out a3_13741, out a4_13742, out a5_13743, out a6_13744, out a7_13745);
				if ((word32) s0_3070[1716] <= 0x02 && (word32) g_b420267A1 <= 0x02)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_13764;
						xTaskGetTickCountFromISR(out a5_13764);
					}
					else
					{
						word32 a5_13763;
						xTaskGetTickCount(out a5_13763);
					}
					word32 s10_13776;
					word32 s11_13777;
					word32 a5_13770;
					word32 s6_13772;
					word32 s8_13774;
					word32 s9_13775;
					word32 s7_13773;
					word32 s2_13771;
					word32 a3_13768;
					word32 a4_13769;
					word32 a1_13766;
					word32 a2_13767;
					word32 a0_13765;
					ra_2530 = bl_printk(ra_2530, &g_t230C2AC4, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2532, out a0_13765, out a1_13766, out a2_13767, out a3_13768, out a4_13769, out a5_13770, out s2_13771, out s3_3083, out s4_3074, out s5_3075, out s6_13772, out s7_13773, out s8_13774, out s9_13775, out s10_13776, out s11_13777);
				}
				word32 t1_13746;
				word32 a1_13748;
				word32 a2_13749;
				word32 a3_13750;
				word32 a3_13757;
				word32 a5_13759;
				word32 a4_13758;
				word32 a1_13755;
				word32 a2_13756;
				word32 a0_13754;
				word32 a4_13751;
				word32 t1_13753;
				word32 a5_13752;
				word32 a0_13747;
				Eq_2 ra_3219 = memset(memset(ra_2530, fp - 0x00B0, 0x00, 0x0E, out t1_13746, out a0_13747, out a1_13748, out a2_13749, out a3_13750, out a4_13751, out a5_13752), fp - 0x00A0, 0x00, 0x0E, out t1_13753, out a0_13754, out a1_13755, out a2_13756, out a3_13757, out a4_13758, out a5_13759);
				word32 a1_13760;
				word32 a2_13761;
				word32 a4_13762;
				int32 a5_3226;
				Eq_2 a3_3224;
				strlen(fp - 0x00C4, out a1_13760, out a2_13761, out a3_3224, out a4_13762, out a5_3226);
				byte * s2_3230 = fp - 0x00C4;
				int32 s9_3232;
				struct Eq_378630 * s7_3233 = &g_dw42026000;
				Eq_2 s6_3235 = 0x230C2000;
				for (s9_3232 = 0x00; s9_3232 != 0x02; ++s9_3232)
				{
					struct Eq_274 * a0_3670;
					Eq_2 a3_3668;
					if (s9_3232 >= a5_3226)
						break;
					byte * s2_3271;
					struct Eq_274 * a0_3353;
					Eq_2 a3_3347;
					Eq_378690 a5_3243 = (word32) *s2_3230;
					if (a5_3243 != 70)
					{
						struct Eq_479606 ** a4_3245;
						if (a5_3243 <= 70)
						{
							a4_3245 = (struct Eq_479606 **) 66;
							if (a5_3243 != 66)
								goto l230689CE;
							goto l23068FCC;
						}
						a4_3245 = (struct Eq_479606 **) 98;
						if (a5_3243 != 98)
						{
							if (a5_3243 != 0x0066)
							{
l230689CE:
								if (g_t4200F560 != 0x00)
								{
									word32 a5_13783;
									xTaskGetTickCountFromISR(out a5_13783);
								}
								else
								{
									word32 a5_13782;
									xTaskGetTickCount(out a5_13782);
								}
								word32 s10_13820;
								word32 s11_13821;
								word32 a3_13809;
								word32 a5_13811;
								word32 s8_13818;
								word32 s9_13819;
								word32 s2_13812;
								word32 s6_13816;
								word32 s7_13817;
								word32 s3_13813;
								word32 s5_13815;
								word32 s4_13814;
								word32 a4_13810;
								word32 a1_13807;
								word32 a2_13808;
								word32 a0_13806;
								word32 s1_13805;
								bl_printk(ra_3219, &g_t230B1CAC, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13805, out a0_13806, out a1_13807, out a2_13808, out a3_13809, out a4_13810, out a5_13811, out s2_13812, out s3_13813, out s4_13814, out s5_13815, out s6_13816, out s7_13817, out s8_13818, out s9_13819, out s10_13820, out s11_13821);
								while (true)
									;
							}
							goto l23068E2A;
						}
l23068FCC:
						Eq_2 a0_3689;
						struct Eq_378731 * s8_3709;
						ra_3219 = bl_efuse_read_pwroft(ra_3219, s0_3070, s1_2532, fp - 0x00A0, a3_3224, a4_3245, s2_3230, s3_3083, s4_3074, mstatus, dwLocD8, dwLocC0, dwLocBC, s10, dwLoc74, dwArg18, out s0_3070, out s1_2532, out a0_3689, out a3_3224, out s2_3271, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_3709, out s9_3232, out mstatus);
						s3_3083 = a0_3689;
						up32 a4_3717 = (word32) s0_3070[1716];
						if (a0_3689 == 0x00)
						{
							if (a4_3717 <= 0x02 && (word32) s7_3233[0x07A1] <= 0x02)
							{
								if (s8_3709->dw0560 != 0x00)
								{
									word32 a5_13952;
									xTaskGetTickCountFromISR(out a5_13952);
								}
								else
								{
									word32 a5_13951;
									xTaskGetTickCount(out a5_13951);
								}
								word32 a5_13961;
								word32 s3_13963;
								word32 s4_13964;
								word32 s10_13968;
								word32 s11_13969;
								word32 s7_13965;
								word32 s9_13967;
								word32 s8_13966;
								word32 s2_13962;
								word32 a3_13959;
								word32 a4_13960;
								word32 a2_13958;
								word32 s1_13955;
								word32 a1_13957;
								word32 a0_13956;
								ra_3219 = bl_printk(ra_3219, &g_t230C2AE8, (word32) s6_3235 + 988, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13955, out a0_13956, out a1_13957, out a2_13958, out a3_13959, out a4_13960, out a5_13961, out s2_13962, out s3_13963, out s4_13964, out s5_3075, out s6_3235, out s7_13965, out s8_13966, out s9_13967, out s10_13968, out s11_13969);
							}
							struct Eq_379487 * s8_3839;
							word32 a3_13948;
							word32 a4_13949;
							word32 a5_13950;
							ra_3219 = log_buf_out(ra_3219, fp - 0x00A0, (union Eq_485217 *) 0x0E, 0x01, s5_3075, s6_3235, s3_290, dwLocE0, 0x00, dwLocD0, dwLocA8, s8, s0, dwArg0C, out s0_3070, out s1_2532, out a3_13948, out a4_13949, out a5_13950, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_3839, out s9_3232);
							if ((word32) *s2_3271 == 66)
							{
								do
								{
									Mem3962[fp - 0x00B0 + s3_3083:byte] = SLICE(CONVERT(Mem3958[fp - 0x00A0 + s3_3083:byte], byte, word32), byte, 0);
									s3_3083 = (word32) s3_3083 + 1;
								} while (s3_3083 != 0x0E);
								if ((word32) s0_3070[1716] > 0x01 || (word32) g_b420267A1 > 0x01)
									goto l23069274;
								if (g_t4200F560 != 0x00)
								{
									word32 a5_13954;
									xTaskGetTickCountFromISR(out a5_13954);
								}
								else
								{
									word32 a5_13953;
									xTaskGetTickCount(out a5_13953);
								}
								a3_3668 = (word32) s6_3235 + 988;
								a0_3670 = (struct Eq_274 *) &g_t230C2B1C;
								goto l23069086;
							}
							if ((word32) s0_3070[1716] <= 0x01 && (word32) s7_3233[0x07A1] <= 0x01)
							{
								if (s8_3839->dw0560 != 0x00)
								{
									word32 a5_13971;
									xTaskGetTickCountFromISR(out a5_13971);
								}
								else
								{
									word32 a5_13970;
									xTaskGetTickCount(out a5_13970);
								}
								word32 s11_13980;
								word32 a2_13974;
								word32 a4_13976;
								word32 s8_13978;
								word32 s10_13979;
								word32 a5_13977;
								word32 a3_13975;
								word32 a0_13972;
								word32 a1_13973;
								ra_3219 = bl_printk(ra_3219, &g_t230C2B4C, (word32) s6_3235 + 988, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2532, out a0_13972, out a1_13973, out a2_13974, out a3_13975, out a4_13976, out a5_13977, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_13978, out s9_3232, out s10_13979, out s11_13980);
							}
							struct Eq_379616 * a5_3890 = fp - 0x00B0;
							a3_3224.u0 = 0x0E;
							do
							{
								++a5_3890;
								Mem3903[a5_3890 + 0x0FFF:byte] = Mem3897[fp - 0x00A0 + s3_3083:byte] + Mem3897[a5_3890 + 0x00:byte];
								s3_3083 = (word32) s3_3083 + 1;
							} while (s3_3083 != 0x0E);
							goto l230690EE;
						}
						if (a4_3717 > 0x01 || (word32) s7_3233[0x07A1] > 0x01)
							goto l230690EE;
						if (s8_3709->dw0560 != 0x00)
						{
							word32 a5_13982;
							xTaskGetTickCountFromISR(out a5_13982);
						}
						else
						{
							word32 a5_13981;
							xTaskGetTickCount(out a5_13981);
						}
						a3_3347 = (word32) s6_3235 + 988;
						a0_3353 = (struct Eq_274 *) &g_t230C2B8C;
						goto l23069178;
					}
l23068E2A:
					word32 a1_13778;
					word32 a3_13779;
					word32 a4_13780;
					word32 a5_13781;
					struct Eq_378701 * s8_3276;
					Eq_2 a0_3260;
					ra_3219 = fdt_getprop(ra_3219, s1_2532, 588000196, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_3070, out s1_2532, out a0_3260, out a1_13778, out a3_13779, out a4_13780, out a5_13781, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s8_3276);
					a3_3224.u0 = 0x00;
					if (false)
					{
						int32 s3_3354;
						Eq_2 s5_3355 = 0x0E;
						for (s3_3354 = 0x00; s3_3354 != 0x0E; ++s3_3354)
						{
							a0_3260 = fdt32_to_cpu(a0_3260);
							fp - 0x00A0 + s3_3354 = (byte *) (byte) a0_3260;
						}
						if ((word32) s0_3070[1716] <= 0x02 && (word32) g_b420267A1 <= 0x02)
						{
							if (g_t4200F560 != 0x00)
							{
								word32 a5_13804;
								xTaskGetTickCountFromISR(out a5_13804);
							}
							else
							{
								word32 a5_13803;
								xTaskGetTickCount(out a5_13803);
							}
							word32 a5_13828;
							word32 s2_13829;
							word32 s11_13836;
							word32 s10_13835;
							word32 s3_13830;
							word32 s4_13831;
							word32 s7_13832;
							word32 s9_13834;
							word32 s8_13833;
							word32 s1_13822;
							word32 a1_13824;
							word32 a3_13826;
							word32 a4_13827;
							word32 a2_13825;
							word32 a0_13823;
							ra_3219 = bl_printk(ra_3219, &g_t230C2BD0, 0x230C23DC, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13822, out a0_13823, out a1_13824, out a2_13825, out a3_13826, out a4_13827, out a5_13828, out s2_13829, out s3_13830, out s4_13831, out s5_3355, out s6_3235, out s7_13832, out s8_13833, out s9_13834, out s10_13835, out s11_13836);
						}
						struct Eq_378846 * s0_3441;
						word32 s1_13795;
						word32 a3_13796;
						word32 a5_13798;
						word32 s7_13800;
						word32 s8_13801;
						word32 s9_13802;
						word32 s4_13799;
						word32 a4_13797;
						union Eq_2 * s2_3445;
						word32 s3_3446;
