pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
						ra_3219 = log_buf_out(ra_3219, fp - 0x00A0, (union Eq_485217 *) 0x0E, 0x00, s5_3355, s6_3235, s3_290, dwLocE0, 0x00, dwLocD0, dwLocA8, s8, s0, dwArg0C, out s0_3441, out s1_13795, out a3_13796, out a4_13797, out a5_13798, out s2_3445, out s3_3446, out s4_13799, out s5_3075, out s6_3235, out s7_13800, out s8_13801, out s9_13802);
						struct Eq_378879 * a5_3457 = fp - 0x00A0;
						do
						{
							++a5_3457;
							a5_3457[0x0FFF] = (struct Eq_378879) (byte) ((word32) a5_3457->b0000 + ~0x09);
						} while (fp - 0x0092 != a5_3457);
						if ((word32) s0_3441->b06B4 <= 0x02)
						{
							s5_3075.u0 = 0x42026000;
							if ((word32) g_b420267A1 <= 0x02)
							{
								if (g_t4200F560 != 0x00)
								{
									word32 a5_13838;
									xTaskGetTickCountFromISR(out a5_13838);
								}
								else
								{
									word32 a5_13837;
									xTaskGetTickCount(out a5_13837);
								}
								word32 s8_13850;
								word32 s11_13853;
								word32 s10_13852;
								word32 s9_13851;
								word32 s7_13849;
								word32 s4_13848;
								word32 a5_13847;
								word32 a4_13846;
								word32 s1_13841;
								word32 a0_13842;
								word32 a1_13843;
								word32 a3_13845;
								word32 a2_13844;
								ra_3219 = bl_printk(ra_3219, &g_t230C2BFC, s3_3446 + 988, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13841, out a0_13842, out a1_13843, out a2_13844, out a3_13845, out a4_13846, out a5_13847, out s2_3445, out s3_3446, out s4_13848, out s5_3075, out s6_3235, out s7_13849, out s8_13850, out s9_13851, out s10_13852, out s11_13853);
							}
							if ((word32) s0_3441->b06B4 <= 0x01 && (word32) (*((byte) s5_3075.u0 + 0x07A1)) <= 0x01)
							{
								if (g_t4200F560 != 0x00)
								{
									word32 a5_13855;
									xTaskGetTickCountFromISR(out a5_13855);
								}
								else
								{
									word32 a5_13854;
									xTaskGetTickCount(out a5_13854);
								}
								word32 s1_13863;
								word32 a0_13864;
								word32 s7_13871;
								word32 s9_13873;
								word32 s10_13874;
								word32 s11_13875;
								word32 s8_13872;
								word32 a5_13869;
								word32 s4_13870;
								word32 a4_13868;
								word32 a1_13865;
								word32 a3_13867;
								word32 a2_13866;
								ra_3219 = bl_printk(ra_3219, &g_t230C2C6C, s3_3446 + 988, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13863, out a0_13864, out a1_13865, out a2_13866, out a3_13867, out a4_13868, out a5_13869, out s2_3445, out s3_3446, out s4_13870, out s5_3075, out s6_3235, out s7_13871, out s8_13872, out s9_13873, out s10_13874, out s11_13875);
							}
						}
						up32 a4_3574 = (word32) s0_3441->b06B4;
						if ((word32) *s2_3445 != 66)
						{
							if (a4_3574 <= 0x01 && (word32) g_b420267A1 <= 0x01)
							{
								if (g_t4200F560 != 0x00)
								{
									word32 a5_13916;
									xTaskGetTickCountFromISR(out a5_13916);
								}
								else
								{
									word32 a5_13915;
									xTaskGetTickCount(out a5_13915);
								}
								word32 s10_13930;
								word32 s11_13931;
								word32 s2_13924;
								word32 s4_13926;
								word32 s8_13928;
								word32 s9_13929;
								word32 s7_13927;
								word32 s3_13925;
								word32 a4_13922;
								word32 a5_13923;
								word32 a2_13920;
								word32 a3_13921;
								word32 a0_13918;
								word32 a1_13919;
								word32 s1_13917;
								ra_3219 = bl_printk(ra_3219, &g_t230C2CD0, s3_3446 + 988, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13917, out a0_13918, out a1_13919, out a2_13920, out a3_13921, out a4_13922, out a5_13923, out s2_13924, out s3_13925, out s4_13926, out s5_3075, out s6_3235, out s7_13927, out s8_13928, out s9_13929, out s10_13930, out s11_13931);
							}
							struct Eq_379368 * a4_3622 = fp - 0x00B0;
							int32 a5_3623;
							for (a5_3623 = 0x00; a5_3623 != 0x0E; ++a5_3623)
							{
								++a4_3622;
								a4_3622[0x0FFF] = (struct Eq_379368) (fp - 0x00A0 + a5_3623 + a4_3622->b0000);
							}
							goto l23069274;
						}
						else
						{
							int32 a5_3638;
							for (a5_3638 = 0x00; a5_3638 != 0x0E; ++a5_3638)
								(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(fp - 0x00B0)[a5_3638].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0] = (byte) (word32) (fp - 0x00A0 + a5_3638);
							if (a4_3574 > 0x01 || (word32) g_b420267A1 > 0x01)
								goto l23069274;
							if (g_t4200F560 != 0x00)
							{
								word32 a5_13914;
								xTaskGetTickCountFromISR(out a5_13914);
							}
							else
							{
								word32 a5_13913;
								xTaskGetTickCount(out a5_13913);
							}
							a3_3668 = s3_3446 + 988;
							a0_3670 = (struct Eq_274 *) &g_t230C2CA0;
							goto l23069086;
						}
					}
					if ((word32) s0_3070[1716] <= 0x04)
					{
						if ((word32) s7_3233[0x07A1] <= 0x04)
						{
							if (s8_3276[0x0560] != 0x00)
							{
								word32 a5_13840;
								xTaskGetTickCountFromISR(out a5_13840);
							}
							else
							{
								word32 a5_13839;
								xTaskGetTickCount(out a5_13839);
							}
							word32 a1_13857;
							word32 a2_13858;
							word32 a5_13860;
							word32 s11_13862;
							word32 s10_13861;
							word32 a4_13859;
							word32 a0_13856;
							ra_3219 = bl_printk(ra_3219, &g_t230C2C38, (word32) s6_3235 + 988, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2532, out a0_13856, out a1_13857, out a2_13858, out a3_3224, out a4_13859, out a5_13860, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_3276, out s9_3232, out s10_13861, out s11_13862);
						}
						if ((word32) s0_3070[1716] <= 0x01 && (word32) s7_3233[0x07A1] <= 0x01)
						{
							if (s8_3276[0x0560] != 0x00)
							{
								word32 a5_13877;
								xTaskGetTickCountFromISR(out a5_13877);
							}
							else
							{
								word32 a5_13876;
								xTaskGetTickCount(out a5_13876);
							}
							a3_3347 = (word32) s6_3235 + 988;
							a0_3353 = (struct Eq_274 *) &g_t230C2D10;
l23069178:
							word32 s10_13884;
							word32 s11_13885;
							word32 a5_13882;
							word32 s8_13883;
							word32 a2_13880;
							word32 a4_13881;
							word32 a0_13878;
							word32 a1_13879;
							ra_3219 = bl_printk(ra_3219, a0_3353, a3_3347, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2532, out a0_13878, out a1_13879, out a2_13880, out a3_3224, out a4_13881, out a5_13882, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_13883, out s9_3232, out s10_13884, out s11_13885);
						}
					}
l230690EE:
					a5_3226 = 0x02;
					s2_3230 = s2_3271 + 1;
				}
				if (a5_3226 == 0x00 && ((word32) s0_3070[1716] <= 0x02 && (word32) g_b420267A1 <= 0x02))
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_13897;
						xTaskGetTickCountFromISR(out a5_13897);
					}
					else
					{
						word32 a5_13896;
						xTaskGetTickCount(out a5_13896);
					}
					a3_3668.u0 = 0x230C23DC;
					a0_3670 = (struct Eq_274 *) &g_t230C2D48;
l23069086:
					word32 s1_13898;
					word32 a1_13900;
					word32 a3_13902;
					word32 a4_13903;
					word32 a5_13904;
					word32 s10_13911;
					word32 s11_13912;
					word32 s8_13909;
					word32 s9_13910;
					word32 s7_13908;
					word32 s2_13905;
					word32 s4_13907;
					word32 s3_13906;
					word32 a2_13901;
					word32 a0_13899;
					ra_3219 = bl_printk(ra_3219, a0_3670, a3_3668, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13898, out a0_13899, out a1_13900, out a2_13901, out a3_13902, out a4_13903, out a5_13904, out s2_13905, out s3_13906, out s4_13907, out s5_3075, out s6_3235, out s7_13908, out s8_13909, out s9_13910, out s10_13911, out s11_13912);
				}
l23069274:
				word32 s3_13890;
				word32 s7_13893;
				word32 s9_13895;
				word32 s8_13894;
				word32 s5_13892;
				word32 s4_13891;
				word32 s0_13886;
				word32 a4_13888;
				word32 a5_13889;
				word32 a3_13887;
				ra_2530 = log_buf_out(ra_3219, fp - 0x00B0, (union Eq_485217 *) 0x0E, 0x01, s5_3075, s6_3235, s3_290, dwLocE0, 0x00, dwLocD0, dwLocA8, s8, s0, dwArg0C, out s0_13886, out s1_2532, out a3_13887, out a4_13888, out a5_13889, out s2_2533, out s3_13890, out s4_13891, out s5_13892, out s6_2537, out s7_13893, out s8_13894, out s9_13895);
				ble_rf_set_pwr_offset((int32) bLocAA);
				phy_powroffset_set(fp - 0x00B0);
			}
		}
	}
	Eq_2 a0_4109;
	word32 s2_13613;
	word32 s4_13615;
	word32 s5_13616;
	word32 s3_13614;
	word32 s0_13611;
	word32 a5_13612;
	Eq_2 s1_4119;
	Eq_2 s6_4124;
	Eq_2 ra_4117 = fdt_subnode_offset(ra_2530, s1_2532, s1_2532, 0x230BE998, s2_2533, s6_2537, dwLocF8, dwLocC8, s9, out s0_13611, out s1_4119, out a0_4109, out a5_13612, out s2_13613, out s3_13614, out s4_13615, out s5_13616, out s6_4124);
	Eq_2 s2_4129 = a0_4109;
	if (a0_4109 <= 0x00)
	{
l23069364:
		Eq_2 a0_4590;
		word32 s3_14013;
		word32 s5_14015;
		word32 s4_14014;
		word32 a5_14011;
		word32 s2_14012;
		word32 s0_14010;
		Eq_2 s1_4600;
		Eq_2 s6_4605;
		Eq_2 ra_4598 = fdt_subnode_offset(ra_4117, s1_4119, s1_4119, 588000760, s2_4129, s6_4124, dwLocF8, dwLocC8, s9, out s0_14010, out s1_4600, out a0_4590, out a5_14011, out s2_14012, out s3_14013, out s4_14014, out s5_14015, out s6_4605);
		Eq_2 s2_4610 = a0_4590;
		if (a0_4590 <= 0x00)
		{
l2306942E:
			Eq_2 a0_5022;
			struct Eq_380273 * s0_5031;
			word32 s5_14134;
			word32 s2_14131;
			word32 s4_14133;
			word32 s3_14132;
			Eq_2 s1_5032;
			word32 a5_5027;
			Eq_2 s6_5037;
			Eq_2 ra_5030 = fdt_subnode_offset(ra_4598, s1_4600, s1_4600, 0x230C2ECC, s2_4610, s6_4605, dwLocF8, dwLocC8, s9, out s0_5031, out s1_5032, out a0_5022, out a5_5027, out s2_14131, out s3_14132, out s4_14133, out s5_14134, out s6_5037);
			Eq_2 s2_5042 = a0_5022;
			if (a0_5022 <= 0x00)
			{
				a5_5027 = 0x04;
				if ((word32) s0_5031->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_14169;
						xTaskGetTickCountFromISR(out a5_14169);
					}
					else
					{
						word32 a5_14168;
						xTaskGetTickCount(out a5_14168);
					}
					word32 s5_14218;
					word32 s10_14222;
					word32 s11_14223;
					word32 s8_14220;
					word32 s9_14221;
					word32 s7_14219;
					word32 a1_14212;
					word32 a2_14213;
					word32 a4_14215;
					word32 s4_14217;
					word32 s3_14216;
					word32 a3_14214;
					word32 a0_14211;
					ra_5030 = bl_printk(ra_5030, &g_t230C2ED8, 0x230C23DC, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_5032, out a0_14211, out a1_14212, out a2_14213, out a3_14214, out a4_14215, out a5_5027, out s2_5042, out s3_14216, out s4_14217, out s5_14218, out s6_5037, out s7_14219, out s8_14220, out s9_14221, out s10_14222, out s11_14223);
				}
			}
			int32 a0_5098;
			Eq_2 s1_5108;
			word32 s5_14166;
			word32 s6_14167;
			word32 s3_14164;
			word32 s4_14165;
			word32 a5_14162;
			word32 s2_14163;
			word32 s0_14161;
			Eq_2 ra_5106 = fdt_subnode_offset(ra_5030, s1_5032, s1_5032, a5_5027 + -1224, s2_5042, s6_5037, dwLocF8, dwLocC8, s9, out s0_14161, out s1_5108, out a0_5098, out a5_14162, out s2_14163, out s3_14164, out s4_14165, out s5_14166, out s6_14167);
			if (a0_5098 > 0x00)
			{
				union Eq_2 * a0_5123;
				struct Eq_380673 * s0_5132;
				word32 a3_14226;
				word32 s4_14231;
				word32 s6_14233;
				word32 s8_14234;
				word32 s5_14232;
				word32 a4_14227;
				word32 s3_14230;
				word32 s2_14229;
				word32 a5_14228;
				word32 a1_14225;
				word32 s1_14224;
				ra_5106 = fdt_getprop(ra_5106, s1_5108, 588001016, dwLocF8, 0x00, dwLocBC, dwLoc28, dwArg08, out s0_5132, out s1_14224, out a0_5123, out a1_14225, out a3_14226, out a4_14227, out a5_14228, out s2_14229, out s3_14230, out s4_14231, out s5_14232, out s6_14233, out s8_14234);
				Eq_2 s1_5143 = 0x00;
				if (a0_5123 != null)
					s1_5143 = fdt32_to_cpu(*a0_5123);
				if ((word32) s0_5132->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_14250;
						xTaskGetTickCountFromISR(out a5_14250);
					}
					else
					{
						word32 a5_14249;
						xTaskGetTickCount(out a5_14249);
					}
					word32 a0_14251;
					word32 a2_14253;
					word32 a3_14254;
					word32 a5_14256;
					word32 s3_14258;
					word32 s4_14259;
					word32 s5_14260;
					word32 s10_14265;
					word32 s11_14266;
					word32 s9_14264;
					word32 s6_14261;
					word32 s8_14263;
					word32 s7_14262;
					word32 s2_14257;
					word32 a4_14255;
					word32 a1_14252;
					ra_5106 = bl_printk(ra_5106, &g_t230C2F08, 0x230C23DC, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_5143, out a0_14251, out a1_14252, out a2_14253, out a3_14254, out a4_14255, out a5_14256, out s2_14257, out s3_14258, out s4_14259, out s5_14260, out s6_14261, out s7_14262, out s8_14263, out s9_14264, out s10_14265, out s11_14266);
				}
				ble_controller_set_tx_pwr(s1_5143);
			}
			gpOut = dwArgD8;
			return ra_5106;
		}
		word32 a0_4615;
		word32 s3_4627;
		word32 s6_14138;
		word32 s8_14139;
		word32 s4_14136;
		word32 s5_14137;
		word32 s0_14135;
		Eq_2 s2_4626;
		Eq_2 s1_4625;
		Eq_2 ra_4623 = fdt_stringlist_count(ra_4598, s1_4600, 0x230BE99C, a0_4590, dwLocF8, dwLocDC, dwLoc48, s9, out s0_14135, out s1_4625, out a0_4615, out s2_4626, out s3_4627, out s4_14136, out s5_14137, out s6_14138, out s8_14139);
		if (a0_4615 == 0x01)
		{
			Eq_2 a0_4641;
			up32 a5_4646;
			struct Eq_380323 * s0_4650;
			word32 s6_14146;
			word32 s8_14147;
			word32 a1_14140;
			word32 a4_14142;
			word32 s4_14144;
			word32 s5_14145;
			word32 s3_14143;
			word32 a3_14141;
			Eq_2 a2_4643;
			ra_4623 = fdt_stringlist_get(ra_4623, s1_4625, s3_4627 + -0x0664, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_4650, out s1_4625, out a0_4641, out a1_14140, out a2_4643, out a3_14141, out a4_14142, out a5_4646, out s2_4626, out s3_14143, out s4_14144, out s5_14145, out s6_14146, out s8_14147);
			Eq_2 s3_4663 = a0_4641;
			if (a5_4646 <= ~0x1E)
			{
				if ((word32) s0_4650->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
				{
					if (g_t4200F560 != 0x00)
					{
						word32 a5_14178;
						xTaskGetTickCountFromISR(out a5_14178);
					}
					else
					{
						word32 a5_14177;
						xTaskGetTickCount(out a5_14177);
					}
					word32 s10_14203;
					word32 s11_14204;
					word32 s8_14201;
					word32 s9_14202;
					word32 a1_14193;
					word32 a5_14196;
					word32 s4_14197;
					word32 s7_14200;
					word32 s5_14198;
					word32 s6_14199;
					word32 a3_14194;
					word32 a4_14195;
					word32 a0_14192;
					ra_4623 = bl_printk(ra_4623, &g_t230C2DFC, 0x230C23DC, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_4625, out a0_14192, out a1_14193, out a2_4643, out a3_14194, out a4_14195, out a5_14196, out s2_4626, out s3_4663, out s4_14197, out s5_14198, out s6_14199, out s7_14200, out s8_14201, out s9_14202, out s10_14203, out s11_14204);
				}
				word32 a1_14170;
				word32 a5_14174;
				word32 a7_14176;
				word32 a6_14175;
				word32 a2_14171;
				word32 a4_14173;
				word32 a3_14172;
				memcpy(fp - 0x00A0, s3_4663, a2_4643, out a1_14170, out a2_14171, out a3_14172, out a4_14173, out a5_14174, out a6_14175, out a7_14176);
				(word32) s3_4663 + (fp - 64) + 4000 = (ptr32) 0x00;
l23069394:
				word32 a0_4756;
				word32 s4_4769;
				word32 s5_14208;
				word32 s8_14210;
				word32 s6_14209;
				word32 s3_14207;
				word32 s2_14206;
				word32 s0_14205;
				Eq_2 s1_4766;
				Eq_2 ra_4764 = fdt_stringlist_count(ra_4623, s1_4625, 587983356, s2_4626, dwLocF8, dwLocDC, dwLoc48, s9, out s0_14205, out s1_4766, out a0_4756, out s2_14206, out s3_14207, out s4_4769, out s5_14208, out s6_14209, out s8_14210);
				if (a0_4756 == 0x01)
				{
					Eq_2 a0_4782;
					up32 a5_4787;
					struct Eq_380356 * s0_4791;
					word32 s8_14156;
					word32 s5_14154;
					word32 s3_14152;
					word32 a4_14150;
					word32 a1_14148;
					word32 s6_14155;
					word32 s4_14153;
					word32 s2_14151;
					word32 a3_14149;
					Eq_2 a2_4784;
					ra_4764 = fdt_stringlist_get(ra_4764, s1_4766, s4_4769 + -0x0604, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_4791, out s1_4766, out a0_4782, out a1_14148, out a2_4784, out a3_14149, out a4_14150, out a5_4787, out s2_14151, out s3_14152, out s4_14153, out s5_14154, out s6_14155, out s8_14156);
					Eq_2 s4_4804 = a0_4782;
					if (a5_4787 <= ~0x1E)
					{
						if ((word32) s0_4791->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
						{
							if (g_t4200F560 != 0x00)
							{
								word32 a5_14275;
								xTaskGetTickCountFromISR(out a5_14275);
							}
							else
							{
								word32 a5_14274;
								xTaskGetTickCount(out a5_14274);
							}
							word32 a1_14286;
							word32 s2_14290;
							word32 s5_14292;
							word32 s6_14293;
							word32 s7_14294;
							word32 s9_14296;
							word32 s10_14297;
							word32 s11_14298;
							word32 s8_14295;
							word32 s3_14291;
							word32 a3_14287;
							word32 a5_14289;
							word32 a4_14288;
							word32 a0_14285;
							ra_4764 = bl_printk(ra_4764, &g_t230C2E44, 0x230C23DC, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_4766, out a0_14285, out a1_14286, out a2_4784, out a3_14287, out a4_14288, out a5_14289, out s2_14290, out s3_14291, out s4_4804, out s5_14292, out s6_14293, out s7_14294, out s8_14295, out s9_14296, out s10_14297, out s11_14298);
						}
						word32 a1_14267;
						word32 a3_14269;
						word32 a4_14270;
						word32 a5_14271;
						word32 a7_14273;
						word32 a6_14272;
						word32 a2_14268;
						memcpy(fp - 0x0080, s4_4804, a2_4784, out a1_14267, out a2_14268, out a3_14269, out a4_14270, out a5_14271, out a6_14272, out a7_14273);
						(word32) s4_4804 + (fp - 64) + 0x0FC0 = (ptr32) 0x00;
l230693AC:
						union Eq_2 * a0_4898;
						struct Eq_380402 * s0_4907;
						word32 a5_14280;
						word32 s4_14282;
						word32 s8_14284;
						word32 s5_14283;
						word32 s2_14281;
						word32 a3_14278;
						word32 a4_14279;
						word32 s1_14276;
						word32 a1_14277;
						Eq_2 s3_4910;
						Eq_2 ra_4906 = fdt_getprop(ra_4764, s1_4766, 588000904, dwLocF8, 0x00, dwLocBC, dwLoc28, dwArg08, out s0_4907, out s1_14276, out a0_4898, out a1_14277, out a3_14278, out a4_14279, out a5_14280, out s2_14281, out s3_4910, out s4_14282, out s5_14283, out s6_4605, out s8_14284);
						union Eq_2 * s2_4918 = a0_4898;
						if (a0_4898 != null)
						{
							if ((word32) s0_4907->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
							{
								if (g_t4200F560 != 0x00)
								{
									word32 a5_14158;
									xTaskGetTickCountFromISR(out a5_14158);
								}
								else
								{
									word32 a5_14157;
									xTaskGetTickCount(out a5_14157);
								}
								fdt32_to_cpu(*a0_4898);
								word32 s9_14246;
								word32 s11_14248;
								word32 s10_14247;
								word32 s1_14235;
								word32 s8_14245;
								word32 s7_14244;
								word32 a0_14236;
								word32 s5_14243;
								word32 s4_14242;
								word32 a1_14237;
								word32 a2_14238;
								word32 a3_14239;
								word32 a5_14241;
								word32 a4_14240;
								ra_4906 = bl_printk(ra_4906, &g_t230C2E9C, 0x230C23DC, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_14235, out a0_14236, out a1_14237, out a2_14238, out a3_14239, out a4_14240, out a5_14241, out s2_4918, out s3_4910, out s4_14242, out s5_14243, out s6_4605, out s7_14244, out s8_14245, out s9_14246, out s10_14247, out s11_14248);
							}
							fdt32_to_cpu(*s2_4918);
						}
						ra_4598 = bl_wifi_sta_info_set(ra_4906, fp - 0x00A0, s3_4910, fp - 0x0080, dwArg28, out s1_4600, out s2_4610);
						goto l2306942E;
					}
				}
				goto l230693AC;
			}
		}
		goto l23069394;
	}
	word32 a0_4134;
	word32 s3_4146;
	word32 s0_14016;
	word32 s8_14020;
	word32 s4_14017;
	word32 s6_14019;
	word32 s5_14018;
	Eq_2 s2_4145;
	Eq_2 s1_4144;
	Eq_2 ra_4142 = fdt_stringlist_count(ra_4117, s1_4119, 0x230BE99C, a0_4109, dwLocF8, dwLocDC, dwLoc48, s9, out s0_14016, out s1_4144, out a0_4134, out s2_4145, out s3_4146, out s4_14017, out s5_14018, out s6_14019, out s8_14020);
	if (a0_4134 == 0x01)
	{
		Eq_2 a0_4160;
		up32 a5_4165;
		struct Eq_379845 * s0_4169;
		word32 s5_14026;
		word32 s8_14028;
		word32 s6_14027;
		word32 s3_14024;
		word32 s4_14025;
		word32 a3_14022;
		word32 a4_14023;
		word32 a1_14021;
		Eq_2 a2_4162;
		ra_4142 = fdt_stringlist_get(ra_4142, s1_4144, s3_4146 + -0x0664, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_4169, out s1_4144, out a0_4160, out a1_14021, out a2_4162, out a3_14022, out a4_14023, out a5_4165, out s2_4145, out s3_14024, out s4_14025, out s5_14026, out s6_14027, out s8_14028);
		Eq_2 s3_4182 = a0_4160;
		if (a5_4165 <= ~0x1E)
		{
			if ((word32) s0_4169->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_14073;
					xTaskGetTickCountFromISR(out a5_14073);
				}
				else
				{
					word32 a5_14072;
					xTaskGetTickCount(out a5_14072);
				}
				word32 s10_14106;
				word32 s11_14107;
				word32 a0_14095;
				word32 s9_14105;
				word32 s8_14104;
				word32 a1_14096;
				word32 s7_14103;
				word32 s6_14102;
				word32 a3_14097;
				word32 a4_14098;
				word32 a5_14099;
				word32 s5_14101;
				word32 s4_14100;
				ra_4142 = bl_printk(ra_4142, &g_t230C2D78, 0x230C23DC, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_4144, out a0_14095, out a1_14096, out a2_4162, out a3_14097, out a4_14098, out a5_14099, out s2_4145, out s3_4182, out s4_14100, out s5_14101, out s6_14102, out s7_14103, out s8_14104, out s9_14105, out s10_14106, out s11_14107);
			}
			word32 a3_14067;
			word32 a5_14069;
			word32 a6_14070;
			word32 a7_14071;
			word32 a4_14068;
			word32 a1_14065;
			word32 a2_14066;
			memcpy(fp - 0x00A0, s3_4182, a2_4162, out a1_14065, out a2_14066, out a3_14067, out a4_14068, out a5_14069, out a6_14070, out a7_14071);
			(word32) s3_4182 + (fp - 64) + 4000 = (ptr32) 0x00;
l230692C8:
			word32 a0_4275;
			word32 s5_4289;
			word32 s8_14094;
			word32 s4_14092;
			word32 s2_14090;
			word32 s6_14093;
			word32 s3_14091;
			word32 s0_14089;
			Eq_2 s1_4285;
			Eq_2 ra_4283 = fdt_stringlist_count(ra_4142, s1_4144, 587983356, s2_4145, dwLocF8, dwLocDC, dwLoc48, s9, out s0_14089, out s1_4285, out a0_4275, out s2_14090, out s3_14091, out s4_14092, out s5_4289, out s6_14093, out s8_14094);
			if (a0_4275 == 0x01)
			{
				Eq_2 a0_4301;
				up32 a5_4306;
				struct Eq_379878 * s0_4310;
				word32 s4_14034;
				word32 s2_14032;
				word32 s3_14033;
				word32 s5_14035;
				word32 s6_14036;
				word32 s8_14037;
				word32 a3_14030;
				word32 a4_14031;
				word32 a1_14029;
				Eq_2 a2_4303;
				ra_4283 = fdt_stringlist_get(ra_4283, s1_4285, s5_4289 + -0x0604, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_4310, out s1_4285, out a0_4301, out a1_14029, out a2_4303, out a3_14030, out a4_14031, out a5_4306, out s2_14032, out s3_14033, out s4_14034, out s5_14035, out s6_14036, out s8_14037);
				Eq_2 s5_4323 = a0_4301;
				if (a5_4306 <= ~0x1E)
				{
					if ((word32) s0_4310->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
					{
						if (g_t4200F560 != 0x00)
						{
							word32 a5_14064;
							xTaskGetTickCountFromISR(out a5_14064);
						}
						else
						{
							word32 a5_14063;
							xTaskGetTickCount(out a5_14063);
						}
						word32 a1_14109;
						word32 a4_14111;
						word32 s2_14113;
						word32 s3_14114;
						word32 s6_14116;
						word32 s8_14118;
						word32 s9_14119;
