pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
						word32 s10_14120;
						word32 s11_14121;
						word32 s7_14117;
						word32 s4_14115;
						word32 a5_14112;
						word32 a3_14110;
						word32 a0_14108;
						ra_4283 = bl_printk(ra_4283, &g_t230C2DB8, 0x230C23DC, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_4285, out a0_14108, out a1_14109, out a2_4303, out a3_14110, out a4_14111, out a5_14112, out s2_14113, out s3_14114, out s4_14115, out s5_4323, out s6_14116, out s7_14117, out s8_14118, out s9_14119, out s10_14120, out s11_14121);
					}
					word32 a1_14056;
					word32 a3_14058;
					word32 a4_14059;
					word32 a5_14060;
					word32 a6_14061;
					word32 a7_14062;
					word32 a2_14057;
					memcpy(fp - 0x0080, s5_4323, a2_4303, out a1_14056, out a2_14057, out a3_14058, out a4_14059, out a5_14060, out a6_14061, out a7_14062);
					(word32) s5_4323 + (fp - 64) + 0x0FC0 = (ptr32) 0x00;
l230692E0:
					union Eq_2 * a0_4417;
					struct Eq_379913 * s0_4426;
					word32 s2_14127;
					word32 s5_14129;
					word32 s8_14130;
					word32 s4_14128;
					word32 a4_14125;
					word32 a5_14126;
					word32 a3_14124;
					word32 a1_14123;
					word32 s1_14122;
					Eq_2 s3_4429;
					Eq_2 ra_4425 = fdt_getprop(ra_4283, s1_4285, 587983448, dwLocF8, 0x00, dwLocBC, dwLoc28, dwArg08, out s0_4426, out s1_14122, out a0_4417, out a1_14123, out a3_14124, out a4_14125, out a5_14126, out s2_14127, out s3_4429, out s4_14128, out s5_14129, out s6_4124, out s8_14130);
					union Eq_2 * s2_4437 = a0_4417;
					if (a0_4417 != null)
					{
						if ((word32) s0_4426->b06B4 <= 0x02 && (word32) g_b420267A1 <= 0x02)
						{
							if (g_t4200F560 != 0x00)
							{
								word32 a5_14039;
								xTaskGetTickCountFromISR(out a5_14039);
							}
							else
							{
								word32 a5_14038;
								xTaskGetTickCount(out a5_14038);
							}
							fdt32_to_cpu(*a0_4417);
							word32 a5_14046;
							word32 s7_14049;
							word32 s9_14051;
							word32 s11_14053;
							word32 s10_14052;
							word32 s8_14050;
							word32 s5_14048;
							word32 s4_14047;
							word32 a4_14045;
							word32 a3_14044;
							word32 a2_14043;
							word32 a1_14042;
							word32 a0_14041;
							word32 s1_14040;
							ra_4425 = bl_printk(ra_4425, &g_t230BEA64, 0x230C23DC, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_14040, out a0_14041, out a1_14042, out a2_14043, out a3_14044, out a4_14045, out a5_14046, out s2_4437, out s3_4429, out s4_14047, out s5_14048, out s6_4124, out s7_14049, out s8_14050, out s9_14051, out s10_14052, out s11_14053);
						}
						fdt32_to_cpu(*s2_4437);
					}
					else if ((word32) s0_4426->b06B4 <= 0x04 && (word32) g_b420267A1 <= 0x04)
					{
						if (g_t4200F560 != 0x00)
						{
							word32 a5_14055;
							xTaskGetTickCountFromISR(out a5_14055);
						}
						else
						{
							word32 a5_14054;
							xTaskGetTickCount(out a5_14054);
						}
						word32 s11_14088;
						word32 s9_14086;
						word32 s10_14087;
						word32 a5_14080;
						word32 s4_14082;
						word32 s7_14084;
						word32 s8_14085;
						word32 s5_14083;
						word32 s2_14081;
						word32 a3_14078;
						word32 a4_14079;
						word32 a1_14076;
						word32 a2_14077;
						word32 s1_14074;
						word32 a0_14075;
						ra_4425 = bl_printk(ra_4425, &g_t230BEAA0, 0x230C23DC, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_14074, out a0_14075, out a1_14076, out a2_14077, out a3_14078, out a4_14079, out a5_14080, out s2_14081, out s3_4429, out s4_14082, out s5_14083, out s6_4124, out s7_14084, out s8_14085, out s9_14086, out s10_14087, out s11_14088);
					}
					ra_4117 = bl_wifi_ap_info_set(ra_4425, fp - 0x00A0, s3_4429, fp - 0x0080, dwArg28, out s1_4119, out s2_4129);
					goto l23069364;
				}
			}
			goto l230692E0;
		}
	}
	goto l230692C8;
}

// 230697D2: Register Eq_2 bl_tsen_adc_get(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a0, Register word32 a1, Register Eq_113940 fs1, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Register out ptr32 s0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 fs1Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      wifi_mgmr_start
Eq_2 bl_tsen_adc_get(Eq_2 ra, Eq_2 s0, ptr32 a0, word32 a1, Eq_113940 fs1, ptr32 fflags, ptr32 frm, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, ptr32 & s0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & fs1Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	word32 * a5_130 = (word32 *) 0x0FFFFFFF;
	word32 s0_190 = 0x4200ECBA;
	if ((word32) g_w4200ECBA == 0x0FFFFFFF)
	{
		g_w4200ECBA = 0x00;
		word32 a5_446;
		word32 a6_447;
		word32 a7_448;
		word32 a1_442;
		word32 a2_443;
		word32 a4_445;
		word32 a3_444;
		memcpy(fp + -64, 588001104, 0x0E, out a1_442, out a2_443, out a3_444, out a4_445, out a5_446, out a6_447, out a7_448);
		GLB_Set_ADC_CLK(0x01, 0x00, 0x07);
		ADC_Disable();
		ADC_Enable();
		ADC_Reset();
		ADC_Init(fp + -64);
		word32 a1_70 = ADC_Channel_Config(0x0E, 0x17, 0x00);
		ADC_FIFO_Cfg(fp + -0x0044, ADC_Tsen_Init(0x00));
		struct Eq_381047 * sp_86;
		Eq_2 ra_93;
		word32 a0_94;
		g_t4200C9E8();
		Eq_2 a5_111 = g_t4200F560;
		if (a0_94 == 0x01)
		{
			if (a5_111 != 0x00)
			{
				word32 a5_450;
				xTaskGetTickCountFromISR(out a5_450);
			}
			else
			{
				word32 a5_449;
				xTaskGetTickCount(out a5_449);
			}
			word32 s1_468;
			word32 a2_471;
			word32 a1_470;
			word32 a4_473;
			word32 a0_469;
			word32 s2_474;
			word32 a3_472;
			word32 s4_476;
			word32 s5_477;
			word32 s3_475;
			word32 s7_479;
			word32 s8_480;
			word32 s6_478;
			word32 s10_482;
			word32 s11_483;
			word32 s9_481;
			ra = bl_printk(ra_93, &g_t230C2FD4, 588001188, sp_86->t0008, sp_86->t0028, sp_86->t0070, sp_86->t0074, sp_86->t0098, sp_86->t00BC, out s1_468, out a0_469, out a1_470, out a2_471, out a3_472, out a4_473, out a5_130, out s2_474, out s3_475, out s4_476, out s5_477, out s6_478, out s7_479, out s8_480, out s9_481, out s10_482, out s11_483);
		}
		else
		{
			if (a5_111 != 0x00)
			{
				word32 a5_485;
				xTaskGetTickCountFromISR(out a5_485);
			}
			else
			{
				word32 a5_484;
				xTaskGetTickCount(out a5_484);
			}
			word32 s1_486;
			word32 a2_489;
			word32 a1_488;
			word32 a0_487;
			word32 a3_490;
			word32 a4_491;
			word32 s2_492;
			word32 s3_493;
			word32 s4_494;
			word32 s5_495;
			word32 s6_496;
			word32 s7_497;
			word32 s8_498;
			word32 s9_499;
			word32 s10_500;
			word32 s11_501;
			ra = bl_printk(ra_93, &g_t230C3000, 588001188, sp_86->t0008, sp_86->t0028, sp_86->t0070, sp_86->t0074, sp_86->t0098, sp_86->t00BC, out s1_486, out a0_487, out a1_488, out a2_489, out a3_490, out a4_491, out a5_130, out s2_492, out s3_493, out s4_494, out s5_495, out s6_496, out s7_497, out s8_498, out s9_499, out s10_500, out s11_501);
		}
	}
	Eq_8966 fa0_217;
	ptr32 fflags_220;
	ptr32 frm_221;
	ptr32 fs1_223;
	ptr32 s0_225;
	word32 s3_230;
	word16 * s2_229;
	ptr32 a1_210;
	Eq_2 ra_224 = TSEN_Get_Temp(ra, s0_190, a5_130, fs1, fflags, frm, dwLoc0C, s0, out s0_225, out a1_210, out s2_229, out s3_230, out fs1_223, out fa0_217, out fflags_220, out frm_221);
	if (s3_230 != 0x00)
	{
		Eq_2 a1_247;
		__extendsfdf2(ra_224, fa0_217, fflags_220, frm_221, out a1_247);
		word32 s3_458;
		word32 a5_456;
		word32 a7_457;
		word32 s9_464;
		word32 s8_463;
		word32 s10_465;
		word32 s6_461;
		word32 s7_462;
		word32 t4_467;
		word32 s11_466;
		word32 s5_460;
		word32 s4_459;
		word32 s1_451;
		word32 a0_452;
		word32 a2_453;
		word32 a4_455;
		word32 a3_454;
		printf(ra_224, &g_t230C3024, a1_247, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_451, out a0_452, out a1_210, out a2_453, out a3_454, out a4_455, out a5_456, out a7_457, out s2_229, out s3_458, out s4_459, out s5_460, out s6_461, out s7_462, out s8_463, out s9_464, out s10_465, out s11_466, out t4_467);
	}
	if (s2_229 != null)
		*s2_229 = (word16) (int32) fa0_217;
	s0Out = s0_225;
	a1Out = a1_210;
	a3Out = s2;
	fs1Out = fs1_223;
	fflagsOut = fflags_220;
	frmOut = frm_221;
	return dwLoc08;
}

// 230698FC: Register word32 bl_rtc_get_counter(Register Eq_2 a4, Register out ptr32 a1Out)
// Called from:
//      bl_rtc_get_timestamp_ms
word32 bl_rtc_get_counter(Eq_2 a4, ptr32 & a1Out)
{
	word32 a0_9 = HBN_Get_RTC_Timer_Val(fp + ~0x17, fp + ~0x13, a4);
	a1Out = fp + ~0x13;
	return a0_9;
}

// 23069912: Register ui32 bl_rtc_get_timestamp_ms(Register Eq_2 a4, Register out Eq_337245 a3Out)
// Called from:
//      bl_sys_time_sync_state
ui32 bl_rtc_get_timestamp_ms(Eq_2 a4, union Eq_337245 & a3Out)
{
	uint32 a1_8;
	uint32 a0_7 = bl_rtc_get_counter(a4, out a1_8);
	a3Out = a1_8 >> 0x05;
	return (a0_7 >> 0x05 | a1_8 << 0x1B) - ((a1_8 << 0x14 | a0_7 >> 0x0C) + (a0_7 >> 11 | a1_8 << 0x15));
}

// 23069962: Register Eq_2 hal_wifi_start_firmware_task(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg01A4, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      cmd_stack_wifi
Eq_2 hal_wifi_start_firmware_task(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArgD8, Eq_2 dwArg01A4, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s6Out, ptr32 & s7Out)
{
	ptr32 s1_23;
	ptr32 a4_29;
	ptr32 s2_32;
	ptr32 s3_33;
	ptr32 s6_35;
	ptr32 s7_36;
	word32 tp_55;
	word32 t0_56;
	word32 s0_57;
	word32 a0_58;
	word32 a2_59;
	word32 a3_60;
	word32 a5_61;
	Eq_2 ra_31 = xTaskCreateStatic(ra, &g_ptr23001354, 0x230C3050, 0x0600, 0x00, 0x1E, 0x42018BE4, 1107403748, mstatus, dwLoc0C, dwArg14, dwArgD8, dwArg01A4, out tp_55, out t0_56, out s0_57, out s1_23, out a0_58, out a2_59, out a3_60, out a4_29, out a5_61, out s2_32, out s3_33, out s6_35, out s7_36);
	s1Out = s1_23;
	a4Out = a4_29;
	s2Out = s2_32;
	s3Out = s3_33;
	s6Out = s6_35;
	s7Out = s7_36;
	return ra_31;
}

