pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306999A: void PtTable_Update_Entry(Register word32 a1, Register Eq_2 a2, Register Eq_2 a3)
// Called from:
//      hal_boot2_update_ptable
void PtTable_Update_Entry(word32 a1, Eq_2 a2, Eq_2 a3)
{
	if (a3 == 0x00 || a2 == 0x00)
		return;
	if (a1 == 0x02)
		return;
	word32 s4_110 = 0x0E000000;
	if (a1 != 0x00)
		s4_110 = 0x0F000000;
	struct Eq_381329 * a4_27 = (word32) *((word32) a2 + 6);
	Eq_2 a5_32 = (word32) a2 + 16;
	struct Eq_381329 * s1_33 = null;
	a3_100 = a3;
	a2_101 = a2;
	while (true)
	{
		Eq_2 a2_101;
		Eq_2 a3_100;
		if (s1_33 >= a4_27)
			break;
		a2_101 = (word32) *a5_32;
		a3_100 = (word32) *a3;
		a5_32 = (word32) a5_32 + 36;
		if (a2_101 == a3_100)
		{
			word32 a4_356;
			word32 a5_357;
			word32 a7_359;
			word32 a6_358;
			word32 a1_355;
			memcpy(a5_32, a3, 36, out a1_355, out a2_101, out a3_100, out a4_356, out a5_357, out a6_358, out a7_359);
			break;
		}
		s1_33 = (struct Eq_381329 *) ((char *) s1_33 + 1);
	}
	struct Eq_381329 * a5_62 = (word32) *((word32) a2 + 6);
	if (a5_62 == s1_33)
	{
		if (s1_33 > (struct Eq_381329 *) 0x0F)
			return;
		word32 a5_363;
		word32 a4_362;
		word32 a7_365;
		word32 a6_364;
		word32 a1_361;
		memcpy(&s1_33->dw0008 + 7 + ((word32) a2 + 16) / 0x0C, a3, 36, out a1_361, out a2_101, out a3_100, out a4_362, out a5_363, out a6_364, out a7_365);
		word32 a5_87 = (word32) *((word32) a2 + 6);
		*((word32) a2 + 6) = (word16) (a5_87 + 0x01);
		a5_62 = a5_87 + 0x01;
	}
	word32 s0_92 = a5_62->dw0008;
	struct Eq_381381 * a5_95 = (char *) a5_62 + 1;
	a5_95->dw0008 = s0_92;
	struct Eq_381387 * a0_116;
	word32 a3_117;
	word32 a2_118;
	word32 s2_119;
	struct Eq_381391 * s0_121;
	word32 s3_123;
	word32 s4_124;
	g_t4200C9DE();
	word32 s1_137 = (word32) s0_121->w0006;
	a0_116->ptr000C = s0_121;
	word32 a0_145;
	ptr32 s2_148;
	Eq_2 ra_149;
	Eq_2 s0_150;
	int32 s1_151;
	word32 s4_153;
	word32 t3_156;
	word32 s8_157;
	word32 a6_158;
	word32 a7_160;
	word32 t0_161;
	word32 t1_162;
	word32 t4_163;
	word32 t5_164;
	word32 t6_165;
	g_t4200C9DE();
	s2_148 + s1_151 = a0_145;
	ui32 a0_170;
	word32 a4_171;
	word32 a1_360;
	Eq_2 ra_175 = bl_flash_erase(ra_149, s4_153, s1_151 + 20, out a0_170, out a1_360, out a4_171);
	if ((a0_170 & 0x00FF) == 0x00)
	{
		ui32 a0_180;
		word32 a1_366;
		word32 a5_368;
		word32 a4_367;
		bl_flash_write(ra_175, s4_153, s0_150, 596, out a0_180, out a1_366, out a4_367, out a5_368);
		if ((a0_180 & 0x00FF) == 0x00)
			;
	}
}

// 23069A82: Register (ptr32 Eq_374687) PtTable_Get_Active_Entries(Register (ptr32 Eq_374687) a0, Register ui32 a1, Register Eq_2 a2)
// Called from:
//      hal_boot2_get_active_entries
struct Eq_374687 * PtTable_Get_Active_Entries(struct Eq_374687 * a0, ui32 a1, Eq_2 a2)
{
	if (a0 == null)
		return (struct Eq_374687 *) 0x05;
	if (a2 == 0x00)
		return (struct Eq_374687 *) 0x05;
	up32 a0_9 = (word32) a0->w0006;
	struct Eq_381511 * a3_10 = &a0->w0006 + 5;
	up32 a5_11;
	for (a5_11 = 0x34; a5_11 < a0_9; ++a5_11)
	{
		++a3_10;
		if ((word32) a3_10->bFFFFFFDC == a1)
		{
			word32 a7_94;
			word32 a6_93;
			word32 a5_92;
			word32 a4_91;
			word32 a3_90;
			word32 a2_89;
			word32 a1_88;
			memcpy(a2, a0 + (a5_11 + 0x00) / 8, 36, out a1_88, out a2_89, out a3_90, out a4_91, out a5_92, out a6_93, out a7_94);
			return null;
		}
	}
	return (struct Eq_374687 *) 0x02;
}

// 23069AD6: void int_timer_cb(Register Eq_2 s0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0188)
void int_timer_cb(Eq_2 s0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0188)
{
	TIMER_ClearIntStatus(0x00, a4);
	word32 a3_16;
	word32 a0_26;
	word32 s4_76;
	word32 s3_75;
	word32 s2_74;
	word32 a4_73;
	word32 s1_72;
	xTaskIncrementTick(s0, a4, mstatus, dwArg0188, out s1_72, out a0_26, out a3_16, out a4_73, out s2_74, out s3_75, out s4_76);
	if (a0_26 == 0x00)
		return;
	word32 a4_78;
	word32 a0_77;
	word32 a5_79;
	vTaskSwitchContext(a3_16, mstatus, out a0_77, out a4_78, out a5_79);
}

// 23069AF6: Register Eq_2 bl_timer_now_us(Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 code) a5Out)
// Called from:
//      iperf_server_udp_recv_fn
//      bloop_run
Eq_2 bl_timer_now_us(ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, <anonymous> & a5Out)
{
	do
	{
		Eq_2 a1_9 = *(union Eq_2 *) 0x0200BFFC;
		Eq_2 a0_10 = *(union Eq_2 *) 0x0200BFF8;
	} while (a1_9 != *((union Eq_2 *) 0x0200BFFC));
	ptr32 a1_15;
	ptr32 a4_16;
	<anonymous> * a5_17;
	ptr32 a3_21;
	Eq_2 a0_14 = __udivdi3(a0_10, a1_9, 0x0A, 0x00, out a1_15, out a3_21, out a4_16, out a5_17);
	a1Out = a1_15;
	a2Out = dwArg10;
	a3Out = a3_21;
	a4Out = a4_16;
	a5Out = a5_17;
	return a0_14;
}

// 23069B1C: void bl_timer_tick_enable(Register Eq_2 ra, Stack word32 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C)
// Called from:
//      cmd_timer_start
void bl_timer_tick_enable(Eq_2 ra, word32 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C)
{
	byte bLoc28 = (byte) dwLoc28;
	word32 a1_134;
	word32 a2_135;
	word32 a3_136;
	word32 a4_137;
	word32 a5_138;
	word32 a6_139;
	word32 a7_140;
	memcpy(fp + -40, 0x230C3054, 0x18, out a1_134, out a2_135, out a3_136, out a4_137, out a5_138, out a6_139, out a7_140);
	TIMER_IntMask(0x03, 0x01);
	TIMER_Disable((word32) bLoc28);
	Eq_2 a4_39;
	Eq_2 s2_42;
	Eq_2 s1_41 = TIMER_Init(fp + -40, (ui32 *) 0x01, dwArg08, out a4_39, out s2_42);
	TIMER_ClearIntStatus(0x00, a4_39);
	TIMER_ClearIntStatus(0x01, a4_39);
	TIMER_ClearIntStatus(0x02, a4_39);
	TIMER_IntMask(0x00, 0x00);
	TIMER_IntMask(0x01, 0x01);
	TIMER_IntMask(0x02, 0x01);
	TIMER_Enable((word32) bLoc28);
	bl_irq_enable((struct Eq_127708 *) 53);
	word32 s0_141;
	word32 s1_142;
	word32 a3_143;
	word32 s2_144;
	word32 s3_145;
	bl_irq_register(ra, s1_41, 53, 0x23069AD6, s2_42, dwLoc28, dwLoc08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg40, dwArg44, dwArg48, dwArg5C, dwArg68, dwArg6C, dwArg8C, out s0_141, out s1_142, out a3_143, out s2_144, out s3_145);
}

