pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23069BB2: Register word32 bl_gpio_enable_output(Register word32 a1, Register word32 a2)
// Called from:
//      cmd_gpio_func
//      loopset_led_trigger
word32 bl_gpio_enable_output(word32 a1, word32 a2)
{
	word32 ra_31;
	g_t4200C5D8();
	return ra_31;
}

// 23069BF6: void bl_gpio_enable_input(Register word32 a1, Register word32 a2)
// Called from:
//      cmd_gpio_func
void bl_gpio_enable_input(word32 a1, word32 a2)
{
	g_t4200C5D8();
}

// 23069C38: void bl_gpio_output_set(Register ui32 a0, Register word32 a1, Register (ptr32 word32) a3)
// Called from:
//      cmd_gpio_set
//      _cb_led_trigger
void bl_gpio_output_set(ui32 a0, word32 a1, word32 * a3)
{
	GLB_GPIO_Write(a0, (word32) (a1 != 0x00), a3);
}

// 23069C4C: Register uint32 bl_gpio_input_get(Register uint32 a0, Register (ptr32 byte) a1)
// Called from:
//      cmd_gpio_get
uint32 bl_gpio_input_get(uint32 a0, byte * a1)
{
	*a1 = (byte) GLB_GPIO_Read(a0);
	return 0x00;
}

// 23069C64: Register Eq_2 bl_flash_erase(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a4Out)
// Called from:
//      PtTable_Update_Entry
//      bl_mtd_erase
//      bl_mtd_erase_all
Eq_2 bl_flash_erase(Eq_2 ra, word32 a0, Eq_2 a1, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a4Out)
{
	ptr32 a4_6 = (word32) g_b4200F211;
	if (a4_6 == 0x00)
	{
		a0Out = ~0x00;
		a1Out = a1;
		a4Out = a4_6;
		return ra;
	}
	else
	{
		<anonymous> * a4_12 = *(<anonymous> **) 0x21010AB0;
		ptr32 a4_20;
		Eq_2 ra_21;
		Eq_2 a1_22;
		a4_12();
		a0Out = 0x00;
		a1Out = a1_22;
		a4Out = a4_20;
		return ra_21;
	}
}

// 23069C94: Register Eq_2 bl_flash_write(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      PtTable_Update_Entry
//      bl_mtd_write
Eq_2 bl_flash_write(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a2, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a4_6 = (word32) g_b4200F211;
	if (a4_6 == 0x00)
	{
		a0Out = ~0x00;
		a1Out = a1;
		a4Out = a4_6;
		a5Out = 0x4200F200;
		return ra;
	}
	else
	{
		<anonymous> * a4_12 = *(<anonymous> **) 0x21010AAC;
		ptr32 a5_21;
		ptr32 a4_22;
		Eq_2 ra_23;
		Eq_2 a1_26;
		a4_12();
		a0Out = 0x00;
		a1Out = a1_26;
		a4Out = a4_22;
		a5Out = a5_21;
		return ra_23;
	}
}

// 23069CC6: Register Eq_2 bl_flash_read(Register Eq_2 ra, Register word32 a0, Register ptr32 a1, Register Eq_2 a2, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bl_mtd_read
Eq_2 bl_flash_read(Eq_2 ra, word32 a0, ptr32 a1, Eq_2 a2, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a4_6 = (word32) g_b4200F211;
	if (a4_6 == 0x00)
	{
		a1Out = a1;
		a3Out = a3;
		a4Out = a4_6;
		return ra;
	}
	else
	{
		<anonymous> * a4_12 = *(<anonymous> **) 0x21010AA8;
		ptr32 a4_22;
		Eq_2 ra_23;
		ptr32 a3_25;
		ptr32 a1_26;
		a4_12();
		a1Out = a1_26;
		a3Out = a3_25;
		a4Out = a4_22;
		return ra_23;
	}
}

// 23069CF8: Register Eq_2 bl_flash_config_update(Register Eq_2 ra, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out ptr32 s1Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      hal_boot2_init
Eq_2 bl_flash_config_update(Eq_2 ra, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, ptr32 & s1Out, union Eq_2 & s2Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out)
{
	if ((word32) g_b420266B4 <= 0x02 && (word32) g_b420267A3 <= 0x02)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_491;
			xTaskGetTickCountFromISR(out a5_491);
		}
		else
		{
			word32 a5_490;
			xTaskGetTickCount(out a5_490);
		}
		struct Eq_381938 * s3_58;
		struct Eq_381818 * s4_59;
		word32 s11_513;
		word32 s8_512;
		word32 a0_504;
		word32 s7_511;
		word32 s5_510;
		word32 a5_509;
		word32 a4_508;
		word32 a3_507;
		word32 a2_506;
		word32 a1_505;
		ra = bl_printk(ra, &g_t230C3078, 588001388, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_504, out a1_505, out a2_506, out a3_507, out a4_508, out a5_509, out s2, out s3_58, out s4_59, out s5_510, out s6, out s7_511, out s8_512, out s9, out s10, out s11_513);
		if ((word32) s3_58->b06B4 <= 0x02 && (word32) s4_59->b07A3 <= 0x02)
		{
			if (*((word32) s2 + 0x0560) != 0x00)
			{
				word32 a5_493;
				xTaskGetTickCountFromISR(out a5_493);
			}
			else
			{
				word32 a5_492;
				xTaskGetTickCount(out a5_492);
			}
			struct Eq_382166 * s3_103;
			struct Eq_381838 * s4_104;
			word32 a0_566;
			word32 a1_567;
			word32 a2_568;
			word32 a3_569;
			word32 a4_570;
			word32 a5_571;
			word32 s5_572;
			word32 s7_573;
			word32 s8_574;
			word32 s11_575;
			ra = bl_printk(ra, &g_t230C30C4, s1 + 0x006C, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_566, out a1_567, out a2_568, out a3_569, out a4_570, out a5_571, out s2, out s3_103, out s4_104, out s5_572, out s6, out s7_573, out s8_574, out s9, out s10, out s11_575);
			if ((word32) s3_103->b06B4 <= 0x02 && (word32) s4_104->b07A3 <= 0x02)
			{
				if (*((word32) s2 + 0x0560) != 0x00)
				{
					word32 a5_495;
					xTaskGetTickCountFromISR(out a5_495);
				}
				else
				{
					word32 a5_494;
					xTaskGetTickCount(out a5_494);
				}
				struct Eq_382127 * s3_147;
				struct Eq_381858 * s4_148;
				word32 a0_556;
				word32 a1_557;
				word32 a2_558;
				word32 a3_559;
				word32 a4_560;
				word32 a5_561;
				word32 s5_562;
				word32 s7_563;
				word32 s8_564;
				word32 s11_565;
				ra = bl_printk(ra, &g_t230C30E4, s1 + 0x006C, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_556, out a1_557, out a2_558, out a3_559, out a4_560, out a5_561, out s2, out s3_147, out s4_148, out s5_562, out s6, out s7_563, out s8_564, out s9, out s10, out s11_565);
				if ((word32) s3_147->b06B4 <= 0x02 && (word32) s4_148->b07A3 <= 0x02)
				{
					if (*((word32) s2 + 0x0560) != 0x00)
					{
						word32 a5_497;
						xTaskGetTickCountFromISR(out a5_497);
					}
					else
					{
						word32 a5_496;
						xTaskGetTickCount(out a5_496);
					}
					word32 a0_546;
					struct Eq_382089 * s3_191;
					struct Eq_381878 * s4_192;
					word32 a1_547;
					word32 a2_548;
					word32 a3_549;
					word32 a4_550;
					word32 a5_551;
					word32 s5_552;
					word32 s7_553;
					word32 s8_554;
					word32 s11_555;
					ra = bl_printk(ra, &g_t230C3108, s1 + 0x006C, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_546, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551, out s2, out s3_191, out s4_192, out s5_552, out s6, out s7_553, out s8_554, out s9, out s10, out s11_555);
					if ((word32) s3_191->b06B4 <= 0x02 && (word32) s4_192->b07A3 <= 0x02)
					{
						if (*((word32) s2 + 0x0560) != 0x00)
						{
							word32 a5_499;
							xTaskGetTickCountFromISR(out a5_499);
						}
						else
						{
							word32 a5_498;
							xTaskGetTickCount(out a5_498);
						}
						word32 a0_536;
						word32 a1_537;
						word32 a2_538;
						word32 a3_539;
						word32 a4_540;
						word32 a5_541;
						word32 s5_542;
						word32 s7_543;
						word32 s8_544;
						word32 s11_545;
						struct Eq_382059 * s3_235;
						struct Eq_381898 * s4_236;
						ra = bl_printk(ra, &g_t230C3130, s1 + 0x006C, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_536, out a1_537, out a2_538, out a3_539, out a4_540, out a5_541, out s2, out s3_235, out s4_236, out s5_542, out s6, out s7_543, out s8_544, out s9, out s10, out s11_545);
						if ((word32) s3_235->b06B4 <= 0x02 && (word32) s4_236->b07A3 <= 0x02)
						{
							if (*((word32) s2 + 0x0560) != 0x00)
							{
								word32 a5_501;
								xTaskGetTickCountFromISR(out a5_501);
							}
							else
							{
								word32 a5_500;
								xTaskGetTickCount(out a5_500);
							}
							word32 a0_526;
							word32 a1_527;
							word32 a2_528;
							word32 a3_529;
							word32 a4_530;
							word32 a5_531;
							word32 s5_532;
							word32 s7_533;
							word32 s8_534;
							word32 s11_535;
							struct Eq_382020 * s3_279;
							struct Eq_381918 * s4_280;
							ra = bl_printk(ra, &g_t230C315C, s1 + 0x006C, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_526, out a1_527, out a2_528, out a3_529, out a4_530, out a5_531, out s2, out s3_279, out s4_280, out s5_532, out s6, out s7_533, out s8_534, out s9, out s10, out s11_535);
							if ((word32) s3_279->b06B4 <= 0x02 && (word32) s4_280->b07A3 <= 0x02)
							{
								if (*((word32) s2 + 0x0560) != 0x00)
								{
									word32 a5_503;
									xTaskGetTickCountFromISR(out a5_503);
								}
								else
								{
									word32 a5_502;
									xTaskGetTickCount(out a5_502);
								}
								word32 s11_525;
								word32 s8_524;
								word32 s7_523;
								word32 s5_522;
								word32 s4_521;
								word32 s3_520;
								word32 a5_519;
								word32 a4_518;
								word32 a3_517;
								word32 a2_516;
								word32 a1_515;
								word32 a0_514;
								ra = bl_printk(ra, &g_t230C3184, s1 + 0x006C, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_514, out a1_515, out a2_516, out a3_517, out a4_518, out a5_519, out s2, out s3_520, out s4_521, out s5_522, out s6, out s7_523, out s8_524, out s9, out s10, out s11_525);
							}
						}
					}
				}
			}
		}
	}
	s1Out = s1;
	s2Out = s2;
	s4Out = dwArg04;
	s6Out = s6;
	s8Out = s4;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

// 23069F06: void bl_flash_get_flashCfg()
// Called from:
//      bl_hbn_enter
void bl_flash_get_flashCfg()
{
}

