pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 23069F10: void bl_wdt_feed()
// Called from:
//      cmd_wdt_feed
void bl_wdt_feed()
{
	WDT_ResetCounterValue();
}

// 23069F14: void bl_wdt_disable()
// Called from:
//      cmd_wdt_disable
void bl_wdt_disable()
{
	WDT_Disable();
}

// 23069F18: void bl_wdt_init(Register Eq_2 a0)
// Called from:
//      cmd_wdt_init
void bl_wdt_init(Eq_2 a0)
{
	if (a0 > 0x00FFFFFE)
		return;
	WDT_Disable();
	WDT_Set_Clock(0x01, 0x01);
	WDT_SetCompValue(a0 << 0x14 >> 16);
	WDT_ResetCounterValue();
	WDT_IntMask(0x00, 0x01);
	WDT_Enable();
}

// 23069F5E: void proc_entry_looprt(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg5C, Stack word32 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138)
void proc_entry_looprt(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg5C, word32 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0138)
{
proc_entry_looprt_entry:
	bloop_run(ra, s1, 0x4201A444, a1, a2, a3, a4, s5, s6, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg4C, dwArg5C, dwArgC8, dwArgF8, dwArg0138)
l23069F5E:
l23069F74:
	Eq_2 a2_22
	Eq_2 a5_23
	Eq_2 a4_26
	word32 a0_65
	word32 a1_66
	word32 s4_67
	word32 s8_68
	puts((word32) s0_43 + 508, out a0_65, out a1_66, out a2_22, out a4_26, out a5_23, out s4_67, out s8_68)
	Eq_2 a3_39
	word32 s1_69
	word32 a0_70
	word32 a1_71
	word32 a2_72
	word32 a4_73
	word32 a5_74
	word32 s2_75
	word32 s3_76
	word32 s4_77
	Eq_2 s0_43 = vTaskDelay(1000, a2_22, a3_39, a4_26, a5_23, mstatus, sp->t0024, sp->t0028, sp->t0138, sp->t0178, out s1_69, out a0_70, out a1_71, out a2_72, out a3_39, out a4_73, out a5_74, out s2_75, out s3_76, out s4_77)
	Eq_2 a2_22
	goto l23069F74
proc_entry_looprt_exit:
}

// 23069F86: Register Eq_2 looprt_evt_notify_async(Register Eq_2 ra, Register up32 a0, Register ui32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      cmd_looprt_test_evt
//      cmd_looprt_test_evt_dump
//      loopset_led_trigger
Eq_2 looprt_evt_notify_async(Eq_2 ra, up32 a0, ui32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_20;
	ptr32 s1_23;
	Eq_2 ra_21 = bloop_evt_set_async(ra, 0x4201A444, a0, a1, a3, a4, mstatus, dwArg08, dwArg14, dwArg38, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s1_23, out mstatus_20);
	s0Out = s0_22;
	s1Out = s1_23;
	a4Out = a4_18;
	a5Out = a5_19;
	s2Out = s2_24;
	s3Out = s3_25;
	mstatusOut = mstatus_20;
	return ra_21;
}

// 23069F96: void looprt_evt_status_dump()
// Called from:
//      looprt_start
//      cmd_looprt_test
//      cmd_looprt_test_status
void looprt_evt_status_dump()
{
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg32 = <invalid>;
	Eq_2 stackArg36 = <invalid>;
	Eq_2 stackArg108 = <invalid>;
	Eq_2 stackArg268 = <invalid>;
	word32 s0_12;
	word32 s1_13;
	word32 a3_14;
	word32 s5_15;
	bloop_status_dump(ra, a3, s5, stackArg32, stackArg36, stackArg108, stackArg268, out s0_12, out s1_13, out a3_14, out s5_15);
}

// 23069FA2: void looprt_evt_schedule(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      cmd_looprt_test_schedule_evt1
//      cmd_looprt_test_schedule_evt2
void looprt_evt_schedule(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg94, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a0_25;
	struct Eq_382441 * s2_34;
	word32 a1_127;
	word32 s1_126;
	word32 a2_128;
	word32 a3_129;
	word32 a4_130;
	word32 a5_131;
	word32 a6_132;
	word32 s3_133;
	word32 s4_134;
	word32 s8_135;
	pvPortMalloc(ra, a2, 36, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_126, out a0_25, out a1_127, out a2_128, out a3_129, out a4_130, out a5_131, out a6_132, out s2_34, out s3_133, out s4_134, out s8_135);
	if (a0_25 == 0x00)
		return;
	Eq_2 s0_69 = bloop_timer_configure(a0_25, bloop_timer_init(ra, a0_25, 0x01), 0x00, s2_34, dwArg94);
	word32 a3_136;
	word32 a4_137;
	word32 a5_138;
	bloop_timer_register(0x4201A444, s0_69, out a3_136, out a4_137, out a5_138);
}

// 23069FFE: Register Eq_2 looprt_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a6, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0194, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      aos_loop_proc
Eq_2 looprt_start(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a6, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0194, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_2 s1_26;
	word32 s3_127;
	Eq_2 ra_25 = bloop_init(ra, 0x4201A444, dwLoc08, dwArg18, dwArg40, dwArg44, s1, dwArg8C, out s1_26, out s3_127);
	Eq_2 a5_47 = bloop_handler_register(0x4201A444, 0x4200E108, 0x1F);
	looprt_evt_status_dump();
	Eq_2 a2_62;
	Eq_2 a5_63;
	ptr32 s0_65;
	Eq_2 a3_71;
	Eq_2 a4_72;
	word32 tp_128;
	word32 t0_129;
	word32 s1_130;
	word32 a0_131;
	word32 s2_132;
	word32 s3_133;
	word32 s6_134;
	word32 s7_135;
	Eq_2 ra_74 = xTaskCreateStatic(ra_25, &g_ptr23069F5E, 0x230C31F0, s1_26, 0x00, 0x1A, a5_47, a6, mstatus, a2, dwArg04, dwArgC8, dwArg0194, out tp_128, out t0_129, out s0_65, out s1_130, out a0_131, out a2_62, out a3_71, out a4_72, out a5_63, out s2_132, out s3_133, out s6_134, out s7_135);
	ptr32 a3_87;
	ptr32 s2_92;
	ptr32 s3_93;
	ptr32 s1_91 = bloop_wait_startup(a2_62, a3_71, a4_72, a5_63, mstatus, dwLoc0C, dwLoc08, dwArg0108, dwArg0148, out a3_87, out s2_92, out s3_93);
	s0Out = s0_65;
	s1Out = s1_91;
	a3Out = a3_87;
	s2Out = s2_92;
	s3Out = s3_93;
	return ra_74;
}

// 2306A060: void looprt_start_auto(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      cmd_looprt_test
void looprt_start_auto(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 s1_18;
	Eq_2 s3_22;
	Eq_2 ra_17 = bloop_init(ra, 0x4201A444, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_18, out s3_22);
	bloop_handler_register(0x4201A444, 0x4200E108, 0x1F);
	looprt_evt_status_dump();
	Eq_2 a2_53;
	Eq_2 a3_54;
	Eq_2 a4_55;
	Eq_2 a5_56;
	word32 s1_107;
	word32 a0_108;
	word32 s2_109;
	word32 s3_110;
	xTaskCreate(ra_17, s1_18, 0x01000000, 0x00, 0x1A, 0x00, s3_22, mstatus, dwArg00, dwArg04, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_107, out a0_108, out a2_53, out a3_54, out a4_55, out a5_56, out s2_109, out s3_110);
	word32 a3_111;
	word32 s2_112;
	word32 s3_113;
	bloop_wait_startup(a2_53, a3_54, a4_55, a5_56, mstatus, dwArg04, dwArg08, dwArg0118, dwArg0158, out a3_111, out s2_112, out s3_113);
}

// 2306A0B6: Register Eq_2 looprt_handler_register(Register int32 a0, Register uint32 a1, Register out Eq_2 a5Out)
// Called from:
//      loopset_led_hook_on_looprt
Eq_2 looprt_handler_register(int32 a0, uint32 a1, union Eq_2 & a5Out)
{
	if (g_dw4201A444 == 0x00)
	{
		a5Out.u0 = 0x4201A000;
		return <invalid>;
	}
	else
	{
		a5Out = bloop_handler_register(0x4201A444, a0, a1);
		return <invalid>;
	}
}

// 2306A0D0: Register word32 looprt_timer_register(Register Eq_2 a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      _led_bloop_evt
word32 looprt_timer_register(Eq_2 a0, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a3_11;
	ptr32 a4_12;
	ptr32 a5_13;
	bloop_timer_register(0x4201A444, a0, out a3_11, out a4_12, out a5_13);
	a4Out = a4_12;
	a5Out = a5_13;
	return a3_11;
}

