pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306A0EA: void cmd_looprt_test(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void cmd_looprt_test(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	word32 a0_118;
	word32 a1_119;
	word32 a2_120;
	word32 a4_121;
	word32 a5_122;
	word32 s4_123;
	word32 s8_124;
	puts(0x230C3220, out a0_118, out a1_119, out a2_120, out a4_121, out a5_122, out s4_123, out s8_124);
	Eq_2 a3_27;
	word32 s1_125;
	word32 a0_126;
	word32 a1_127;
	word32 a2_128;
	word32 a4_129;
	word32 a5_130;
	word32 a7_131;
	word32 s2_132;
	word32 s3_133;
	word32 s4_134;
	word32 s5_135;
	word32 s6_136;
	word32 s7_137;
	word32 s8_138;
	word32 s9_139;
	word32 s10_140;
	word32 s11_141;
	word32 t4_142;
	word32 s1_143;
	word32 a0_144;
	word32 a1_145;
	word32 a2_146;
	word32 a3_147;
	word32 a4_148;
	word32 a5_149;
	word32 a7_150;
	word32 s2_151;
	word32 s3_152;
	word32 s4_153;
	word32 s5_154;
	word32 s6_155;
	word32 s7_156;
	word32 s8_157;
	word32 s9_158;
	word32 s10_159;
	word32 s11_160;
	word32 t4_161;
	Eq_2 ra_55 = printf(printf(ra, &g_t230C323C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_125, out a0_126, out a1_127, out a2_128, out a3_27, out a4_129, out a5_130, out a7_131, out s2_132, out s3_133, out s4_134, out s5_135, out s6_136, out s7_137, out s8_138, out s9_139, out s10_140, out s11_141, out t4_142), &g_t230C325C, a3_27, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_143, out a0_144, out a1_145, out a2_146, out a3_147, out a4_148, out a5_149, out a7_150, out s2_151, out s3_152, out s4_153, out s5_154, out s6_155, out s7_156, out s8_157, out s9_158, out s10_159, out s11_160, out t4_161);
	looprt_start_auto(ra_55, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg9C, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158);
}

// 2306A120: void cmd_looprt_test_status()
void cmd_looprt_test_status()
{
	word32 a0_23;
	word32 a1_24;
	word32 a2_25;
	word32 a4_26;
	word32 a5_27;
	word32 s4_28;
	word32 s8_29;
	puts(0x230C3300, out a0_23, out a1_24, out a2_25, out a4_26, out a5_27, out s4_28, out s8_29);
	looprt_evt_status_dump();
}

// 2306A138: void cmd_looprt_test_evt(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128)
void cmd_looprt_test_evt(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128)
{
	Eq_2 a4_13;
	word32 a0_54;
	word32 a1_55;
	word32 a2_56;
	word32 a5_57;
	word32 s4_58;
	word32 s8_59;
	puts(0x230C3270, out a0_54, out a1_55, out a2_56, out a4_13, out a5_57, out s4_58, out s8_59);
	word32 s0_60;
	word32 s1_61;
	word32 a4_62;
	word32 a5_63;
	word32 s2_64;
	word32 s3_65;
	word32 mstatus_66;
	looprt_evt_notify_async(ra, 0x1F, 0x00, a3, a4_13, mstatus, dwArg08, dwArg14, dwArg38, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_60, out s1_61, out a4_62, out a5_63, out s2_64, out s3_65, out mstatus_66);
}

// 2306A154: void cmd_looprt_test_evt_dump(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128)
void cmd_looprt_test_evt_dump(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128)
{
	Eq_2 a4_13;
	word32 a0_54;
	word32 a1_55;
	word32 a2_56;
	word32 a5_57;
	word32 s4_58;
	word32 s8_59;
	puts(0x230C328C, out a0_54, out a1_55, out a2_56, out a4_13, out a5_57, out s4_58, out s8_59);
	word32 s0_60;
	word32 s1_61;
	word32 a4_62;
	word32 a5_63;
	word32 s2_64;
	word32 s3_65;
	word32 mstatus_66;
	looprt_evt_notify_async(ra, 0x1F, 0x01, a3, a4_13, mstatus, dwArg08, dwArg14, dwArg38, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_60, out s1_61, out a4_62, out a5_63, out s2_64, out s3_65, out mstatus_66);
}

// 2306A170: void cmd_looprt_test_schedule_evt1(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void cmd_looprt_test_schedule_evt1(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg94, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a5_10;
	Eq_2 a4_13;
	word32 a0_52;
	word32 a1_53;
	word32 a2_54;
	word32 s4_55;
	word32 s8_56;
	puts(0x230C32B0, out a0_52, out a1_53, out a2_54, out a4_13, out a5_10, out s4_55, out s8_56);
	looprt_evt_schedule(ra, 0x04FFFE20, a3, a4_13, a5_10, mstatus, dwArg20, dwArg24, dwArg94, dwArg0118, dwArg0158);
}

// 2306A192: void cmd_looprt_test_schedule_evt2(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void cmd_looprt_test_schedule_evt2(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg94, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a5_10;
	Eq_2 a4_13;
	word32 a0_52;
	word32 a1_53;
	word32 a2_54;
	word32 s4_55;
	word32 s8_56;
	puts(588002008, out a0_52, out a1_53, out a2_54, out a4_13, out a5_10, out s4_55, out s8_56);
	looprt_evt_schedule(ra, 0x02000710, a3, a4_13, a5_10, mstatus, dwArg20, dwArg24, dwArg94, dwArg0118, dwArg0158);
}

// 2306A1B4: void looprt_test_cli_init()
// Called from:
//      aos_loop_proc
void looprt_test_cli_init()
{
}

// 2306A1B8: void _cb_led_trigger(Register Eq_2 ra, Register (ptr32 Eq_382978) a1, Register (ptr32 word32) a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void _cb_led_trigger(Eq_2 ra, struct Eq_382978 * a1, word32 * a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	bl_gpio_output_set((word32) a1->ptr0038->b0030, (word32) (a1 != null), a3);
	struct Eq_382997 * a5_21 = (struct Eq_382997 *) 0x01;
	if ((word32) g_b420267A4 <= 0x01)
	{
		up32 a4_23 = (word32) g_b420267A5;
		if (a4_23 <= 0x01)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_151;
				xTaskGetTickCountFromISR(out a5_151);
			}
			else
			{
				word32 a5_150;
				xTaskGetTickCount(out a5_150);
			}
			word32 s1_152;
			word32 a0_153;
			word32 a1_154;
			word32 a2_155;
			word32 a3_156;
			word32 a4_157;
			word32 s2_158;
			word32 s3_159;
			word32 s4_160;
			word32 s5_161;
			word32 s6_162;
			word32 s7_163;
			word32 s8_164;
			word32 s9_165;
			word32 s10_166;
			word32 s11_167;
			bl_printk(ra, &g_t230C3404, 588002292, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_152, out a0_153, out a1_154, out a2_155, out a3_156, out a4_157, out a5_21, out s2_158, out s3_159, out s4_160, out s5_161, out s6_162, out s7_163, out s8_164, out s9_165, out s10_166, out s11_167);
		}
	}
	((word32[]) 56)[(word32) (a5_21 < (struct Eq_382997 *) 1) / 4] = a5_21->dw0038;
}

// 2306A246: void _led_bloop_msg(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void _led_bloop_msg(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	if ((word32) g_b420267A4 > 0x01 || (word32) g_b420267A5 > 0x01)
		return;
	if (g_t4200F560 != 0x00)
	{
		word32 a5_158;
		xTaskGetTickCountFromISR(out a5_158);
	}
	else
	{
		word32 a5_157;
		xTaskGetTickCount(out a5_157);
	}
	word32 s11_175;
	word32 s10_174;
	word32 s9_173;
	word32 s8_172;
	word32 s7_171;
	word32 s6_170;
	word32 s5_169;
	word32 s4_168;
	word32 s3_167;
	word32 s2_166;
	word32 a5_165;
	word32 a4_164;
	word32 a3_163;
	word32 a2_162;
	word32 a1_161;
	word32 a0_160;
	word32 s1_159;
	bl_printk(ra, &g_t230C34C0, 588002292, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_159, out a0_160, out a1_161, out a2_162, out a3_163, out a4_164, out a5_165, out s2_166, out s3_167, out s4_168, out s5_169, out s6_170, out s7_171, out s8_172, out s9_173, out s10_174, out s11_175);
}

// 2306A2C6: void _led_bloop_evt(Register Eq_2 ra, Register (ptr32 Eq_2) s1, Register (ptr32 Eq_383140) a1, Register Eq_2 s6, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
void _led_bloop_evt(Eq_2 ra, union Eq_2 * s1, struct Eq_383140 * a1, Eq_2 s6, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128)
{
	Eq_2 a3_162 = *s1;
	struct Eq_383140 * s9_153 = a1;
	Eq_2 s8_152 = a3_162;
	do
	{
		if ((s1 & 1) != 0x00)
			s1 &= ~0x01;
		else
		{
			if ((s1 & 2) == 0x00)
			{
				if (s1 == null)
					break;
				word32 s5_525;
				word32 a7_521;
				word32 a0_515;
				word32 s1_514;
				word32 s8_528;
				word32 s9_529;
				word32 s10_530;
				word32 s11_531;
				word32 t4_532;
				word32 a2_517;
				word32 a1_516;
				word32 a4_519;
				word32 a3_518;
				word32 a5_520;
				word32 s4_524;
				word32 s3_523;
				word32 s2_522;
				word32 s6_526;
				word32 s7_527;
				printf(ra, &g_t230C3498, a3_162, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_514, out a0_515, out a1_516, out a2_517, out a3_518, out a4_519, out a5_520, out a7_521, out s2_522, out s3_523, out s4_524, out s5_525, out s6_526, out s7_527, out s8_528, out s9_529, out s10_530, out s11_531, out t4_532);
				while (true)
					;
			}
			struct Eq_383170 * s2_146 = s9_153->ptr000C;
			struct Eq_383174 * s3_147 = null;
			struct Eq_383174 * s0_105 = s2_146->ptr000C;
			if (s0_105 != null)
				s3_147 = s0_105->ptr0004;
			while (s0_105 != (char *) (&s2_146->ptr0004) + 4)
			{
				if ((word32) g_b420267A4 <= 0x02)
				{
					struct Eq_383275 * a4_85 = (word32) g_b420267A5;
					if (a4_85 <= (struct Eq_383275 *) 0x02)
					{
						if (g_t4200F560 != 0x00)
						{
							word32 a5_534;
							xTaskGetTickCountFromISR(out a5_534);
						}
						else
						{
							word32 a5_533;
							xTaskGetTickCount(out a5_533);
						}
						s0_105 = a4_85->ptr002C;
						word32 s10_545;
						word32 s11_546;
						word32 a0_535;
						word32 a1_536;
						word32 a2_537;
						word32 a3_538;
						word32 s7_544;
						word32 a4_539;
						word32 a5_540;
						word32 s4_541;
						word32 s5_542;
						word32 s6_543;
						ra = bl_printk(ra, &g_t230C344C, 588002292, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1, out a0_535, out a1_536, out a2_537, out a3_538, out a4_539, out a5_540, out s2_146, out s3_147, out s4_541, out s5_542, out s6_543, out s7_544, out s8_152, out s9_153, out s10_545, out s11_546);
					}
				}
				struct Eq_383170 * a4_163;
				struct Eq_383170 * a5_164;
				a3_162 = looprt_timer_register((char *) &s0_105->ptr0004 + 4, out a4_163, out a5_164);
				struct Eq_383170 * s0_169 = a4_163->ptr0000;
				a5_164->ptr0004 = a4_163;
				a4_163->ptr0000 = a5_164;
				struct Eq_383170 * a5_173 = s2_146->ptr0004;
				s0_169->ptr0000 = s2_146;
				a5_173->ptr0004 = s0_169;
				s2_146->ptr0004 = s0_169;
				s0_169->ptr0000 = a5_173;
				struct Eq_383174 * a5_178 = null;
				if (s3_147 != null)
					a5_178 = s3_147->ptr0004;
				s0_105 = s3_147;
				s3_147 = a5_178;
			}
			s1 &= ~0x02;
		}
	} while (s1 != null);
	*s8_152 = 0x00;
	0x00 = dwArg0128;
}

// 2306A3FE: Register word32 loopset_led_hook_on_looprt(Register out ptr32 a5Out)
// Called from:
//      aos_loop_proc
word32 loopset_led_hook_on_looprt(ptr32 & a5Out)
{
	g_dw4201A8E8 = 0x4201A8E4;
	g_dw4201A8E4 = 0x4201A8E4;
	g_dw4201A8F8 = 0x4201A8E4;
	g_dw4201A8F4 = 0x4201A8E4;
	ptr32 a5_16;
	word32 a4_15 = looprt_handler_register(588002480, 0x01, out a5_16);
	a5Out = a5_16;
	return a4_15;
}

