pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306A420: Register Eq_2 loopset_led_trigger(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_372883) s0Out, Register out Eq_372884 s1Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_372887) s2Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      hal_gpio_init_from_dts
Eq_2 loopset_led_trigger(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, struct Eq_372883 & s0Out, union Eq_372884 & s1Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_372887 & s2Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_23;
	Eq_2 s2_32;
	Eq_2 s3_33;
	word32 s1_209;
	word32 a1_210;
	word32 a2_211;
	word32 a3_212;
	word32 a4_213;
	word32 a5_214;
	word32 a6_215;
	word32 s4_216;
	word32 s8_217;
	pvPortMalloc(ra, s1, 60, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_209, out a0_23, out a1_210, out a2_211, out a3_212, out a4_213, out a5_214, out a6_215, out s2_32, out s3_33, out s4_216, out s8_217);
	if (a0_23 != 0x00)
	{
		word32 t1_218;
		word32 a0_219;
		word32 a1_220;
		word32 a2_221;
		word32 a3_222;
		word32 a4_223;
		word32 a5_224;
		Eq_2 ra_47 = memset(ra, a0_23, 0x00, 60, out t1_218, out a0_219, out a1_220, out a2_221, out a3_222, out a4_223, out a5_224);
		*((word32) a0_23 + 48) = s2_32;
		Eq_2 s1_61 = bloop_timer_init(ra_47, (word32) a0_23 + 8, 0x00);
		bloop_timer_repeat_enable(s1_61);
		Eq_2 s0_78 = bloop_timer_configure(s1_61, s3_33, a0_23, (struct Eq_382441 *) 0x01, dwArg94);
		Eq_2 ra_89 = bl_gpio_enable_output(0x00, 0x00);
		word32 a5_225;
		Eq_2 a4_92 = vTaskEnterCritical(0x01, mstatus, out a5_225);
		struct Eq_383436 * a5_94 = *((word32) a4_92 + 0x0C);
		a5_94->t0008 = s0_78;
		*((word32) a4_92 + 4) = s0_78;
		*((word32) s0_78 + 0x0C) = a5_94;
		*s0_78 = a4_92;
		Eq_2 a4_102;
		word32 a5_226;
		Eq_2 a3_101 = vTaskExitCritical(&a5_94->t0008, mstatus, out a4_102, out a5_226);
		ptr32 a4_115;
		ptr32 a5_116;
		ptr32 mstatus_117;
		struct Eq_372883 * s0_119;
		Eq_372884 s1_120;
		struct Eq_372887 * s2_121;
		ptr32 s3_122;
		Eq_2 ra_118 = looprt_evt_notify_async(ra_89, 0x01, 0x02, a3_101, a4_102, mstatus, dwArg08, dwArg14, dwArg38, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_119, out s1_120, out a4_115, out a5_116, out s2_121, out s3_122, out mstatus_117);
		s0Out = s0_119;
		s1Out = s1_120;
		a4Out = a4_115;
		a5Out = a5_116;
		s2Out = s2_121;
		s3Out = s3_122;
		mstatusOut = mstatus_117;
		return ra_118;
	}
	else
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_228;
			xTaskGetTickCountFromISR(out a5_228);
		}
		else
		{
			word32 a5_227;
			xTaskGetTickCount(out a5_227);
		}
		word32 s1_229;
		word32 a0_230;
		word32 a1_231;
		word32 a2_232;
		word32 a3_233;
		word32 a4_234;
		word32 a5_235;
		word32 s2_236;
		word32 s3_237;
		word32 s4_238;
		word32 s5_239;
		word32 s6_240;
		word32 s7_241;
		word32 s8_242;
		word32 s9_243;
		word32 s10_244;
		word32 s11_245;
		bl_printk(ra, &g_t230B1CAC, 588002292, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_229, out a0_230, out a1_231, out a2_232, out a3_233, out a4_234, out a5_235, out s2_236, out s3_237, out s4_238, out s5_239, out s6_240, out s7_241, out s8_242, out s9_243, out s10_244, out s11_245);
		while (true)
			;
	}
}

// 2306A4F0: Register word32 sys_mbox_new(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out (ptr32 Eq_383539) a0Out, Register out Eq_2 a2Out, Register out Eq_383541 a3Out, Register out ptr32 a4Out, Register out Eq_383543 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      tcpip_init
//      netconn_alloc
//      lwip_netconn_do_listen
word32 sys_mbox_new(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148, struct Eq_383539 & a0Out, union Eq_2 & a2Out, union Eq_383541 & a3Out, ptr32 & a4Out, union Eq_383543 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	struct Eq_123301 ** a0_17;
	word32 s1_25;
	ptr32 s2_26;
	ptr32 s3_27;
	ptr32 s4_28;
	word32 a3_81;
	word32 a4_82;
	word32 a2_80;
	word32 a1_79;
	word32 a5_83;
	*a0_17 = (struct Eq_123301 **) xQueueGenericCreate(ra, 50, 0x04, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s1_25, out a0_17, out a1_79, out a2_80, out a3_81, out a4_82, out a5_83, out s2_26, out s3_27, out s4_28);
	uint32 a5_38 = (word32) g_w420268F0 + 0x01 << 16;
	Eq_383541 a3_36 = (word32) g_w420268F2;
	g_w420268F0 = (word16) (a5_38 >> 16);
	if (a3_36 < a5_38 >> 16)
		g_w420268F2 = (word16) (a5_38 >> 16);
	a0Out = 0x00 - (word32) (a0_17 < (struct Eq_123301 **) 1);
	a2Out = dwArg10;
	a3Out = a3_36;
	a4Out = 0x420267F0;
	a5Out = a5_38 >> 16;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	return s1_25;
}

// 2306A53A: Register word32 sys_mbox_free(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_383614 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      netconn_new_with_proto_and_callback
//      netconn_alloc
//      netconn_drain
//      accept_function
//      lwip_netconn_do_listen
word32 sys_mbox_free(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_383614 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	Eq_2 a3_20;
	Eq_2 a4_21;
	word32 a2_70;
	word32 a5_71;
	Eq_2 a0_18 = uxQueueMessagesWaiting(*a0, a3, a4, mstatus, out a2_70, out a3_20, out a4_21, out a5_71);
	if (a0_18 != 0x00)
		g_w420268F4 = (word16) ((word32) g_w420268F4 + 0x01);
	ptr32 a0_33;
	ptr32 a3_36;
	Eq_383614 a4_37;
	word32 s1_41;
	ptr32 s4_42;
	word32 a1_72;
	word32 a2_73;
	word32 a5_74;
	struct Eq_123468 * s0_40 = vQueueDelete(a0_18, a3_20, a4_21, mstatus, dwArg0148, dwArg0188, out s1_41, out a0_33, out a1_72, out a2_73, out a3_36, out a4_37, out a5_74, out s4_42);
	word32 a5_45 = (word32) s0_40->w0100;
	s0_40->w0100 = (word16) (a5_45 + ~0x00);
	a0Out = a0_33;
	a2Out = dwArg10;
	a3Out = a3_36;
	a4Out = a4_37;
	a5Out = a5_45 + ~0x00;
	s4Out = s4_42;
	return s1_41;
}

// 2306A57A: Register Eq_2 sys_mbox_post(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_383683) s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      tcpip_callback
//      tcpip_send_msg_wait_sem
//      tcpip_api_call
Eq_2 sys_mbox_post(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, struct Eq_383683 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s6Out)
{
	do
	{
		ptr32 a3_28;
		struct Eq_383683 * s1_34;
		ptr32 s2_35;
		ptr32 s5_38;
		ptr32 s6_39;
		word32 a2_82;
		word32 a1_81;
		word32 a7_83;
		word32 s3_84;
		word32 s4_85;
		word32 s8_86;
		Eq_2 s0_33 = xQueueGenericSend(a0, fp + ~0x13, 0x00, a4, a5, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_34, out a0, out a1_81, out a2_82, out a3_28, out a4, out a5, out a7_83, out s2_35, out s3_84, out s4_85, out s5_38, out s6_39, out s8_86);
	} while (a0 != s0_33);
	s1Out = s1_34;
	a3Out = a3_28;
	a4Out = a4;
	s2Out = s2_35;
	s5Out = s5_38;
	s6Out = s6_39;
	return s0_33;
}

// 2306A5A2: Register Eq_2 sys_mbox_trypost(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_383735) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_383738) a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      tcpip_input
//      tcpip_try_callback
//      recv_udp
//      err_tcp
//      recv_raw
//      recv_tcp
//      accept_function
Eq_2 sys_mbox_trypost(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, struct Eq_383735 & a1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_383738 & a5Out, ptr32 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_40;
	word32 a0_16;
	struct Eq_383735 * a1_17;
	ptr32 a3_19;
	ptr32 a7_23;
	ptr32 s1_25;
	ptr32 s2_26;
	ptr32 s3_27;
	ptr32 s4_28;
	ptr32 s5_29;
	ptr32 s6_30;
	word32 s8_97;
	word32 a5_96;
	word32 a2_95;
	ptr32 a4_20;
	Eq_2 s0_24 = xQueueGenericSend(*a0, fp + ~0x13, 0x00, a4, a5, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_25, out a0_16, out a1_17, out a2_95, out a3_19, out a4_20, out a5_96, out a7_23, out s2_26, out s3_27, out s4_28, out s5_29, out s6_30, out s8_97);
	struct Eq_383738 * a5_39 = (struct Eq_383738 *) 0x01;
	if (a0_16 != 0x01)
	{
		word32 a4_43 = (word32) g_w420268F4;
		g_w420268F4 = (word16) (a4_43 + 0x01);
		a5_39 = (struct Eq_383738 *) &g_t420267F0;
		a0_40 = ~0x00;
		a4_20 = a4_43 + 0x01;
	}
	else
		a0_40 = 0x00;
	s1Out = s1_25;
	a0Out = a0_40;
	a1Out = a1_17;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_39;
	a7Out = a7_23;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	s5Out = s5_29;
	s6Out = s6_30;
	return s0_24;
}

// 2306A5D8: Register Eq_2 sys_arch_mbox_fetch(Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg64, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 Eq_385034)) a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 code) a5Out, Register out (ptr32 Eq_2) s2Out, Register out (ptr32 (ptr32 Eq_385034)) s3Out, Register out ptr32 s4Out)
// Called from:
//      tcpip_thread
//      netconn_accept
//      netconn_recv_data
Eq_2 sys_arch_mbox_fetch(union Eq_2 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg64, Eq_2 dwArgD8, Eq_2 dwArg0118, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_385034 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, <anonymous> & a5Out, union Eq_2 & s2Out, struct Eq_385034 & s3Out, ptr32 & s4Out)
{
	Eq_2 a5_21;
	xTaskGetTickCount(out a5_21);
	union Eq_2 * s2_166 = a0;
	Eq_2 s1_164 = a1;
	if (a1 == 0x00)
		s1_164 = fp + -36;
	Eq_2 s0_163;
	<anonymous> * a5_160;
	struct Eq_385034 ** s3_168;
	struct Eq_385034 ** a1_154;
	ptr32 a0_153;
	if (a2 != 0x00)
	{
		word32 a0_72;
		word32 a2_194;
		word32 a5_195;
		word32 s4_196;
		word32 s8_197;
		s0_163 = xQueueReceive(*a0, s1_164, a2, a3, a4, a5_21, mstatus, dwLoc38, dwLoc1C, dwArg64, dwArgD8, dwArg0118, out s1_164, out a0_72, out a1_154, out a2_194, out a3, out a4, out a5_195, out s2_166, out s3_168, out s4_196, out s8_197);
		a5_160 = (<anonymous> *) 0x01;
		if (a0_72 != 0x01)
		{
			*s1_164 = 0x00;
			a0_153 = ~0x00;
			goto l2306A618;
		}
	}
	else
	{
		do
		{
			struct Eq_385034 ** a0_38;
			word32 a2_191;
			word32 s4_192;
			word32 s8_193;
			s0_163 = xQueueReceive(*s2_166, s1_164, ~0x00, a3, a4, a5_21, mstatus, dwLoc38, dwLoc1C, dwArg64, dwArgD8, dwArg0118, out s1_164, out a0_38, out a1_154, out a2_191, out a3, out a4, out a5_21, out s2_166, out s3_168, out s4_192, out s8_193);
		} while (a0_38 != s3_168);
	}
	a0_153 = xTaskGetTickCount(out a5_160) - s0_163;
l2306A618:
	s1Out = s1_164;
	a0Out = a0_153;
	a1Out = a1_154;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_160;
	s2Out = s2_166;
	s3Out = s3_168;
	s4Out = dwArgF4;
	return s0_163;
}

// 2306A638: Register Eq_2 sys_arch_mbox_tryfetch(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 Eq_385034)) a1Out, Register out ptr32 a3Out, Register out Eq_383912 a4Out, Register out ptr32 s2Out, Register out (ptr32 (ptr32 Eq_385034)) s3Out, Register out ptr32 s4Out)
// Called from:
//      netconn_accept
//      netconn_recv_data
//      netconn_drain
Eq_2 sys_arch_mbox_tryfetch(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a0Out, struct Eq_385034 & a1Out, ptr32 & a3Out, union Eq_383912 & a4Out, ptr32 & s2Out, struct Eq_385034 & s3Out, ptr32 & s4Out)
{
	if (a1 == 0x00)
		a1 = fp + ~0x13;
	word32 a0_23;
	struct Eq_385034 ** a1_24;
	ptr32 a3_26;
	Eq_383912 a4_27;
	ptr32 s1_32;
	ptr32 s2_33;
	struct Eq_385034 ** s3_34;
	ptr32 s4_35;
	word32 a2_70;
	word32 a5_71;
	word32 s8_72;
	Eq_2 s0_31 = xQueueReceive(*a0, a1, 0x00, a3, a4, a5, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_32, out a0_23, out a1_24, out a2_70, out a3_26, out a4_27, out a5_71, out s2_33, out s3_34, out s4_35, out s8_72);
	s1Out = s1_32;
	a0Out = 0x00 - (word32) (a0_23 != ~0x00);
	a1Out = a1_24;
	a3Out = a3_26;
	a4Out = a4_27;
	s2Out = s2_33;
	s3Out = s3_34;
	s4Out = s4_35;
	return s0_31;
}

