pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306A658: Register Eq_2 sys_mbox_valid(Register Eq_2 a0)
// Called from:
//      tcpip_input
//      tcpip_callback
//      tcpip_try_callback
//      tcpip_send_msg_wait_sem
//      tcpip_api_call
//      netconn_new_with_proto_and_callback
//      netconn_accept
//      netconn_recv_data
//      netconn_recv_tcp_pbuf_flags
//      recv_udp
//      err_tcp
//      recv_raw
//      recv_tcp
//      netconn_free
//      netconn_drain
//      accept_function
//      lwip_netconn_do_listen
Eq_2 sys_mbox_valid(Eq_2 a0)
{
	return (word32) (*a0 != 0x00);
}

// 2306A660: void sys_mbox_set_invalid(Register Eq_2 a0)
// Called from:
//      netconn_alloc
//      netconn_drain
//      accept_function
//      lwip_netconn_do_listen
void sys_mbox_set_invalid(Eq_2 a0)
{
	*a0 = 0x00;
}

// 2306A666: Register word32 sys_sem_new(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_383984 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      tcpip_api_call
//      netconn_gethostbyname
//      netconn_alloc
word32 sys_sem_new(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_383984 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	word32 s4_203;
	word32 a1_202;
	Eq_2 a0_21;
	Eq_2 a5_26;
	Eq_2 a2_23;
	Eq_2 a4_141;
	Eq_2 a3_139;
	word32 s1_150;
	ptr32 s2_152;
	ptr32 s3_155;
	*a0_21 = xQueueGenericCreate(ra, 0x01, 0x00, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s1_150, out a0_21, out a1_202, out a2_23, out a3_139, out a4_141, out a5_26, out s2_152, out s3_155, out s4_203);
	if (a0_21 != 0x00)
	{
		word32 s8_209;
		word32 s5_207;
		word32 s6_208;
		word32 a7_205;
		word32 s4_206;
		word32 a1_204;
		xQueueGenericSend(a0_21, 0x00, 0x00, a4_141, a5_26, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1_150, out a0_21, out a1_204, out a2_23, out a3_139, out a4_141, out a5_26, out a7_205, out s2_152, out s3_155, out s4_206, out s5_207, out s6_208, out s8_209);
	}
	ptr32 a0_102;
	Eq_383984 a5_103;
	Eq_2 s0_67 = 0x420267F0;
	if (a0_21 == 0x00)
	{
		word32 a5_101 = (word32) g_w420268E8;
		g_w420268E8 = (word16) (a5_101 + 0x01);
		a0_102 = ~0x00;
		a5_103 = a5_101 + 0x01;
	}
	else
	{
		if (s1_150 == 0x00)
		{
			word32 a0_210;
			word32 a1_211;
			word32 a2_212;
			word32 a4_213;
			word32 a5_214;
			word32 s4_215;
			word32 s8_216;
			s0_67 = xQueueSemaphoreTake(a0_21, 0x01, a2_23, a3_139, a4_141, a5_26, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_150, out a0_210, out a1_211, out a2_212, out a3_139, out a4_213, out a5_214, out s2_152, out s3_155, out s4_215, out s8_216);
		}
		uint32 a5_97 = (word32) *((word32) s0_67 + 244) + 0x01 << 16;
		a4_141 = (word32) *((word32) s0_67 + 0x00F6);
		*((word32) s0_67 + 244) = (word16) (a5_97 >> 16);
		a0_102 = 0x00;
		a5_103 = a5_97 >> 16;
		if (a4_141 < a5_97 >> 16)
			((word32) s0_67 + 0x00F6)->u2 = (word16) (a5_97 >> 16);
	}
	a0Out = a0_102;
	a2Out = dwArg10;
	a3Out = a3_139;
	a4Out = a4_141;
	a5Out = a5_103;
	s2Out = s2_152;
	s3Out = s3_155;
	return s1_150;
}

// 2306A6D2: Register Eq_2 sys_arch_sem_wait(Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg44, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out)
// Called from:
//      sys_mutex_lock
//      lwip_setsockopt
//      tcpip_send_msg_wait_sem
//      tcpip_api_call
Eq_2 sys_arch_sem_wait(Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg44, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out)
{
	ptr32 s1_120;
	Eq_2 s0_119;
	Eq_2 s2_122;
	ptr32 s3_124;
	ptr32 a1_111;
	ptr32 a5_66;
	Eq_2 a5_17;
	Eq_2 a0_16 = xTaskGetTickCount(out a5_17);
	Eq_2 a2_18 = dwArg44;
	if (a1 != 0x00)
	{
		word32 a0_50;
		word32 a2_137;
		word32 a4_138;
		word32 a5_139;
		word32 s4_140;
		word32 s8_141;
		s0_119 = xQueueSemaphoreTake(a0_16, a1, dwArg44, a3, a4, a5_17, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_120, out a0_50, out a1_111, out a2_137, out a3, out a4_138, out a5_139, out s2_122, out s3_124, out s4_140, out s8_141);
		a4.u0 = 0x01;
		a5_66 = ~0x00;
		if (a0_50 != 0x01)
			goto l2306A702;
	}
	else
	{
		do
		{
			word32 s4_143;
			word32 s8_144;
			s0_119 = xQueueSemaphoreTake(a0_16, ~0x00, a2_18, a3, a4, a5_17, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_120, out a0_16, out a1_111, out a2_18, out a3, out a4, out a5_17, out s2_122, out s3_124, out s4_143, out s8_144);
		} while (a0_16 != s2_122);
	}
	word32 a5_142;
	a5_66 = xTaskGetTickCount(out a5_142) - s0_119;
l2306A702:
	s1Out = s1_120;
	a0Out = a5_66;
	a1Out = a1_111;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_66;
	s2Out = s2_122;
	s3Out = s3_124;
	s4Out = dwArg04;
	return s0_119;
}

// 2306A71E: Register (ptr32 Eq_123468) sys_sem_free(Register (ptr32 Eq_2) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      tcpip_api_call
//      netconn_new_with_proto_and_callback
//      netconn_gethostbyname
//      netconn_free
struct Eq_123468 * sys_sem_free(union Eq_2 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	word32 a4_6 = (word32) g_w420268E4;
	g_w420268E4 = (word16) (a4_6 + ~0x00);
	Eq_2 a0_10 = *a0;
	ptr32 a3_16;
	ptr32 a4_17;
	ptr32 a5_18;
	ptr32 s1_21;
	ptr32 s4_22;
	word32 a0_32;
	word32 a1_33;
	word32 a2_34;
	struct Eq_123468 * s0_20 = vQueueDelete(a0_10, a3, a4_6 + ~0x00, mstatus, dwArg0158, dwArg0198, out s1_21, out a0_32, out a1_33, out a2_34, out a3_16, out a4_17, out a5_18, out s4_22);
	s1Out = s1_21;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_18;
	s4Out = s4_22;
	return s0_20;
}

// 2306A736: Register Eq_2 sys_sem_valid(Register Eq_2 a0)
// Called from:
//      tcpip_send_msg_wait_sem
//      netconn_new_with_proto_and_callback
//      err_tcp
//      lwip_netconn_do_delconn
Eq_2 sys_sem_valid(Eq_2 a0)
{
	return (word32) (*a0 != 0x00);
}

// 2306A73E: void sys_sem_set_invalid(Register (ptr32 word32) a0)
// Called from:
//      netconn_free
void sys_sem_set_invalid(word32 * a0)
{
	*a0 = 0x00;
}

// 2306A744: void sys_init()
// Called from:
//      lwip_init
void sys_init()
{
	g_w4200F5B0 = 0x00;
}

// 2306A74E: void sys_mutex_new(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
// Called from:
//      mem_init
void sys_mutex_new(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	word32 * a0_28;
	word32 s3_94;
	word32 s2_93;
	word32 a5_92;
	word32 a4_91;
	word32 a3_90;
	word32 a1_89;
	xQueueCreateMutex(ra, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_28, out a1_89, out a3_90, out a4_91, out a5_92, out s2_93, out s3_94);
	*a0_28 = a0;
	if (a0_28 == null)
		g_w420268EE = (word16) ((word32) g_w420268EE + 0x01);
	else
	{
		uint32 a3_41 = (word32) g_w420268EC;
		uint32 a4_44 = (word32) g_w420268EA + 0x01 << 16;
		g_w420268EA = (word16) (a4_44 >> 16);
		if (a3_41 < a4_44 >> 16)
			g_w420268EC = (word16) (a4_44 >> 16);
	}
}

// 2306A79A: Register word32 sys_mutex_lock(Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg44, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      mem_trim
//      mem_malloc
//      altcp_mbedtls_free_config
word32 sys_mutex_lock(Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg44, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a1_10;
	ptr32 a4_13;
	ptr32 s1_17;
	ptr32 s2_18;
	ptr32 s3_19;
	ptr32 s4_20;
	word32 a0_35;
	word32 a3_36;
	word32 a5_37;
	word32 s0_16 = sys_arch_sem_wait(0x00, a3, a4, s2, mstatus, dwArg04, dwArg44, dwArg84, dwArgF8, dwArg0138, out s1_17, out a0_35, out a1_10, out a3_36, out a4_13, out a5_37, out s2_18, out s3_19, out s4_20);
	s1Out = s1_17;
	a1Out = a1_10;
	a4Out = a4_13;
	s2Out = s2_18;
	s3Out = s3_19;
	s4Out = s4_20;
	return s0_16;
}

// 2306A7A0: Register Eq_2 sys_mutex_unlock(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out Eq_384361 s1Out, Register out ptr32 a1Out, Register out Eq_384363 a3Out, Register out Eq_384364 a4Out, Register out (ptr32 uint16) a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_384367) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      mem_trim
//      mem_malloc
//      lwip_netconn_do_gethostbyname
//      altcp_mbedtls_free_config
Eq_2 sys_mutex_unlock(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, union Eq_384361 & s1Out, ptr32 & a1Out, union Eq_384363 & a3Out, union Eq_384364 & a4Out, uint16 & a5Out, ptr32 & a7Out, struct Eq_384367 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	Eq_2 a0_5 = *a0;
	ptr32 a1_13;
	Eq_384363 a3_15;
	Eq_384364 a4_16;
	uint16 * a5_17;
	ptr32 a7_19;
	Eq_384361 s1_21;
	struct Eq_384367 * s2_22;
	ptr32 s3_23;
	ptr32 s4_24;
	ptr32 s5_25;
	ptr32 s6_26;
	ptr32 s8_27;
	word32 a0_53;
	word32 a2_54;
	Eq_2 s0_20 = xQueueGenericSend(a0_5, 0x00, 0x00, a4, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_21, out a0_53, out a1_13, out a2_54, out a3_15, out a4_16, out a5_17, out a7_19, out s2_22, out s3_23, out s4_24, out s5_25, out s6_26, out s8_27);
	s1Out = s1_21;
	a1Out = a1_13;
	a3Out = a3_15;
	a4Out = a4_16;
	a5Out = a5_17;
	a7Out = a7_19;
	s2Out = s2_22;
	s3Out = s3_23;
	s4Out = s4_24;
	s5Out = s5_25;
	s6Out = s6_26;
	s8Out = s8_27;
	return s0_20;
}

// 2306A7AC: Register Eq_384410 sys_sem_signal(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_384421) s1Out, Register out (ptr32 Eq_384422) a1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out Eq_384425 s3Out, Register out ptr32 s4Out, Register out Eq_384427 s5Out, Register out ptr32 s6Out, Register out (ptr32 Eq_384429) s8Out)
// Called from:
//      lwip_setsockopt_callback
//      event_callback
//      lwip_netconn_do_dns_found
//      lwip_netconn_do_connected
//      err_tcp
//      lwip_netconn_do_newconn
//      lwip_netconn_do_delconn
//      lwip_netconn_do_bind
//      lwip_netconn_do_connect
//      lwip_netconn_do_disconnect
//      lwip_netconn_do_listen
//      lwip_netconn_do_send
//      lwip_netconn_do_recv
//      lwip_netconn_do_write
//      lwip_netconn_do_getaddr
//      lwip_netconn_do_close
//      lwip_netconn_do_join_leave_group
//      lwip_netconn_do_gethostbyname
Eq_384410 sys_sem_signal(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, struct Eq_384421 & s1Out, struct Eq_384422 & a1Out, ptr32 & a3Out, ptr32 & s2Out, union Eq_384425 & s3Out, ptr32 & s4Out, union Eq_384427 & s5Out, ptr32 & s6Out, struct Eq_384429 & s8Out)
{
	struct Eq_384422 * a1_9;
	ptr32 a3_11;
	struct Eq_384421 * s1_17;
	ptr32 s2_18;
	Eq_384425 s3_19;
	ptr32 s4_20;
	Eq_384427 s5_21;
	ptr32 s6_22;
	struct Eq_384429 * s8_23;
	word32 a4_46;
	word32 a5_47;
	word32 a7_48;
	Eq_384410 s0_16 = sys_mutex_unlock(a0, a4, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_17, out a1_9, out a3_11, out a4_46, out a5_47, out a7_48, out s2_18, out s3_19, out s4_20, out s5_21, out s6_22, out s8_23);
	s1Out = s1_17;
	a1Out = a1_9;
	a3Out = a3_11;
	s2Out = s2_18;
	s3Out = s3_19;
	s4Out = s4_20;
	s5Out = s5_21;
	s6Out = s6_22;
	s8Out = s8_23;
	return s0_16;
}

