pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306A7B0: Register Eq_2 sys_thread_new(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register word32 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a6Out)
// Called from:
//      tcpip_init
Eq_2 sys_thread_new(Eq_2 ra, Eq_2 s1, Eq_2 a2, word32 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a6Out)
{
	ptr32 a6_5 = (word32) g_w4200F5B0;
	if (a6_5 <= 0x05)
	{
		word32 a0_26;
		word32 s3_129;
		word32 s2_128;
		word32 a5_127;
		word32 a4_126;
		word32 a3_125;
		word32 a2_124;
		word32 s1_123;
		Eq_2 ra_44 = xTaskCreate(ra, s1, (word32) (word16) a3, a2, a4, fp + ~0x13, s3, mstatus, dwLoc10, dwLoc0C, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_123, out a0_26, out a2_124, out a3_125, out a4_126, out a5_127, out s2_128, out s3_129);
		a6Out = a6_32;
		return ra_44;
	}
	else
	{
		a6Out = a6_5;
		return ra;
	}
}

// 2306A7EE: Register word32 sys_arch_protect(Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a2Out, Register out Eq_2 a4Out)
// Called from:
//      alloc_socket
//      free_socket
//      event_callback
//      lwip_accept
//      mem_trim
//      memp_malloc
//      pbuf_free_ooseq_callback
//      pbuf_free
//      pbuf_alloc
//      pbuf_chain
//      netconn_err
//      err_tcp
//      altcp_free
//      altcp_mbedtls_free_config
word32 sys_arch_protect(Eq_2 a4, ptr32 mstatus, ptr32 & a2Out, union Eq_2 & a4Out)
{
	word32 a5_17;
	Eq_2 a4_9 = vTaskEnterCritical(a4, mstatus, out a5_17);
	a2Out = dwArg10;
	a4Out = a4_9;
	return 0x01;
}

// 2306A7FE: Register Eq_2 sys_arch_unprotect(Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_384520 a4Out, Register out (ptr32 uint16) a5Out)
// Called from:
//      alloc_socket
//      free_socket
//      event_callback
//      lwip_accept
//      mem_trim
//      memp_malloc
//      pbuf_free_ooseq_callback
//      pbuf_free
//      pbuf_alloc
//      pbuf_chain
//      netconn_err
//      err_tcp
//      altcp_free
//      altcp_mbedtls_free_config
Eq_2 sys_arch_unprotect(Eq_2 a3, ptr32 mstatus, union Eq_384520 & a4Out, uint16 & a5Out)
{
	uint16 * a5_5;
	Eq_384520 a4_7;
	Eq_2 a3_6 = vTaskExitCritical(a3, mstatus, out a4_7, out a5_5);
	a4Out = a4_7;
	a5Out = a5_5;
	return a3_6;
}

// 2306A802: Register Eq_2 sys_now(Register out Eq_384530 a5Out)
// Called from:
//      lwip_cyclic_timer
//      sys_timeout
//      sys_check_timeouts
//      sys_timeouts_sleeptime
//      netconn_close_shutdown
//      netconn_prepare_delete
//      netconn_write_vectors_partly
//      lwip_netconn_do_write
//      lwip_netconn_do_close
Eq_2 sys_now(union Eq_384530 & a5Out)
{
	Eq_384530 a5_4;
	Eq_2 a0_3 = xTaskGetTickCount(out a5_4);
	a5Out = a5_4;
	return a0_3;
}

// 2306A806: Register word32 lwip_gethostbyname(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_331409 a4Out)
// Called from:
//      ota_tcp_cmd
//      domain_name_resolution
word32 lwip_gethostbyname(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_331409 & a4Out)
{
	Eq_331409 a4_110;
	ptr32 a0_106;
	word32 a0_17;
	word32 * a4_22;
	Eq_2 s2_26;
	ptr32 a3_109;
	ptr32 a2_108;
	word32 s1_114 = netconn_gethostbyname(ra, s0, a0, fp + ~0x13, a3, mstatus, dwArg78, dwArgB8, dwArgF8, dwArg0108, dwArg0138, dwArg0148, out a0_17, out a2_108, out a3_109, out a4_22, out s2_26);
	if (a0_17 != 0x00)
	{
		g_dw420267AC = 0x00D2;
		a4_110.u0 = 0x00D2;
		a0_106 = 0x00;
	}
	else
	{
		*a4_22 = 0x4200F5B8;
		g_dw4200F5B8 = 0x4200F5BC;
		g_dw4200F5C0 = 0x00;
		word32 a5_130;
		word32 a4_129;
		strncpy(1107405064, s2_26, 0x0100, out a2_108, out a3_109, out a4_129, out a5_130);
		g_dw4200F5B4 = 0x00;
		g_dw4200F5B8 = 1107405044;
		((union Eq_2 *) 0x0A)->u0 = 1107405044;
		g_b4201AA08 = 0x00;
		g_dw4201A908 = 1107405044;
		((union Eq_2 *) 0x10)->u0 = 1107405044;
		g_ptr4200F5CC = (<anonymous> *) &g_dw4201A8F4;
		s1_114 = 1107405064;
		a4_110.u0 = 0x04;
		a0_106 = 1107405044;
	}
	a0Out = a0_106;
	a2Out = a2_108;
	a3Out = a3_109;
	a4Out = a4_110;
	return s1_114;
}

// 2306A890: void netifapi_do_netif_add(Register Eq_2 ra, Register (ptr32 Eq_384625) a0, Register (ptr32 Eq_384626) a1, Register word32 a2, Register word32 a3, Register word32 a5, Register word32 s4, Register word32 s7, Register word32 mstatus, Stack word32 dwArg04, Stack word32 dwArg08, Stack word32 dwArg18, Stack word32 dwArg28, Stack word32 dwArg2C, Stack word32 dwArg34, Stack word32 dwArg38, Stack word32 dwArg48, Stack word32 dwArg58, Stack word32 dwArg64, Stack word32 dwArg78, Stack word32 dwArgA4, Stack word32 dwArgE8, Stack word32 dwArgF8, Stack word32 dwArg0118)
void netifapi_do_netif_add(Eq_2 ra, struct Eq_384625 * a0, struct Eq_384626 * a1, word32 a2, word32 a3, word32 a5, word32 s4, word32 s7, word32 mstatus, word32 dwArg04, word32 dwArg08, word32 dwArg18, word32 dwArg28, word32 dwArg2C, word32 dwArg34, word32 dwArg38, word32 dwArg48, word32 dwArg58, word32 dwArg64, word32 dwArg78, word32 dwArgA4, word32 dwArgE8, word32 dwArgF8, word32 dwArg0118)
{
	netif_add(ra, a1->ptr000C->t0008, a1, a2, a3, a5, a0->dw0020, s4, s7, mstatus, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, dwArg58, dwArg64, dwArg78, dwArgA4, dwArgE8, dwArgF8, dwArg0118) == 0x00;
}

// 2306A8B6: void netifapi_do_netif_set_addr(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_384689) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void netifapi_do_netif_set_addr(Eq_2 ra, Eq_2 s1, struct Eq_384689 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	word32 s0_71;
	word32 s1_72;
	word32 a1_73;
	word32 a2_74;
	word32 a3_75;
	word32 a4_76;
	word32 a5_77;
	word32 s2_78;
	word32 s3_79;
	word32 s4_80;
	word32 s5_81;
	word32 s6_82;
	word32 s7_83;
	word32 mstatus_84;
	netif_set_addr(ra, s1, a1->ptr000C->t0008, a1, a2, a3, a4, a5, s3, s4, s7, mstatus, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg34, dwArg38, dwArg48, dwArg58, dwArg5C, dwArg64, dwArg68, dwArg78, dwArg88, dwArgA8, dwArg0118, dwArg0128, out s0_71, out s1_72, out a1_73, out a2_74, out a3_75, out a4_76, out a5_77, out s2_78, out s3_79, out s4_80, out s5_81, out s6_82, out s7_83, out mstatus_84);
}

// 2306A8CE: void netifapi_do_netif_common(Register word32 ra, Register (ptr32 Eq_384796) a0, Stack word32 dwArg10)
void netifapi_do_netif_common(word32 ra, struct Eq_384796 * a0, word32 dwArg10)
{
	<anonymous> * t1_5 = a0->ptr0010;
	word32 a0_7 = a0->dw0008;
	if (t1_5 == null)
		a0->ptr000C();
	else
		t1_5();
}

// 2306A8EC: Register Eq_2 netifapi_netif_add(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a1, Register ptr32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s1Out)
// Called from:
//      wifi_mgmr_sta_enable
//      wifi_mgmr_ap_enable
Eq_2 netifapi_netif_add(Eq_2 ra, Eq_2 s0, ptr32 a1, ptr32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s1Out)
{
	if (a3 == 0x00)
		a3.u0 = 588036828;
	ptr32 s1_76;
	word32 a5_140;
	word32 s2_141;
	word32 s3_142;
	word32 a3_138;
	word32 a4_139;
	Eq_2 s0_75 = tcpip_api_call(ra, s0, fp + -52, a3, a4, a5, s2, mstatus, a5, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, out s1_76, out a3_138, out a4_139, out a5_140, out s2_141, out s3_142);
	s1Out = s1_76;
	return s0_75;
}

// 2306A930: Register Eq_2 netifapi_netif_set_addr(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a1, Register ptr32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 a4Out, Register out ptr32 s3Out)
// Called from:
//      bl_rx_sm_disconnect_ind
//      stateConnectedIPNoEnter
//      stateConnectedIPYes_exit
Eq_2 netifapi_netif_set_addr(Eq_2 ra, Eq_2 s0, ptr32 a1, ptr32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & a4Out, ptr32 & s3Out)
{
	if (a3 == 0x00)
		a3.u0 = 588036828;
	Eq_2 a3_64;
	ptr32 a4_65;
	ptr32 s3_71;
	word32 a5_134;
	word32 s2_135;
	word32 s1_133;
	tcpip_api_call(ra, s0, fp + -52, a3, a4, a5, s2, mstatus, dwLoc2C, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, out s1_133, out a3_64, out a4_65, out a5_134, out s2_135, out s3_71);
	a4Out = a4_65;
	s3Out = s3_71;
	return a3_64;
}

