pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306A96E: Register Eq_2 netifapi_netif_common(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out)
// Called from:
//      bl_rx_sm_connect_ind
//      bl_rx_sm_disconnect_ind
//      stateConnectedIPNoEnter
//      stateGlobalGuard_AP
//      stateConnectedIPYes_exit
//      stateGlobalGuard_stop
//      wifi_netif_dhcp_start
Eq_2 netifapi_netif_common(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out)
{
	ptr32 a3_24;
	ptr32 a4_25;
	ptr32 a5_26;
	ptr32 s2_30;
	word32 s1_64;
	word32 s3_65;
	Eq_2 s0_28 = tcpip_api_call(ra, s0, fp + -52, a3, a4, a5, s2, mstatus, dwLoc2C, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, out s1_64, out a3_24, out a4_25, out a5_26, out s2_30, out s3_65);
	a3Out = a3_24;
	a4Out = a4_25;
	a5Out = a5_26;
	s2Out = s2_30;
	return s0_28;
}

// 2306A98C: Register word32 alloc_socket(Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_384910 s1Out, Register out Eq_384910 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_384915) s2Out, Register out Eq_2 s3Out, Register out (ptr32 Eq_384917) s5Out)
// Called from:
//      lwip_accept
//      lwip_socket
word32 alloc_socket(Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_384910 & s1Out, union Eq_384910 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_384915 & s2Out, union Eq_2 & s3Out, struct Eq_384917 & s5Out)
{
	struct Eq_384915 * s2_123 = &g_t4201AB08;
	word32 s4_23 = a1;
	Eq_384910 s1_24 = 0x00;
	struct Eq_384917 * s5_127 = (struct Eq_384917 *) 0x15;
	do
	{
		word32 a4_140;
		word32 a2_139;
		sys_arch_protect(a4, mstatus, out a2_139, out a4_140);
		if (s2_123->dw0000 == 0x00)
		{
			s5_127 = s1_24 << 0x04;
			s5_127->t4201AB08 = a0;
			word32 a5_138;
			word32 a4_137;
			a3 = sys_arch_unprotect(a3, mstatus, out a4_137, out a5_138);
			s5_127->dw4201AB0C = 0x00;
			s5_127->w4201AB10 = 0x00;
			s2_123 = (struct Eq_384915 *) &s5_127->t4201AB08;
			a4.u0 = 0x10;
			if (((word32) *a0 & 0x00F0) != 0x10)
				s4_23 = 0x01;
			s5_127->w4201AB12 = (word16) s4_23;
			s5_127->w4201AB14 = 0x00;
			goto l2306A9EC;
		}
		s1_24 = (word32) s1_24.u0 + 1;
		word32 a5_136;
		a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5_136);
		++s2_123;
	} while (s1_24 != 0x15);
	s1_24.u0 = ~0x00;
l2306A9EC:
	s1Out = s1_24;
	a0Out = s1_24;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2_123;
	s3Out = a0;
	s5Out = s5_127;
	return s1;
}

// 2306AA10: void lwip_recv_tcp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0198)
// Called from:
//      lwip_recv
void lwip_recv_tcp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0198)
{
	Eq_2 s3_155 = a0;
	Eq_2 s5_102 = a1;
	Eq_2 s1_198 = a2;
	if (a2 < 0x00)
		s1_198.u0 = 0x7FFFFFFF;
	Eq_2 a2_199 = 0x08;
	if ((a3 & 8) != 0x00)
		a2_199.u0 = 0x0C;
	word32 s0_105 = 0x00;
	ui32 s6_131 = a3 & 1;
	do
	{
		if (*((word32) s3_155 + 4) == 0x00)
		{
			Eq_2 a5_51;
			ui32 s4_63;
			ra = netconn_recv_tcp_pbuf_flags(ra, *s3_155, fp + -52, a2_199, a3, mstatus, dwArg18, dwArg24, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg98, dwArgA8, out s0_105, out s1_198, out a0, out a2_199, out a5_51, out s3_155, out s4_63, out s5_102, out s6_131, out mstatus);
			if (a0 != 0x00)
			{
				if (s0_105 == 0x00)
				{
					word32 a4_552;
					word32 a5_553;
					Eq_385116 a0_77 = err_to_errno(a0, out a4_552, out a5_553);
					if (a0_77 != 0x00)
						g_t420267A8 = a0_77;
					goto l2306AAC2;
				}
				else
				{
					if ((s4_63 & 1) != 0x00)
						goto l2306AAC2;
					goto l2306AA9E;
				}
			}
			*((word32) s3_155 + 4) = a5_51;
		}
		Eq_2 s2_93 = (word32) *((word32) a0 + 8);
		if (s2_93 >= s1_198)
			s2_93 = (word32) (word16) s1_198;
		Eq_2 a0_110;
		Eq_2 s4_114;
		Eq_2 s1_117;
		Eq_2 s2_118;
		Eq_2 a3_120;
		Eq_2 a4_121;
		struct Eq_385082 * s3_124;
		word32 a1_548;
		word32 a2_549;
		word32 a5_550;
		word32 s8_551;
		pbuf_copy_partial(a0, (word32) s5_102 + s0_105, s2_93, 0x00, out s1_117, out a0_110, out a1_548, out a2_549, out a3_120, out a4_121, out a5_550, out s2_118, out s3_124, out s4_114, out s8_551);
		word32 s7_108 = (word32) s2_93 + s0_105;
		if (s6_131 != 0x00)
		{
			if (s7_108 == 0x00)
				goto l2306AB0E;
			goto l2306AAC2;
		}
		word32 s2_154;
		word32 s1_153;
		if ((word32) *((word32) a0_110 + 8) - s2_118 > 0x00)
		{
			word32 s0_562;
			word32 s4_563;
			word32 s8_564;
			ra = pbuf_free_header(ra, s1_117, a0_110, s2_118, dwArg04, a3_120, a4_121, s4_114, mstatus, dwArg04, dwArgC8, out s0_562, out s1_153, out a0, out a3, out s2_154, out s3_155, out s4_563, out s5_102, out s6_131, out s8_564, out mstatus);
			*((word32) s3_155 + 4) = a0;
		}
		else
		{
			s3_124->dw0004 = 0x00;
			word32 a7_559;
			word32 s0_554;
			word32 a4_557;
			word32 a2_556;
			word32 a1_555;
			word32 a5_558;
			word32 s4_560;
			word32 s8_561;
			ra = pbuf_free(ra, a0_110, a3_120, a4_121, s4_114, mstatus, dwArgE8, out s0_554, out s1_153, out a0, out a1_555, out a2_556, out a3, out a4_557, out a5_558, out a7_559, out s2_154, out s3_155, out s4_560, out s5_102, out s6_131, out s8_561, out mstatus);
		}
		s1_198 = s1_153 - s2_154;
		a2_199.u0 = 0x1C;
		s0_105 = s7_108;
	} while (s1_198 > 0x00);
	if (s7_108 != 0x00)
	{
l2306AA9E:
		netconn_tcp_recvd(*s3_155, a2_199, mstatus, dwArg38, dwArg78, dwArgB8);
	}
	else
	{
l2306AB0E:
	}
l2306AAC2:
	0x00 = (int8) dwArg0198;
}

// 2306AB12: Register Eq_2 lwip_sock_make_addr.isra.3(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg74, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_385252) a5Out)
// Called from:
//      lwip_recvfrom_udp_raw.isra.6
//      lwip_recv
Eq_2 lwip_sock_make_addr.isra.3(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 dwArg74, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_385252 & a5Out)
{
	word32 a5_89;
	lwip_htons(a1, out a5_89);
	union Eq_2 * a4_32;
	word32 t1_90;
	word32 a0_91;
	word32 a1_92;
	word32 a2_93;
	word32 a3_94;
	word32 a5_95;
	Eq_2 ra_34 = memset(ra, fp + -24, 0x00, 0x08, out t1_90, out a0_91, out a1_92, out a2_93, out a3_94, out a4_32, out a5_95);
	ptr32 s0_39 = 0x01;
	Eq_2 a3_40 = *a4_32;
	if (a4_32 >= (union Eq_2 *) 0x10)
	{
		s0_39 = 0x00;
		if (a4_32 > (union Eq_2 *) 0x10)
			*(union Eq_2 *) 0x10 = a3_40;
	}
	ptr32 a4_50;
	struct Eq_385252 * a5_51;
	ptr32 a3_55;
	word32 a1_96;
	word32 a2_97;
	word32 a6_98;
	word32 a7_99;
	memcpy(a2, fp + -32, dwArg74, out a1_96, out a2_97, out a3_55, out a4_50, out a5_51, out a6_98, out a7_99);
	a0Out = s0_39;
	a3Out = a3_55;
	a4Out = a4_50;
	a5Out = a5_51;
	return ra_34;
}

// 2306AB6C: Register Eq_2 free_socket(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 (ptr32 Eq_2)) a5Out, Register out ptr32 s3Out)
// Called from:
//      lwip_accept
//      lwip_close
Eq_2 free_socket(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s3Out)
{
	Eq_2 s1_149;
	word32 a4_186;
	Eq_2 a2_19;
	sys_arch_protect(a4, mstatus, out a2_19, out a4_186);
	struct Eq_385333 * s0_22 = *((word32) s1 + 4);
	Eq_2 s2_23 = s0_22->t0000;
	s0_22->dw0004 = 0x00;
	s0_22->t0000.u0 = 0x00;
	Eq_2 a4_28;
	union Eq_2 ** a5_138;
	Eq_2 a3_135 = sys_arch_unprotect(a3, mstatus, out a4_28, out a5_138);
	s1_149 = s1;
	if (s1 != 0x00)
	{
		if (a1 != 0x00)
		{
			word32 s0_187;
			word32 a0_188;
			word32 a1_189;
			word32 a7_190;
			word32 s4_191;
			word32 s5_192;
			word32 s6_193;
			word32 s8_194;
			pbuf_free(ra, s1, a3_135, a4_28, s4, mstatus, dwArg0108, out s0_187, out s1_149, out a0_188, out a1_189, out a2_19, out a3_135, out a4_28, out a5_138, out a7_190, out s2_23, out s3, out s4_191, out s5_192, out s6_193, out s8_194, out mstatus);
		}
		else
			s1_149 = netbuf_delete(ra, s1, a3_135, a4_28, s4, mstatus, dwArgE8, out a2_19, out a3_135, out a4_28, out a5_138);
	}
	if (s2_23 == 0x00)
	{
		a3Out = a3_135;
		a4Out = a4_28;
		a5Out = a5_138;
		s3Out = s3;
		return s1_149;
	}
	else
	{
		Eq_2 a3_88;
		Eq_2 a4_89;
		union Eq_2 ** a5_90;
		ptr32 s3_94;
		word32 s2_195;
		word32 s4_196;
		word32 s5_197;
		Eq_2 s1_85 = netconn_delete(s2_23, a2_19, a4_28, mstatus, s1, dwArgA8, dwArgE8, dwArg0138, dwArg0178, out a3_88, out a4_89, out a5_90, out s2_195, out s3_94, out s4_196, out s5_197);
		a3Out = a3_88;
		a4Out = a4_89;
		a5Out = a5_90;
		s3Out = s3_94;
		return s1_85;
	}
}

// 2306ABC2: void lwip_recvfrom_udp_raw.isra.6(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg34, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0198)
// Called from:
//      lwip_recv
void lwip_recvfrom_udp_raw.isra.6(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, word32 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg34, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0198)
{
	Eq_2 a0_109;
	a0_109 = a0;
	if (a5 == 0x00)
	{
		a0_109.u0 = ~0x0F;
		if (a5 > 0x00)
			goto l2306AC60;
	}
	Eq_2 a3_123;
	union Eq_2 * a5_30 = *((word32) a0 + 4);
	ui32 a2_36 = (word32) ((a1 & 8) != 0x00);
	Eq_2 s2_121 = a1;
	a3_123 = a3;
	if (a5_30 == null)
	{
		ra = netconn_recv_udp_raw_netbuf_flags(ra, *a0, fp + -52, a2_36 << 2, a3, mstatus, s4, dwLoc0C, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgC8, dwArgE8, out a0_109, out a1, out a3_123, out a4, out a5_30, out s2_121, out mstatus);
		if (a0_109 != 0x00)
			goto l2306AC60;
		*((word32) a0 + 4) = a5_30;
	}
	Eq_2 a5_125 = *a5_30;
	Eq_2 a2_114 = dwArgA4;
	Eq_2 s4_134 = 0x00;
	Eq_2 s1_133 = 0x00;
	Eq_2 s6_81 = (word32) *((word32) a5_125 + 8);
	while (s4_134 < a5_125 && s1_133 < s6_81)
	{
		Eq_2 s3_106 = (word32) (word16) (s6_81 - s1_133);
		if (s3_106 >= a4)
			s3_106 = (word32) (word16) a4;
		word32 s4_117;
		uint32 s1_120;
		word32 s8_482;
		word32 s3_481;
		pbuf_copy_partial(a0_109, a1, s3_106, s1_133, out s1_120, out a0_109, out a1, out a2_114, out a3_123, out a4, out a5_125, out s2_121, out s3_481, out s4_117, out s8_482);
		s1_133 = s1_120 >> 16;
		s4_134 = s4_117 + 0x01;
	}
	if (a2_114 != 0x00 && a5_125 != 0x00)
		ra = lwip_sock_make_addr.isra.3(ra, (word32) *((byte) a0_109.u0 + 0x0C), dwArg04, dwArg34, out a0_109, out a3_123, out a4, out a5_125);
	struct Eq_385547 * s0_171 = *((word32) a5_125 + 16);
	s0_171->dw0018 = 0x00;
	if (a5_125 != 0x00)
		s0_171->dw0014 = 0x00;
	if ((s2_121 & 1) == 0x00)
	{
		*((word32) a0 + 4) = null;
		word32 a5_486;
		word32 a4_485;
		word32 a2_483;
		word32 a3_484;
		netbuf_delete(ra, a0_109, a3_123, a4, s4_134, mstatus, dwArgC8, out a2_483, out a3_484, out a4_485, out a5_486);
	}
	*a3 = (word16) s6_81;
l2306AC60:
	0x00 = (int8) dwArg0198;
}

// 2306ACAE: Register Eq_2 get_socket(Register Eq_2 a0, Register out ptr32 a4Out, Register out Eq_385622 a5Out)
// Called from:
//      event_callback
//      lwip_accept
//      lwip_bind
//      lwip_close
//      lwip_connect
//      lwip_listen
//      lwip_recv
//      lwip_sendto
//      lwip_send
//      lwip_setsockopt
Eq_2 get_socket(Eq_2 a0, ptr32 & a4Out, union Eq_385622 & a5Out)
{
	Eq_385622 a5_10;
	Eq_2 a0_13;
	if (a0 <= 0x14)
	{
		a5_10 = a0 << 0x04;
		a0_13 = null[a0].t0000;
		if (a0 << 0x04 != 0x00)
		{
l2306ACD2:
			a4Out = a4;
			a5Out = a5_10;
			return a0_13;
		}
	}
	g_t420267A8.u0 = 0x09;
	a5_10.u0 = 0x42026000;
	a4 = 0x09;
	a0_13.u0 = 0x00;
	goto l2306ACD2;
}

