pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306ACD4: void lwip_setsockopt_callback(Register word32 ra, Register word32 s0, Register (ptr32 Eq_385659) a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg38, Stack word32 dwArg58, Stack Eq_2 dwArg74, Stack word32 dwArgE4, Stack Eq_2 dwArgE8, Stack word32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void lwip_setsockopt_callback(word32 ra, word32 s0, union Eq_385659 * a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, word32 dwArg38, word32 dwArg58, Eq_2 dwArg74, word32 dwArgE4, Eq_2 dwArgE8, word32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_385658 * s0_116;
	Eq_385659 s3_17 = *a0;
	Eq_385663 s1_23 = *((word32) a4 + 16);
	Eq_2 a0_100 = *((word32) *((word32) a5 + 8) + 0x0C);
	if (s3_17 <= 0x14)
	{
		Eq_2 a2_29 = (&g_t4201AB08)[s3_17];
		if (a2_29 != 0x00)
		{
			if (s0 == 0x06)
			{
				s0_116 = (struct Eq_385658 *) 22;
				if (a4 > 0x03)
				{
					byte * a2_35 = *((word32) a4 + 4);
					if (a4 != 0x00)
					{
						s0_116 = (struct Eq_385658 *) 92;
						if (((word32) *a2_35 & 0x00F0) == 0x10)
						{
							s0_116 = (struct Eq_385658 *) 22;
							if ((word32) *((word32) a4 + 20) != 0x01)
							{
								a5 += ~0x00;
								s0_116 = (struct Eq_385658 *) 92;
								if (a5 <= ~0x04)
								{
									word32 a5_50 = 588002700[(a5 + ~0x00) * 0x04];
									word32 t2_255;
									a5_50();
									return;
								}
							}
						}
					}
				}
				goto l2306AD60;
			}
			if (s0 != 0x00FFFFFF)
			{
				if (s0 == 0x00 && a5 <= ~0x06)
					;
				goto l2306AD22;
			}
			if (a5 != 0x01000005)
			{
				if (a5 <= 0x01000005)
				{
					if (a5 != 0x08 && (a5 != 32 && a5 != 0x04))
						goto l2306AD22;
					if (a5 == 32)
					{
						s0_116 = (struct Eq_385658 *) 92;
						if (((word32) *a2_29 & 0x00F0) != a5)
							goto l2306AD60;
					}
					else if (a5 != 0x04 && a5 != 0x08)
						a5.u0 = 0x00;
					s0_116 = (struct Eq_385658 *) 22;
					if (a4 > 0x03 && true)
					{
						int32 a5_165 = a5 << 24;
						a0_100 = *(union Eq_2 *) 22;
						int32 a4_166 = (int32) *(union Eq_2 *) 0x0C;
						a5 = a5_165 >> 24;
						if (false)
						{
							a5 = ~(a5_165 >> 24);
							a4 = a4_166 & a5;
							*(union Eq_2 *) 0x0C = (byte) a4;
							goto l2306AD60;
						}
						a4 = a4_166 | a5_165 >> 24;
						*(union Eq_2 *) 0x0C = (byte) a4;
						goto l2306ADDC;
					}
				}
				else if (a5 != 0x0100000A)
				{
					if (a5 != 0x0100000B)
					{
						if (a5 != 0x01000006)
						{
l2306AD22:
							s0_116 = (struct Eq_385658 *) 92;
							goto l2306AD60;
						}
						a5.u0 = 0x0F;
						s0_116 = (struct Eq_385658 *) 22;
						if (a4 > 0x0F)
						{
							a0_100 = *(union Eq_2 *) 0x0F;
							a4 = a4 ^ 1000;
							a5 = (a4 ^ 1000) + 1015;
							if (a5 < 0x00)
								goto l2306AD60;
							*((byte) a5.u0 + 32) = a2_29;
l2306ADDC:
							s0_116 = null;
							goto l2306AD60;
						}
					}
					else
					{
						a5.u0 = 0x05;
						s0_116 = (struct Eq_385658 *) 22;
						if (a4 <= 0x05)
							goto l2306AD60;
						Eq_2 a1_115 = 0x00;
						if ((word32) *a0_100 != 0x00)
						{
							a0_100 = netif_find(a0_100, out a4, out a5);
							a1_115 = a0_100;
							s0_116 = (struct Eq_385658 *) 0x13;
							if (a0_100 == 0x00)
								goto l2306AD60;
						}
						ui32 a5_121 = (word32) *a4;
						a5 = a5_121 & 0x00F0;
						if ((a5_121 & 0x00F0) == 32)
						{
							a4 = *((word32) a0_100 + 4);
							a5 = udp_bind_netif(a0_100, a1_115);
							goto l2306ADDC;
						}
						if ((a5_121 & 0x00F0) == 64)
						{
							a4 = *((word32) a0_100 + 4);
							a5 = raw_bind_netif(a0_100, a1_115);
							goto l2306ADDC;
						}
						s0_116 = null;
						if ((a5_121 & 0x00F0) == 0x10)
						{
							a4 = *((word32) a0_100 + 4);
							a5 = tcp_bind_netif(a0_100, a1_115);
						}
					}
				}
				else
				{
					a5.u0 = 0x03;
					s0_116 = (struct Eq_385658 *) 22;
					if (a4 <= 0x03)
						goto l2306AD60;
					byte * a2_84 = *((word32) a4 + 4);
					if (a4 != 0x00)
					{
						ui32 a5_85 = (word32) *a2_84;
						s0_116 = (struct Eq_385658 *) 92;
						a5 = a5_85 & 0x00F0;
						if ((a5_85 & 0x00F0) == 32)
						{
							a0_100 = *(union Eq_2 *) 92;
							ui32 a5_90 = (word32) *((word32) a4 + 16);
							if (true)
							{
								*((word32) a4 + 16) = (byte) (a5_90 | 1);
								a5 = a5_90 | 1;
								goto l2306ADDC;
							}
							*((word32) a4 + 16) = (byte) (a5_90 & ~0x01);
							a5 = a5_90 & ~0x01;
						}
					}
				}
			}
			else
			{
				a5.u0 = 0x0F;
				s0_116 = (struct Eq_385658 *) 22;
				if (a4 <= 0x0F)
					goto l2306AD60;
				a0_100 = *(union Eq_2 *) 0x0F;
				a4 = a4 ^ 1000;
				a5 = (a4 ^ 1000) + 1015;
				if (a5 >= 0x00)
				{
					*((byte) a5.u0 + 28) = a2_29;
					goto l2306ADDC;
				}
			}
l2306AD60:
			s0_116->ptr0014 = (<anonymous> *) *((word32) a0_100 + 24);
			word32 s1_393;
			word32 a1_394;
			word32 a3_395;
			word32 s5_399;
			word32 s3_397;
			word32 s4_398;
			word32 s6_400;
			word32 s8_401;
			word32 s2_396;
			sys_sem_signal(a0_100, a4, a5, mstatus, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_393, out a1_394, out a3_395, out s2_396, out s3_397, out s4_398, out s5_399, out s6_400, out s8_401);
			0x00 = (int8) dwArg0128;
			return;
		}
	}
	s0_116 = (struct Eq_385658 *) 0x09;
	goto l2306AD60;
}

// 2306B0BA: void event_callback(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack word32 dwArg010C, Stack Eq_2 dwArg0148)
void event_callback(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArgC8, Eq_2 dwArg0108, word32 dwArg010C, Eq_2 dwArg0148)
{
	if (a0 == 0x00)
		return;
	if (s1 < 0x00)
	{
		word32 a4_802;
		word32 a2_801;
		sys_arch_protect(a4, mstatus, out a2_801, out a4_802);
		word32 s0_41 = *((word32) s1 + 24);
		if (s1 < 0x00)
		{
			if (a1 == 0x00)
				*((word32) s1 + 23) = s0_41;
			goto l2306B0FA;
		}
		word32 a4_803;
		word32 a5_804;
		a3 = sys_arch_unprotect(a3, mstatus, out a4_803, out a5_804);
	}
	Eq_2 a4_50;
	word32 a5_800;
	Eq_2 a0_49 = get_socket(s1, out a4_50, out a5_800);
	if (a0_49 == 0x00)
	{
		0x00 = dwArg010C;
		return;
	}
	word32 a4_808;
	word32 a2_807;
	sys_arch_protect(a4_50, mstatus, out a2_807, out a4_808);
	word32 a5_74 = 0x01;
	if (a1 <= 0x04)
	{
		a1.u0 = 588002720;
		switch (a1 << 2)
		{
		case ~0x230C359F:
			int32 a5_87 = (word32) *((word32) a0_49 + 8) + 0x01 << 16;
			*((word32) a0_49 + 8) = (word16) (a5_87 >> 16);
			a5_74 = (word32) (a5_87 >> 16 < 2);
			break;
		case 3706964577:
			*((word32) a0_49 + 8) = (word16) ((word32) *((word32) a0_49 + 8) + ~0x00);
			a5_74 = 0x00;
			break;
		}
	}
	if ((word32) *((word32) a0_49 + 0x0E) != 0x00 && a5_74 != 0x00)
	{
		int32 s3_129 = (int32) *((word32) a0_49 + 8);
		word32 s4_137 = (word32) *((word32) a0_49 + 0x0A);
		word32 s2_148 = (word32) *((word32) a0_49 + 0x0C);
		Eq_2 a4_102;
		word32 a5_809;
		Eq_2 a3_101 = sys_arch_unprotect(a3, mstatus, out a4_102, out a5_809);
		word32 a2_810;
		word32 a4_811;
		Eq_2 a4_111 = sys_arch_protect(a4_102, mstatus, out a2_810, out a4_811);
		ui32 s11_112 = 0x01 << s1;
		word32 s6_113 = 0x4200F000;
		struct Eq_386103 * s8_114 = &g_t4200F000;
		int32 s10_116 = s1 >> 0x05 << 2;
l2306B18E:
		Eq_2 a5_118 = s6_113 + 0x05C4;
		Eq_2 s5_120 = *a5_118;
		int32 s0_122 = s8_114[0x00B9];
		union Eq_2 * s7_123 = s6_113 + 0x05C4;
		while (s0_122 != 0x00)
		{
			struct Eq_385726 * s0_127 = *((word32) a5_118 + 28);
			if (a5_118 == 0x00)
			{
				s0_127 = (struct Eq_385726 *) *((word32) a5_118 + 20);
				if (a5_118 != 0x00)
				{
					s0_127 = (struct Eq_385726 *) *((byte) a1.u0 + 24);
					a5_118 = (word32) a5_118 + 4;
					a3_101.u0 = 0x00;
					while (a3_101 != a1)
					{
						if (s1 == *((word32) a5_118 - 4) && (s3_129 > 0x00 && ((word32) (*a5_118) & 0x01) != 0x00 || (s4_137 != 0x00 && ((word32) (*a5_118) & 0x02) != 0x00 || s2_148 != 0x00)))
							goto l2306B25E;
						a3_101 = (byte) a3_101.u0 + 1;
						a5_118 = (word32) a5_118 + 8;
					}
					goto l2306B1E2;
				}
				if (s3_129 > 0x00)
				{
					s0_127 = (struct Eq_385726 *) *((word32) a5_118 + 8);
					if (a5_118 == 0x00)
						goto l2306B23A;
					a5_118 = s11_112 & *((word32) a5_118 + s10_116);
					if (a5_118 == 0x00)
						goto l2306B23A;
					goto l2306B25E;
				}
l2306B23A:
				if (s4_137 != 0x00)
				{
					s0_127 = (struct Eq_385726 *) *((word32) a5_118 + 0x0C);
					if (a5_118 == 0x00)
						goto l2306B24C;
					a5_118 = s11_112 & *((word32) a5_118 + s10_116);
					if (a5_118 == 0x00)
						goto l2306B24C;
					goto l2306B25E;
				}
l2306B24C:
				if (s2_148 != 0x00)
				{
					s0_127 = (struct Eq_385726 *) *((word32) a5_118 + 16);
					if (a5_118 != 0x00)
					{
						a5_118 = s11_112 & *((word32) a5_118 + s10_116);
						if (a5_118 != 0x00)
						{
l2306B25E:
							s0_127->dw001C = 0x01;
							s0_127 = sys_sem_signal(s0_127 + 4, a4_111, a5_118, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1, out a1, out a3_101, out s2_148, out s3_129, out s4_137, out s5_120, out s6_113, out s8_114);
						}
					}
				}
			}
l2306B1E2:
			Eq_2 a4_254;
			word32 a5_812;
			a3_101 = sys_arch_unprotect(a3_101, mstatus, out a4_254, out a5_812);
			word32 a2_813;
			word32 a4_814;
			Eq_2 a0_256 = sys_arch_protect(a4_254, mstatus, out a2_813, out a4_814);
			a5_118 = *s7_123;
			a4_111 = a0_256;
			if (a5_118 != s5_120)
				goto l2306B18E;
			s5_120 = *s7_123;
			s0_122 = s0_127->dw0000;
		}
	}
l2306B0FA:
	0x00 = dwArg010C;
	word32 a4_805;
	word32 a5_806;
	sys_arch_unprotect(s2, mstatus, out a4_805, out a5_806);
}

// 2306B290: Register Eq_2 lwip_accept(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack (ptr32 Eq_386260) dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 mstatusOut)
// Called from:
//      iperf_server
Eq_2 lwip_accept(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg88, struct Eq_386260 * dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & mstatusOut)
{
	struct Eq_386267 * sp_126 = fp + -64;
	Eq_2 a4_21;
	word32 a5_495;
	Eq_2 a0_20 = get_socket(a0, out a4_21, out a5_495);
	if (a0_20 == 0x00)
	{
l2306B2AA:
		goto l2306B2AC;
	}
	Eq_2 a3_29;
	Eq_2 a4_30;
	byte * a5_31;
	Eq_2 a0_255;
	ra = netconn_accept(ra, *a0_20, fp + -56, a3, a4_21, mstatus, dwLoc0C, dwArg14, dwArg68, dwArg88, dwArgA8, dwArgC8, dwArgE8, out a0_255, out a3_29, out a4_30, out a5_31, out mstatus);
	if (a0_255 == 0x00)
	{
		Eq_2 a0_53;
		Eq_2 a2_54;
		Eq_2 a3_55;
		Eq_2 a4_56;
		struct Eq_386322 * s1_60;
		word32 s5_496;
		word32 s3_101;
		word32 s2_100;
		alloc_socket(a0_255, 0x01, a3_29, a4_30, mstatus, out s1_60, out a0_53, out a2_54, out a3_55, out a4_56, out s2_100, out s3_101, out s5_496);
		if (a0_53 == ~0x00)
		{
			word32 a3_499;
			word32 a4_500;
			word32 s3_503;
			word32 s5_505;
			word32 s4_504;
			word32 s2_502;
			word32 a5_501;
			netconn_delete(a0_53, a2_54, a4_56, mstatus, dwArg28, dwArg68, dwArgA8, dwArgF8, dwArg0138, out a3_499, out a4_500, out a5_501, out s2_502, out s3_503, out s4_504, out s5_505);
			g_t420267A8.u0 = 0x17;
		}
		else
		{
			word32 a4_498;
			word32 a2_497;
			Eq_2 a0_107 = sys_arch_protect(a4_56, mstatus, out a2_497, out a4_498);
			dwArgA4->dw0018 = s1_60->dw0018;
			struct Eq_386365 * a5_79;
			Eq_2 a4_114;
			Eq_2 a3_113 = sys_arch_unprotect(a3_55, mstatus, out a4_114, out a5_79);
			<anonymous> * a5_112 = a5_79->ptr002C;
			if (a5_112 != null)
			{
				int32 s1_104 = (int32) (word16) ~s1_60;
				while (s1_104 > 0x00)
				{
					word32 tp_116;
					word32 a7_117;
					word32 t0_118;
					word32 t1_119;
					word32 t4_120;
					word32 t5_121;
					word32 t6_122;
					word32 s5_123;
					word32 s6_343;
					a5_112();
				}
			}
			if (s3_101 != 0x00 && s2_100 != 0x00)
			{
				Eq_2 a2_139;
				Eq_2 a4_141;
				union Eq_2 * s2_146;
				Eq_2 s3_147;
				Eq_2 a0_137 = netconn_getaddr(a0_107, &sp_126->w0006 + 3, &sp_126->w0006, a4_114, mstatus, sp_126->t0078, sp_126->t00B8, sp_126->t00F8, out a2_139, out a4_141, out s2_146, out s3_147);
				if (a0_137 != 0x00)
				{
					Eq_2 a3_210;
					Eq_2 a4_211;
					Eq_2 s4_217;
					word32 s5_518;
					word32 s3_522;
					word32 a5_521;
					word32 a4_520;
					word32 a3_519;
					word32 s3_517;
					word32 s2_516;
					word32 a5_515;
					a0_255 = free_socket(ra, netconn_delete(a0_137, a2_139, a4_141, mstatus, sp_126->t0068, sp_126->t00A8, sp_126->t00E8, sp_126->t0138, sp_126->t0178, out a3_210, out a4_211, out a5_515, out s2_516, out s3_517, out s4_217, out s5_518), 0x01, a3_210, a4_211, s4_217, mstatus, sp_126->t00A8, sp_126->t00E8, sp_126->t0108, sp_126->t0138, sp_126->t0178, out a3_519, out a4_520, out a5_521, out s3_522);
					goto l2306B360;
				}
				Eq_2 a0_160 = (word32) sp_126->w0006;
				sp_126->t0010.u1 = 0x0210;
				word32 a5_164;
				sp_126->w0012 = (word16) lwip_htons(a0_160, out a5_164);
				sp_126->dw0088 = a5_164;
				word32 a3_512;
				word32 a1_510;
				word32 a4_513;
				word32 a5_514;
				word32 a2_511;
				word32 a0_509;
				word32 t1_508;
				ra = memset(ra, &sp_126->w0012 + 3, 0x00, 0x08, out t1_508, out a0_509, out a1_510, out a2_511, out a3_512, out a4_513, out a5_514);
				Eq_2 a5_181 = (word32) sp_126->t0010;
				if (a5_181 < *s2_146)
					*s2_146 = (union Eq_2 *) a5_181;
				word32 a1_523;
				word32 a3_525;
				word32 a7_529;
				word32 a6_528;
				word32 a5_527;
				word32 a4_526;
				word32 a2_524;
				memcpy(s3_147, &sp_126->t0010, *s2_146, out a1_523, out a2_524, out a3_525, out a4_526, out a5_527, out a6_528, out a7_529);
			}
		}
l2306B2AC:
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_385116 a4_294;
		if (((word32) *a5_31 & 0x00F0) != 0x10)
		{
			a4_294.u0 = 95;
			goto l2306B2E0;
		}
		if (a0_255 == ~0x0E)
		{
			a4_294.u0 = 22;
l2306B2E0:
			g_t420267A8 = a4_294;
			goto l2306B2AA;
		}
l2306B360:
		word32 a4_506;
		word32 a5_507;
		Eq_385116 a0_288 = err_to_errno(a0_255, out a4_506, out a5_507);
		if (a0_288 != 0x00)
			g_t420267A8 = a0_288;
		goto l2306B2AA;
	}
}

// 2306B3CA: Register word32 lwip_bind(Register Eq_2 a0, Register (ptr32 Eq_386602) a1, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      iperf_client_udp
//      iperf_server
word32 lwip_bind(Eq_2 a0, struct Eq_386602 * a1, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArgC8, ptr32 & a0Out, ptr32 & a3Out)
{
	ptr32 a5_54;
	word32 a5_189;
	word32 a4_188;
	if (get_socket(a0, out a4_188, out a5_189) == 0x00)
	{
l2306B3DE:
		a5_54 = ~0x00;
		goto l2306B426;
	}
	Eq_2 a0_32;
	if (dwArg34 == 0x10)
	{
		Eq_2 a4_19 = (word32) a1->b0001;
		if (a4_19 == 0x02 && (a1 & 3) == 0x00)
		{
			Eq_2 a5_27;
			Eq_2 a0_26 = lwip_htons((word32) (a1 & 3)->ptr0004->w0002, out a5_27);
			a0_32 = netconn_bind(a0_26, fp + -20, a0_26, a4_19, a5_27, mstatus, dwArg48, dwArg88, dwArgC8, out a3);
			a5_54 = 0x00;
			if (a0_32 == 0x00)
			{
l2306B426:
				a0Out = a5_54;
				a3Out = a3;
				return dwArgE4;
			}
l2306B3FA:
			word32 a5_191;
			word32 a4_190;
			Eq_385116 a0_57 = err_to_errno(a0_32, out a4_190, out a5_191);
			if (a0_57 != 0x00)
				g_t420267A8 = a0_57;
			goto l2306B3DE;
		}
	}
	a0_32.u0 = ~0x0F;
	goto l2306B3FA;
}

// 2306B430: Register word32 lwip_close(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 (ptr32 Eq_2)) a5Out, Register out ptr32 s3Out)
// Called from:
//      ota_tcp_cmd
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
word32 lwip_close(Eq_2 ra, Eq_2 a0, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s3Out)
{
	ptr32 a4_134;
	union Eq_2 ** a5_135;
	if (get_socket(a0, out a4_134, out a5_135) != 0x00)
	{
		union Eq_2 * s2_22 = *a5_135;
		Eq_2 a4_31;
		Eq_2 a5_171;
		Eq_2 a0_30 = get_socket(a0, out a4_31, out a5_171);
		Eq_2 s3_172 = a0_30;
		if (a0_30 != 0x00)
		{
			word32 s4_36 = 0x4201AB08;
			do
			{
				struct Eq_386748 * s0_39 = *a5_171;
				if (s3_172 == a5_171)
				{
					struct Eq_386752 * s0_41 = *((word32) a5_171 + 8);
					s0_41->dw0000 = 0x00;
					s0_41->dw0008 = 0x00;
					s0_39 = (struct Eq_386748 *) *((word32) a5_171 + 4);
					s0_39->dw0004 = 0x00;
					a2 = netconn_join_leave_group(*s3_172, fp + -40, fp + -36, a4_31, a5_171, mstatus, dwArg48, dwArg88, dwArgC8, out a4_31, out a5_171, out s2_22, out s3_172, out s4_36);
				}
			} while (&s0_39->dw0004 + 2 != s4_36);
		}
		Eq_2 a0_103;
		Eq_2 a4_107;
		Eq_2 s4_114;
		word32 s5_316;
		word32 a5_314;
		word32 s2_315;
		Eq_2 s1_111 = netconn_prepare_delete(*s2_22, a2, a4_31, mstatus, dwArg48, dwArg88, dwArgC8, out a0_103, out a3, out a4_107, out a5_314, out s2_315, out s3, out s4_114, out s5_316);
		if (a0_103 == 0x00)
		{
			free_socket(ra, s1_111, s1_111, a3, a4_107, s4_114, mstatus, dwArg78, dwArgB8, dwArgD8, dwArg0108, dwArg0148, out a3, out a4_134, out a5_135, out s3);
l2306B448:
			0x00 = (int8) dwArg0128;
			a2Out = dwArg0100;
			a3Out = a3;
			a4Out = a4_134;
			a5Out = a5_135;
			s3Out = s3;
			return dwArgE4;
		}
		Eq_385116 a0_155 = err_to_errno(a0_103, out a4_134, out a5_135);
		if (a0_155 != 0x00)
		{
			g_t420267A8 = a0_155;
			a5_135 = &g_dw42026000;
		}
	}
	goto l2306B448;
}

// 2306B4D8: Register word32 lwip_connect(Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      ota_tcp_cmd
//      iperf_client_tcp
word32 lwip_connect(Eq_2 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArgC8, ptr32 & a0Out, ptr32 & a3Out)
{
	ptr32 a5_78;
	Eq_2 a4_14;
	word32 a5_235;
	Eq_2 a0_13 = get_socket(a0, out a4_14, out a5_235);
	if (a0_13 == 0x00)
	{
l2306B4EC:
		a5_78 = ~0x00;
		goto l2306B502;
	}
	Eq_2 a0_32;
	Eq_2 a5_18 = (word32) *((word32) a1 + 1);
	if (a5_18 == 0x00)
		a0_32 = netconn_disconnect(*a0_13, dwArg34, a4_14, a5_18, mstatus, dwArg48, dwArg88, dwArgC8, out a3);
	else
	{
		if (dwArg34 != 0x10 || (a5_18 != 0x02 || (a1 & 3) != 0x00))
		{
			a0_32.u0 = ~0x0F;
			goto l2306B520;
		}
		Eq_2 a5_27;
		Eq_2 a0_26 = lwip_htons((word32) (a1 & 3)->ptr0004->w0002, out a5_27);
		a0_32 = netconn_connect(a0_26, fp + -20, a0_26, 0x02, a5_27, mstatus, dwArg48, dwArg88, dwArgC8, out a3);
	}
	a5_78 = 0x00;
	if (a0_32 == 0x00)
	{
l2306B502:
		a0Out = a5_78;
		a3Out = a3;
		return dwArgE4;
	}
l2306B520:
	word32 a5_237;
	word32 a4_236;
	Eq_385116 a0_81 = err_to_errno(a0_32, out a4_236, out a5_237);
	if (a0_81 != 0x00)
		g_t420267A8 = a0_81;
	goto l2306B4EC;
}

// 2306B546: Register Eq_2 lwip_listen(Register Eq_2 a0, Register int32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      iperf_server
Eq_2 lwip_listen(Eq_2 a0, int32 a1, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgD8, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	ptr32 a5_59;
	Eq_2 a4_12;
	word32 a5_161;
	Eq_2 a0_11 = get_socket(a0, out a4_12, out a5_161);
	if (a0_11 != 0x00)
	{
		if (a1 < 0x00)
			a1 = 0x00;
		s0 = *a0_11;
		Eq_2 a0_37 = netconn_listen_with_backlog(a0_11, dwArg44, a4_12, 0x00FF, mstatus, dwArg58, dwArg98, dwArgD8, out a3, out s2);
		a5_59 = 0x00;
		if (a0_37 == 0x00)
		{
l2306B558:
			a0Out = a5_59;
			a3Out = a3;
			s2Out = s2;
			return s0;
		}
		s0 = null;
		if (((word32) null & 0x00F0) != 0x10)
			g_t420267A8.u0 = 95;
		else
		{
			word32 a4_162;
			word32 a5_163;
			Eq_385116 a0_64 = err_to_errno(a0_37, out a4_162, out a5_163);
			if (a0_64 != 0x00)
				g_t420267A8 = a0_64;
		}
	}
	a5_59 = ~0x00;
	goto l2306B558;
}

