pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306B5B2: Register Eq_2 lwip_recvfrom(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s4Out, Register out ptr32 s9Out)
// Called from:
//      lwip_read
//      lwip_recv
Eq_2 lwip_recvfrom(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & s2Out, union Eq_2 & s4Out, ptr32 & s9Out)
{
	Eq_2 a2_154;
	Eq_2 s0_58;
	Eq_2 s1_25 = a5;
	a2_154 = a2;
	union Eq_2 * a5_29;
	word32 a4_180;
	if (get_socket(a0, out a4_180, out a5_29) != 0x00)
	{
		Eq_2 a0_30 = *a5_29;
		if (((word32) *a5_29 & 0x00F0) == 0x10)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg4 = <invalid>;
			Eq_2 stackArg24 = <invalid>;
			Eq_2 stackArg36 = <invalid>;
			Eq_2 stackArg40 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg104 = <invalid>;
			Eq_2 stackArg120 = <invalid>;
			Eq_2 stackArg152 = <invalid>;
			Eq_2 stackArg168 = <invalid>;
			Eq_2 stackArg184 = <invalid>;
			Eq_2 stackArg200 = <invalid>;
			Eq_2 stackArg232 = <invalid>;
			Eq_2 stackArg408 = <invalid>;
			lwip_recv_tcp(ra, s1, a0, a1, a2, a3, mstatus, stackArg4, stackArg24, stackArg36, stackArg40, stackArg56, stackArg104, stackArg120, stackArg152, stackArg168, stackArg184, stackArg200, stackArg232, stackArg408);
			a2_154 = a2;
			s0_58 = a0_30;
			if (a4 != 0x00 && a5 != 0x00)
			{
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg120 = <invalid>;
				Eq_2 stackArg184 = <invalid>;
				Eq_2 stackArg248 = <invalid>;
				word32 a2_198;
				word32 a4_199;
				word32 s2_200;
				word32 s3_201;
				netconn_getaddr(a0, a1, a2, a4, mstatus, stackArg120, stackArg184, stackArg248, out a2_198, out a4_199, out s2_200, out s3_201);
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg116 = <invalid>;
				word32 a0_203;
				word32 a3_204;
				word32 a4_205;
				word32 a5_206;
				lwip_sock_make_addr.isra.3(ra, a1, a2, stackArg116, out a0_203, out a3_204, out a4_205, out a5_206);
				a2_154 = a4;
			}
			goto l2306B610;
		}
		if (a5 != 0x00)
			s1_25 = null;
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg4 = <invalid>;
		Eq_2 stackArg52 = <invalid>;
		Eq_2 stackArg104 = <invalid>;
		Eq_2 stackArg116 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg164 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg408 = <invalid>;
		lwip_recvfrom_udp_raw.isra.6(ra, a0, a1, a3, a4, a5, s4, mstatus, stackArg4, stackArg52, stackArg104, stackArg116, stackArg136, stackArg164, stackArg168, stackArg200, stackArg232, stackArg408);
		a2_154 = fp + -60;
		if (a0_30 == 0x00)
		{
			s0_58.u0 = 0x00;
			if (a2 < 0x00)
				s0_58 = a2;
			if (s1_25 != 0x00)
			{
				null = (union Eq_2 *) s1_25;
				s0_58 = dwArg0194;
			}
l2306B610:
			s1Out = dwArg28;
			a0Out = s0_58;
			a2Out = a2_154;
			a3Out = dwArg08;
			s2Out = a2;
			s4Out = a4;
			s9Out = dwLoc5C;
			return s0_58;
		}
		word32 a4_217;
		word32 a5_218;
		Eq_385116 a0_68 = err_to_errno(a0_30, out a4_217, out a5_218);
		if (a0_68 != 0x00)
			g_t420267A8 = a0_68;
	}
	s0_58.u0 = ~0x00;
	goto l2306B610;
}

// 2306B676: void lwip_read(Register Eq_2 a0, Register Eq_2 a2)
// Called from:
//      ota_tcp_cmd
void lwip_read(Eq_2 a0, Eq_2 a2)
{
	word32 s1_23;
	word32 a0_24;
	word32 a2_25;
	word32 a3_26;
	word32 s2_27;
	word32 s4_28;
	word32 s9_29;
	lwip_recvfrom(a0, a2, 0x00, 0x00, out s1_23, out a0_24, out a2_25, out a3_26, out s2_27, out s4_28, out s9_29);
}

