pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306B680: Register word32 lwip_recv(Register Eq_2 a0, Register Eq_2 a2, Register out Eq_387143 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s9Out)
// Called from:
//      iperf_server
word32 lwip_recv(Eq_2 a0, Eq_2 a2, union Eq_387143 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s9Out)
{
	ptr32 a0_7;
	ptr32 a3_8;
	Eq_387143 s1_13;
	ptr32 s2_14;
	ptr32 s4_15;
	ptr32 s9_17;
	ptr32 a2_20;
	word32 s0_12 = lwip_recvfrom(a0, a2, 0x00, 0x00, out s1_13, out a0_7, out a2_20, out a3_8, out s2_14, out s4_15, out s9_17);
	s1Out = s1_13;
	a0Out = a0_7;
	a2Out = a2_20;
	a3Out = a3_8;
	s2Out = s2_14;
	s4Out = s4_15;
	s9Out = s9_17;
	return s0_12;
}

// 2306B688: Register Eq_2 lwip_sendto(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_send
//      iperf_client_udp
Eq_2 lwip_sendto(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a0_217;
	Eq_2 s3_196 = a0;
	ptr32 s2_195 = a1;
	Eq_2 s0_232 = dwArg74;
	Eq_2 a2_185 = ra;
	struct Eq_387200 * a5_30;
	Eq_2 a4_29;
	if (get_socket(a0, out a4_29, out a5_30) == 0x00)
	{
l2306B6AE:
		a0_217.u0 = ~0x00;
		goto l2306B6CC;
	}
	ui32 a2_37 = (word32) *ra;
	Eq_2 a0_34 = *ra;
	a2_185 = a2_37 & 0x00F0;
	if ((a2_37 & 0x00F0) == 0x10)
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg40 = <invalid>;
		Eq_2 stackArg104 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		word32 s8_486;
		lwip_send(a0, a3, mstatus, stackArg40, stackArg104, stackArg168, out s0_232, out a0_217, out a2_185, out s2_195, out s3_196, out s4, out s5, out s8_486, out mstatus);
		goto l2306B6CC;
	}
	Eq_2 a3_39 = 0x10000000;
	if (dwArg74 >= 0x10000000)
	{
		g_t420267A8.u0 = 90;
		goto l2306B6AE;
	}
	s4 = (word32) (word16) dwArg74;
	if (a4_29 != 0x00)
	{
		if (a5_30 != (struct Eq_387200 *) 0x10)
			goto l2306B6FC;
		a3_39 = (word32) *((word32) a4_29 + 1);
		if (a3_39 != 0x02)
		{
l2306B6FC:
			word32 a4_487;
			word32 a5_488;
			Eq_385116 a0_220 = err_to_errno(~0x0F, out a4_487, out a5_488);
			if (a0_220 != 0x00)
				g_t420267A8 = a0_220;
			goto l2306B6AE;
		}
		a5_30 = a4_29 & 3;
	}
	if (a5_30 == null)
	{
		if (a4_29 != 0x00)
		{
			a4_29 = a5_30->t0004;
			word32 a5_489;
			lwip_htons((word32) *((word32) a4_29 + 2), out a5_489);
		}
		ptr32 mstatus_83;
		Eq_2 s2_87;
		Eq_2 a0_124;
		Eq_2 a4_156;
		Eq_2 a3_155;
		Eq_2 s4_163;
		Eq_2 ra_84 = netbuf_alloc(ra, a0_34, fp + -52, s4, a3_39, a4_29, s4, mstatus, s0, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0_232, out a0_124, out a3_155, out a4_156, out s2_87, out s4_163, out mstatus_83);
		if (a0_124 != 0x00)
		{
			Eq_2 a5_110;
			Eq_2 a4_109;
			Eq_2 a2_113;
			if (((word32) **((word32) a0_124 + 4) & 0x00F0) != 64)
			{
				lwip_chksum_copy(a0_124, s2_87, s4_163, out a0_124, out a2_113, out a4_109);
				a5_110.u0 = 0x02;
			}
			else
			{
				word32 a6_494;
				word32 a3_493;
				word32 a1_492;
				word32 a7_495;
				memcpy(a0_124, s2_87, s0_232, out a1_492, out a2_113, out a3_493, out a4_109, out a5_110, out a6_494, out a7_495);
			}
			a3_155 = netconn_send(a0_124, a2_113, a4_109, a5_110, mstatus_83, dwArg28, dwArg68, dwArgA8, out a4_156, out s4_163);
		}
		a2_185 = netbuf_free(ra_84, fp + -52, a3_155, a4_156, s4_163, mstatus_83, dwArgC8, out s2_195, out s3_196, out s4, out s5, out mstatus);
		word32 a5_491;
		word32 a4_490;
		Eq_385116 a0_209 = err_to_errno(s3_196, out a4_490, out a5_491);
		if (a0_209 != 0x00)
			g_t420267A8 = a0_209;
		a0_217 = s0_232;
		if (s3_196 != 0x00)
			goto l2306B6AE;
l2306B6CC:
		s0Out = s0_232;
		s1Out = a4;
		a0Out = a0_217;
		a2Out = a2_185;
		s2Out = s2_195;
		s3Out = s3_196;
		s4Out = s4;
		s5Out = s5;
		s8Out = dwArg0148;
		mstatusOut = mstatus;
		return dwLoc08;
	}
	goto l2306B6FC;
}

// 2306B7A6: Register Eq_2 lwip_send(Register Eq_2 a0, Register int32 a3, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Register out ptr32 s0Out, Register out Eq_385116 a0Out, Register out Eq_387246 a2Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_sendto
//      iperf_client_tcp
Eq_2 lwip_send(Eq_2 a0, int32 a3, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArgA8, ptr32 & s0Out, union Eq_385116 & a0Out, union Eq_387246 & a2Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_385116 a0_103;
	union Eq_387454 * a5_18;
	word32 a4_232;
	if (get_socket(a0, out a4_232, out a5_18) != 0x00)
	{
		Eq_387454 a0_22 = *a5_18;
		if (((word32) *a5_18 & 0x00F0) != 0x10)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg40 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg72 = <invalid>;
			Eq_2 stackArg104 = <invalid>;
			Eq_2 stackArg116 = <invalid>;
			Eq_2 stackArg120 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg168 = <invalid>;
			Eq_2 stackArg184 = <invalid>;
			Eq_2 stackArg200 = <invalid>;
			Eq_2 stackArg232 = <invalid>;
			word32 s0_244;
			word32 s1_245;
			word32 a2_246;
			ra = lwip_sendto(ra, a1, a1, mstatus, stackArg40, stackArg56, stackArg72, stackArg104, stackArg116, stackArg120, stackArg136, stackArg168, stackArg184, stackArg200, stackArg232, out s0_244, out s1_245, out a0_103, out a2_246, out s2, out s3, out s4, out s5, out s8, out mstatus);
		}
		else
		{
			ui32 a6_27 = 0x03;
			if ((a3 & 16) == 0x00)
				a6_27 = 0x01;
			Eq_2 a0_41 = netconn_write_partly(*a0_22, a6_27 | a3 >> 1 & 0x04, fp + -20, mstatus, dwArg28, dwArg68, dwArgA8, out s2, out s3, out s4, out s5, out s8);
			word32 a4_247;
			word32 a5_248;
			a0_103 = err_to_errno(a0_41, out a4_247, out a5_248);
			if (a0_103 != 0x00)
				g_t420267A8 = a0_103;
			if (a0_41 != 0x00)
				goto l2306B7C0;
		}
l2306B7C2:
		s0Out = dwArgE4;
		a0Out = a0_103;
		a2Out = dwArg0100;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s8Out = s8;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
l2306B7C0:
		a0_103.u0 = ~0x00;
		goto l2306B7C2;
	}
}

