pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306B818: Register Eq_2 lwip_socket(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s5Out)
// Called from:
//      ota_tcp_cmd
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
Eq_2 lwip_socket(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s5Out)
{
	Eq_2 s1_122;
	Eq_385116 a4_118;
	Eq_2 a4_14;
	Eq_2 a0_15;
	if (a1 != 0x02)
	{
		a4_14.u0 = 0x03;
		if (a1 != 0x03)
		{
			if (a1 != 0x01)
			{
				a4_118.u0 = 22;
				goto l2306B886;
			}
			a0_15.u0 = 0x10;
		}
		else
			a0_15.u0 = 64;
	}
	else
	{
		a4_14.u0 = 0x0088;
		a0_15.u0 = 33;
		if (a2 != 0x0088)
			a0_15.u0 = 32;
	}
	Eq_2 a4_51;
	Eq_2 a0_70 = netconn_new_with_proto_and_callback(ra, a0_15, a3, a4_14, mstatus, dwArg34, dwArg68, dwArgA8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, dwArg0148, out a3, out a4_51, out s2, out s5);
	if (a0_70 != 0x00)
	{
		Eq_2 a0_73;
		Eq_2 a2_74;
		Eq_2 a4_76;
		word32 s1_239;
		word32 s3_240;
		Eq_2 s0_79 = alloc_socket(a0_70, 0x00, a3, a4_51, mstatus, out s1_239, out a0_73, out a2_74, out a3, out a4_76, out s2, out s3_240, out s5);
		s1_122 = a0_73;
		if (a0_73 == ~0x00)
		{
			word32 a4_241;
			word32 a5_242;
			word32 s3_243;
			word32 s4_244;
			s1_122 = netconn_delete(s0_79, a2_74, a4_76, mstatus, dwArg58, dwArg98, dwArgD8, dwArg0128, dwArg0168, out a3, out a4_241, out a5_242, out s2, out s3_243, out s4_244, out s5);
			g_t420267A8.u0 = 0x17;
		}
		else
			*((word32) a0_73 + 24) = s0_79;
l2306B88C:
		a3Out = a3;
		s2Out = s2;
		s5Out = s5;
		return s1_122;
	}
	a4_118.u0 = 0x0069;
l2306B886:
	g_t420267A8 = a4_118;
	s1_122.u0 = ~0x00;
	goto l2306B88C;
}

// 2306B8BC: Register Eq_2 lwip_setsockopt(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out Eq_387659 s1Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      iperf_server
//      iperf_client_tcp
Eq_2 lwip_setsockopt(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, union Eq_387659 & s1Out, union Eq_2 & s2Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s8Out)
{
	Eq_2 a4_19;
	word32 a5_205;
	Eq_2 a0_18 = get_socket(a0, out a4_19, out a5_205);
	0x00 = (int8) dwArg84;
	Eq_2 s0_150 = a1;
	if (a0_18 != 0x00)
	{
		if (a3 == 0x00)
		{
			g_t420267A8.u0 = 0x0E;
			goto l2306B8DA;
		}
		Eq_385116 a0_62;
		Eq_2 a0_37;
		Eq_2 a3_39;
		Eq_2 a4_40;
		s0_150 = tcpip_callback(587640020, fp + -44, a3, a4_19, mstatus, dwArg98, dwArgD8, dwArg0118, out s1, out a0_37, out a3_39, out a4_40, out s2, out s4, out s6);
		if (a0_37 != 0x00)
		{
			word32 a4_211;
			word32 a5_212;
			a0_62 = err_to_errno(a0_37, out a4_211, out a5_212);
			if (a0_62 == 0x00)
				goto l2306B8DA;
		}
		else
		{
			word32 a3_207;
			word32 a1_206;
			word32 a4_208;
			word32 a5_209;
			word32 s3_210;
			sys_arch_sem_wait(0x00, a3_39, a4_40, s2, mstatus, a2, dwArg04, a1, dwArgB8, dwArgF8, out s1, out a0_62, out a1_206, out a3_207, out a4_208, out a5_209, out s2, out s3_210, out s4);
			s0_150 = dwArg0114;
			if (a0_62 == 0x00)
			{
l2306B928:
				s1Out = s1;
				s2Out = s2;
				s4Out = s4;
				s6Out = s6;
				s8Out = dwArgD4;
				return s0_150;
			}
		}
		g_t420267A8 = a0_62;
	}
l2306B8DA:
	goto l2306B928;
}

// 2306B930: void tcpip_thread(Register word32 ra, Register Eq_2 s0, Register word32 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register word32 s2, Register word32 s3, Register word32 s4, Register word32 s5, Register ptr32 mstatus)
void tcpip_thread(word32 ra, Eq_2 s0, word32 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, word32 s2, word32 s3, word32 s4, word32 s5, ptr32 mstatus)
{
	<anonymous> * a5_106 = g_ptr4200F5CC;
	struct Eq_387764 * sp_164 = fp + -48;
	if (a5_106 != null)
		a5_106();
	Eq_2 s2_111 = ~0x00;
	word32 s3_112 = 0x4200F000;
	Eq_2 s1_110 = 588002740;
	do
	{
		word32 s4_113;
		Eq_2 a0_42 = sys_timeouts_sleeptime(a5_106);
		if (a0_42 == s2_111)
		{
			word32 a0_203;
			s0 = sys_arch_mbox_fetch(s3_112 + 0x05D4, (char *) sp_164 + 0x0C, 0x00, a3, a4, mstatus, sp_164->t0064, sp_164->t00D8, sp_164->t0118, out s1_110, out a0_203, out a1, out a3, out a4, out a5_106, out s2_111, out s3_112, out s4_113);
			goto l2306B97A;
		}
		if (a0_42 == 0x00)
		{
l2306B990:
			s0 = sys_check_timeouts(ra, s0, s1_110, a1, mstatus, out a1, out a3, out a4, out a5_106, out s2_111, out s3_112);
			continue;
		}
		Eq_2 a0_55;
		s0 = sys_arch_mbox_fetch(s3_112 + 0x05D4, (char *) sp_164 + 0x0C, a0_42, a3, a4, mstatus, sp_164->t0064, sp_164->t00D8, sp_164->t0118, out s1_110, out a0_55, out a1, out a3, out a4, out a5_106, out s2_111, out s3_112, out s4_113);
		if (a0_55 == s2_111)
			goto l2306B990;
l2306B97A:
		if (s0 == 0x00)
			continue;
		a5_106 = (word32) *s0;
	} while (a5_106 > (<anonymous> *) 0x04);
	<anonymous> * a5_132 = *((word32) s1_110 + a5_106 * 0x04);
	word32 a4_146;
	word32 a1_149;
	word32 mstatus_150;
	word32 a3_151;
	a5_132();
}

// 2306B9EA: void tcpip_inpkt(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack (ptr32 Eq_387883) dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      tcpip_input
void tcpip_inpkt(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, struct Eq_387883 * dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	sys_mbox_valid(0x4200F5D4);
	struct Eq_387895 * a0_25;
	Eq_2 a3_28;
	Eq_2 a4_29;
	word32 a2_212;
	word32 a5_213;
	Eq_2 s1_30 = memp_malloc(0x4200F000, 0x09, a3, a4, mstatus, out a0_25, out a2_212, out a3_28, out a4_29, out a5_213);
	if (a0_25 != null)
	{
		*((word32) a1 + 8) = a0_25;
		a0_25->b0000 = 0x02;
		a0_25->dw0004 = a0;
		dwArg44->ptr000C = a0_25;
		word32 a0_42;
		Eq_2 a3_45;
		word32 s1_233;
		word32 a1_234;
		word32 a4_235;
		word32 a5_236;
		word32 a7_237;
		word32 s2_238;
		word32 s3_239;
		word32 s4_240;
		word32 s5_241;
		word32 s6_242;
		Eq_2 s0_50 = sys_mbox_trypost((word32) s1_30 + 0x05D4, a4_29, 0x02, mstatus, a2, a1, dwArgD8, dwArg0118, dwArg0158, out s1_233, out a0_42, out a1_234, out a3_45, out a4_235, out a5_236, out a7_237, out s2_238, out s3_239, out s4_240, out s5_241, out s6_242);
		if (a0_42 == 0x00)
			return;
		Eq_2 a3_72;
		Eq_2 a4_73;
		word32 s1_243;
		word32 a0_244;
		word32 a1_245;
		word32 a2_246;
		word32 a5_247;
		word32 a7_248;
		word32 s2_249;
		word32 s3_250;
		word32 s4_251;
		word32 s5_252;
		word32 s6_253;
		word32 s7_254;
		word32 s8_255;
		word32 s9_256;
		word32 s10_257;
		word32 s11_258;
		word32 t4_259;
		printf(ra, &g_t230C35E4, a3_45, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_243, out a0_244, out a1_245, out a2_246, out a3_72, out a4_73, out a5_247, out a7_248, out s2_249, out s3_250, out s4_251, out s5_252, out s6_253, out s7_254, out s8_255, out s9_256, out s10_257, out s11_258, out t4_259);
		word32 a0_260;
		word32 a2_261;
		word32 a3_262;
		word32 a4_263;
		word32 a5_264;
		memp_free(0x09, s0_50, a3_72, a4_73, mstatus, out a0_260, out a2_261, out a3_262, out a4_263, out a5_264);
	}
	else
	{
		word32 s1_214;
		word32 a0_215;
		word32 a1_216;
		word32 a2_217;
		word32 a3_218;
		word32 a4_219;
		word32 a5_220;
		word32 a7_221;
		word32 s2_222;
		word32 s3_223;
		word32 s4_224;
		word32 s5_225;
		word32 s6_226;
		word32 s7_227;
		word32 s8_228;
		word32 s9_229;
		word32 s10_230;
		word32 s11_231;
		word32 t4_232;
		printf(ra, &g_t230C35D0, a3_28, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_214, out a0_215, out a1_216, out a2_217, out a3_218, out a4_219, out a5_220, out a7_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231, out t4_232);
	}
}

// 2306BA5E: void tcpip_input(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack (ptr32 Eq_387883) dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void tcpip_input(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, struct Eq_387883 * dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a2_10;
	if (((word32) *((word32) a1 + 65) & 0x18) != 0x00)
		a2_10.u0 = 587682442;
	else
		a2_10.u0 = 587656608;
	tcpip_inpkt(ra, a0, a1, a2_10, a3, a4, s2, mstatus, dwArg08, dwArg44, dwArg50, dwArg54, dwArg78, dwArg9C, dwArgD8, dwArg0118, dwArg0158);
}

// 2306BA7C: Register word32 tcpip_callback(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      lwip_setsockopt
//      cmd_sntp_start
//      bl_cipsend
word32 tcpip_callback(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s6Out)
{
	ptr32 a0_28;
	sys_mbox_valid(0x4200F5D4);
	word32 s0_44 = 0x4200F000;
	byte * a0_21;
	word32 a2_118;
	word32 a5_119;
	ptr32 a3_24;
	Eq_2 a4_25;
	Eq_2 s1_26 = memp_malloc(a0, 0x08, a3, a4, mstatus, out a0_21, out a2_118, out a3_24, out a4_25, out a5_119);
	if (a0_21 != null)
	{
		*a0_21 = 0x03;
		*((word32) a1 + 8) = a0_21;
		*((word32) s1_26 + 4) = a0_21;
		word32 s5_120;
		s0_44 = sys_mbox_post(0x4200F5D4, a4_25, 0x03, mstatus, dwLoc1C, a1, dwArgD8, dwArg0118, dwArg0158, out s1_26, out a3_24, out a4_25, out s2, out s5_120, out s6);
		a0_28 = 0x00;
	}
	else
		a0_28 = ~0x00;
	s1Out = s1_26;
	a0Out = a0_28;
	a3Out = a3_24;
	a4Out = a4_25;
	s2Out = s2;
	s4Out = dwArg04;
	s6Out = s6;
	return s0_44;
}

// 2306BAC2: Register Eq_2 tcpip_try_callback(Register Eq_388157 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_388170 a5Out, Register out ptr32 a7Out, Register out Eq_388157 s2Out, Register out ptr32 s3Out, Register out Eq_388174 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      pbuf_alloc
Eq_2 tcpip_try_callback(Eq_388157 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_388170 & a5Out, ptr32 & a7Out, union Eq_388157 & s2Out, ptr32 & s3Out, union Eq_388174 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_101;
	sys_mbox_valid(0x4200F5D4);
	Eq_388157 s2_10 = a0;
	struct Eq_388182 * a0_23;
	word32 a2_159;
	Eq_2 a3_106;
	Eq_2 a4_108;
	Eq_388170 a5_110;
	Eq_2 s1_117 = memp_malloc(0x4200F000, 0x08, a3, a4, mstatus, out a0_23, out a2_159, out a3_106, out a4_108, out a5_110);
	if (a0_23 != null)
	{
		*((word32) a1 + 8) = a0_23;
		a0_23->b0000 = 0x03;
		a0_23->t0004 = a0;
		word32 s4_160;
		s0 = sys_mbox_trypost((word32) s1_117 + 0x05D4, a4_108, 0x03, mstatus, dwLoc1C, a1, dwArgD8, dwArg0118, dwArg0158, out s1_117, out a0_101, out a1, out a3_106, out a4_108, out a5_110, out a7, out s2_10, out s3, out s4_160, out s5, out s6);
		if (a0_101 == 0x00)
		{
l2306BB0A:
			s1Out = s1_117;
			a0Out = a0_101;
			a1Out = a1;
			a3Out = a3_106;
			a4Out = a4_108;
			a5Out = a5_110;
			a7Out = a7;
			s2Out = s2_10;
			s3Out = s3;
			s4Out = dwArg04;
			s5Out = s5;
			s6Out = s6;
			return s0;
		}
		a1 = s0;
		word32 a0_161;
		word32 a2_162;
		s1_117 = memp_free(0x08, s0, a3_106, a4_108, mstatus, out a0_161, out a2_162, out a3_106, out a4_108, out a5_110);
	}
	a0_101 = ~0x00;
	goto l2306BB0A;
}

