pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306BB16: Register word32 tcpip_send_msg_wait_sem(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      netconn_apimsg
//      netconn_gethostbyname
word32 tcpip_send_msg_wait_sem(Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	sys_sem_valid(a2);
	sys_mbox_valid(0x4200F5D4);
	Eq_2 a3_33;
	Eq_2 a4_34;
	Eq_2 s2_40;
	ptr32 s5_43;
	ptr32 s6_44;
	word32 s1_102;
	sys_mbox_post(0x4200F5D4, a4, a5, mstatus, a2, a1, dwArgC8, dwArg0108, dwArg0148, out s1_102, out a3_33, out a4_34, out s2_40, out s5_43, out s6_44);
	ptr32 a3_59;
	ptr32 a4_60;
	ptr32 a5_61;
	ptr32 s1_64;
	ptr32 s2_65;
	ptr32 s3_66;
	ptr32 s4_67;
	word32 a0_103;
	word32 a1_104;
	sys_arch_sem_wait(0x00, a3_33, a4_34, s2_40, mstatus, a2, dwArg14, a1, dwArgC8, dwArg0108, out s1_64, out a0_103, out a1_104, out a3_59, out a4_60, out a5_61, out s2_65, out s3_66, out s4_67);
	s1Out = s1_64;
	a0Out = 0x00;
	a3Out = a3_59;
	a4Out = a4_60;
	a5Out = a5_61;
	s2Out = s2_65;
	s3Out = s3_66;
	s4Out = s4_67;
	s5Out = s5_43;
	s6Out = s6_44;
	return dwArgE4;
}

// 2306BB60: Register Eq_2 tcpip_api_call(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      netifapi_netif_add
//      netifapi_netif_set_addr
//      netifapi_netif_common
Eq_2 tcpip_api_call(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	word32 a0_25;
	word32 a2_170;
	ptr32 a5_141;
	Eq_2 a4_140;
	ptr32 a3_139;
	ptr32 s2_146;
	ptr32 s3_147;
	Eq_2 s1_145 = sys_sem_new(ra, a3, a4, a5, mstatus, s2, s0, ra, dwArgD8, dwArg0118, dwArg0158, out a0_25, out a2_170, out a3_139, out a4_140, out a5_141, out s2_146, out s3_147);
	if (a0_25 == 0x00)
	{
		sys_mbox_valid(0x4200F5D4);
		Eq_2 a3_52;
		Eq_2 a4_53;
		Eq_2 s2_59;
		word32 s1_171;
		word32 s5_172;
		word32 s6_173;
		sys_mbox_post(0x4200F5D4, a4_140, 0x01, mstatus, a1, s1_145, dwArgC8, dwArg0108, dwArg0148, out s1_171, out a3_52, out a4_53, out s2_59, out s5_172, out s6_173);
		Eq_2 a3_77;
		union Eq_2 * s1_82;
		word32 a0_174;
		word32 a1_175;
		word32 a4_176;
		word32 a5_177;
		word32 s4_178;
		sys_arch_sem_wait(0x00, a3_52, a4_53, s2_59, mstatus, a1, dwArg14, s1_145, dwArgC8, dwArg0108, out s1_82, out a0_174, out a1_175, out a3_77, out a4_176, out a5_177, out s2_146, out s3_147, out s4_178);
		word32 s4_179;
		sys_sem_free(s1_82, a3_77, mstatus, dwArg0128, dwArg0168, out s1_145, out a3_139, out a4_140, out a5_141, out s4_179);
	}
	0x00 = (int8) dwArg0128;
	s1Out = s1_145;
	a3Out = a3_139;
	a4Out = a4_140;
	a5Out = a5_141;
	s2Out = s2_146;
	s3Out = s3_147;
	return dwArgE4;
}

// 2306BBC0: Register Eq_2 tcpip_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a6Out)
// Called from:
//      bfl_main
Eq_2 tcpip_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a6Out)
{
	<anonymous> * a0_11;
	word32 a1_12;
	Eq_2 a3_14;
	Eq_2 a4_15;
	Eq_2 ra_19 = lwip_init(ra, mstatus, dwLoc08, dwArg14, dwArg18, dwArg40, dwArg68, dwArg8C, dwArgC8, dwArg0108, dwArg0148, out a0_11, out a1_12, out a3_14, out a4_15);
	g_ptr4200F5CC = a0_11;
	g_dw4200F5D0 = a1_12;
	Eq_2 s3_57;
	word32 a0_115;
	word32 a2_116;
	word32 a3_117;
	word32 a4_118;
	word32 a5_119;
	word32 s2_120;
	word32 s4_121;
	Eq_2 s1_55 = sys_mbox_new(ra_19, a3_14, a4_15, 0x4200F000, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a0_115, out a2_116, out a3_117, out a4_118, out a5_119, out s2_120, out s3_57, out s4_121);
	ptr32 a6_78;
	Eq_2 ra_80 = sys_thread_new(ra_19, s1_55, 0x00, 0x00FFFFA0, 0x1E, s3_57, mstatus, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out a6_78);
	a6Out = a6_78;
	return ra_80;
}

// 2306BC12: Register Eq_2 lwip_htons(Register Eq_2 a0, Register out (ptr32 Eq_331620) a5Out)
// Called from:
//      ota_tcp_cmd
//      get_dns_request
//      lwip_sock_make_addr.isra.3
//      lwip_accept
//      lwip_bind
//      lwip_connect
//      lwip_sendto
//      dns_check_entry
//      dns_recv
//      ip_chksum_pseudo
//      ip_chksum_pseudo_partial
//      etharp_request
//      ip4_input
//      ip4_output_if_opt
//      tcp_oos_insert_segment
//      tcp_free_acked_segments.isra.3
//      tcp_receive
//      tcp_input
//      tcp_create_segment
//      tcp_output_alloc_header_common.constprop.6
//      tcp_split_unsent_seg
//      tcp_send_fin
//      tcp_rexmit_rto_prepare
//      tcp_output
//      tcp_zero_window_probe
//      udp_input
//      udp_sendto
//      ethernet_output
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      altcp_tcp_write
Eq_2 lwip_htons(Eq_2 a0, struct Eq_331620 & a5Out)
{
	a5Out = a0 << 0x08;
	return (word32) (word16) (a0 >> 8 | a0 << 0x08);
}

