pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306BC20: Register Eq_2 lwip_htonl(Register Eq_2 a0, Register out (ptr32 Eq_348146) a3Out, Register out (ptr32 Eq_348147) a4Out, Register out (ptr32 Eq_348148) a5Out)
// Called from:
//      get_dns_request
//      dns_recv
//      dhcp_create_msg
//      dhcp_select
//      dhcp_handle_ack.isra.3
//      dhcp_recv
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_stop
//      ip4addr_aton
//      tcp_free_acked_segments.isra.3
//      tcp_receive
//      tcp_input
//      tcp_create_segment
//      tcp_output_alloc_header_common.constprop.6
//      tcp_split_unsent_seg
//      tcp_rexmit_rto_prepare
//      tcp_rexmit
//      tcp_rst
//      tcp_output
//      tcp_keepalive
//      tcp_zero_window_probe
//      dhcp_server_recv
//      iperf_client_udp
//      sntp_recv
Eq_2 lwip_htonl(Eq_2 a0, struct Eq_348146 & a3Out, struct Eq_348147 & a4Out, struct Eq_348148 & a5Out)
{
	a3Out = (struct Eq_348146 *) 0x00FF0000;
	a4Out = (struct Eq_348147 *) 0x0FFFFF00;
	struct Eq_348148 * a5_10 = a0 << 0x18 | a0 >> 0x18 | a0 << 0x08 & 0x00FF0000;
	a5Out = a5_10;
	return a0 >> 8 & 0x0FFFFF00 | a5_10;
}

// 2306BC44: Register Eq_2 lwip_strnicmp(Register Eq_2 a0, Register (ptr32 (arr byte)) a1, Register int32 a2, Register out Eq_388472 a5Out)
// Called from:
//      dns_gethostbyname
Eq_2 lwip_strnicmp(Eq_2 a0, byte (* a1)[], int32 a2, union Eq_388472 & a5Out)
{
	Eq_388472 a5_24 = 0x00;
	do
	{
		word32 a3_11 = CONVERT(Mem0[a0 + a5_24:byte], byte, word32);
		word32 a4_14 = CONVERT(Mem0[a1 + a5_24:byte], byte, word32);
		if (a3_11 != a4_14 && (((a3_11 | 32) + -97 & 0x00FF) > 0x19 || (a3_11 | 32) != (a4_14 | 32)))
		{
			a5Out = a5_24;
			return 0x01;
		}
		if (a2 + ~0x00 == a5_24)
			break;
		a5_24 = (word32) a5_24.u0 + 1;
	} while (a3_11 != 0x00);
	a5Out = a5_24;
	return 0x00;
}

// 2306BC86: Register Eq_2 dns_call_found(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register (ptr32 code) a3, Register out Eq_388509 s1Out, Register out (ptr32 code) a3Out, Register out (ptr32 Eq_388908) a4Out, Register out (ptr32 word32) a5Out)
// Called from:
//      dns_check_entry
//      dns_recv
Eq_2 dns_call_found(Eq_2 ra, Eq_2 a0, Eq_2 a2, <anonymous> * a3, union Eq_388509 & s1Out, <anonymous> & a3Out, union Eq_388908 & a4Out, word32 & a5Out)
{
	Eq_388509 s1_27 = a0 << 0x03;
	union Eq_388908 * a4_15 = *a3;
	word32 s0_16 = 1107405912;
	if (a3 != null)
		a3();
	word32 * a5_37 = (word32) s1_27.u0 + s0_16;
	*a5_37 = 0x00;
	s1Out = s1_27;
	a3Out = a3;
	a4Out = a4_15;
	a5Out = a5_37;
	return ra;
}

// 2306BCCE: Register Eq_2 dns_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register (ptr32 code) a3, Register Eq_2 s4, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_347740) s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out Eq_2 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      dns_check_entry
Eq_2 dns_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, <anonymous> * a3, Eq_2 s4, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0198, struct Eq_347740 & s1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a5_307;
	ptr32 a4_306;
	ptr32 a3_305;
	Eq_2 ra_323;
	struct Eq_347740 * s1_308;
	if (*((char *) &g_t4200F5E0 + (word32) (*((word32) a0 + 1107406227)) * 0x04) == 0x00)
	{
		ra_323 = dns_call_found(ra, a0, a2, a3, out s1_308, out a3_305, out a4_306, out a5_307);
		*((word32) a0 + 1107406226) = 0x00;
	}
	else
	{
		Eq_2 a3_46;
		Eq_2 a4_47;
		struct Eq_347740 * a0_57;
		struct Eq_388591 * s2_68;
		word32 s5_75;
		word32 s6_76;
		word32 s3_548;
		word32 s4_549;
		word32 s8_550;
		word32 s1_544;
		word32 a1_545;
		word32 a7_547;
		word32 a2_546;
		word32 a1_540;
		word32 a2_541;
		word32 s0_543;
		word32 a5_542;
		ra_323 = pbuf_alloc(ra, (word32) a0 + 1107406231, s1, 0x00B6, (word32) (word16) ((word32) strlen((word32) a0 + 1107406231, out a1_540, out a2_541, out a3_46, out a4_47, out a5_542) + 18), 640, a3_46, a4_47, mstatus, dwLoc3C, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_543, out s1_544, out a0_57, out a1_545, out a2_546, out a3_305, out a4_306, out a5_307, out a7_547, out s2_68, out s3_548, out s4_549, out s5_75, out s6_76, out s8_550, out mstatus);
		s1_308 = a0_57;
		if (a0_57 != null)
		{
			word32 a3_555;
			word32 a5_557;
			word32 a4_556;
			word32 a0_552;
			word32 a2_554;
			word32 a1_553;
			word32 t1_551;
			Eq_2 ra_93 = memset(ra_323, fp + -60, 0x00, 0x0C, out t1_551, out a0_552, out a1_553, out a2_554, out a3_555, out a4_556, out a5_557);
			word32 a5_558;
			lwip_htons((word32) s2_68->w0008, out a5_558);
			word32 s8_116;
			word32 s4_561;
			word32 s3_560;
			word32 s2_559;
			Eq_2 s1_114;
			Eq_2 a4_120;
			Eq_2 a3_119;
			Eq_2 s0_113 = pbuf_take(a0_57, fp + -60, 0x0C, out s1_114, out a3_119, out a4_120, out s2_559, out s3_560, out s4_561, out s8_116);
			Eq_2 s2_130 = 0x0C;
			Eq_2 s8_132 = s8_116 + ~0x01;
			do
			{
				Eq_2 s0_134 = (word32) s0_113 + 1;
				s9 = s0_134;
				ui32 a2_136 = 0x00;
				s0_137 = s0_134;
				while (true)
				{
					Eq_2 s0_137;
					int32 a5_139 = (word32) *s0_137;
					if (a5_139 == 46 || a5_139 == 0x00)
						break;
					a2_136 = a2_136 + 0x01 & 0x00FF;
					s0_137 = (word32) s0_137 + 1;
				}
				Eq_2 s4_154 = (word32) s2_130 + a2_136;
				Eq_2 s7_155 = (word32) (word16) (s0_137 - s0_134);
				if (s8_132 < s4_154)
				{
					word32 s5_570;
					word32 s8_572;
					word32 s6_571;
					word32 s2_567;
					word32 s4_569;
					word32 s3_568;
					word32 a1_564;
					word32 a7_566;
					word32 a2_565;
					word32 a0_563;
					word32 s0_562;
					ra_323 = pbuf_free(ra_93, s1_114, a3_119, a4_120, s4_154, mstatus, dwArgE8, out s0_562, out s1_308, out a0_563, out a1_564, out a2_565, out a3_305, out a4_306, out a5_307, out a7_566, out s2_567, out s3_568, out s4_569, out s5_570, out s6_571, out s8_572, out mstatus);
					goto l2306BD1A;
				}
				pbuf_put_at(s0_137, s1_114, s2_130, a2_136);
				word32 s4_203 = (word32) (word16) s4_200;
				uint32 s2_206 = s4_203 + 1 << 16;
				word32 s4_200;
				word32 s2_573;
				word32 s3_574;
				s0_113 = pbuf_take_at(s1_114, s0_134, s7_155, (word32) (word16) ((word32) s2_130 + 1), dwArgE8, out s1_114, out a3_119, out a4_120, out s2_573, out s3_574, out s4_200, out s8_132);
				s2_130 = s2_206 >> 0x10;
			} while ((word32) *s0_113 != 0x00);
			pbuf_put_at(s0_113, s1_114, s2_206 >> 0x10, 0x00);
			word32 s8_578;
			word32 s2_577;
			word32 a4_576;
			ptr32 s3_231;
			Eq_2 s1_237;
			Eq_2 s4_246;
			word32 a3_575;
			pbuf_take_at(s1_114, fp + -64, 0x04, (word32) (word16) (s4_203 + 0x02), dwArgE8, out s1_237, out a3_575, out a4_576, out s2_577, out s3_231, out s4_246, out s8_578);
			word32 a2_580;
			word32 s3_581;
			word32 s0_579;
			word32 s5_583;
			word32 s4_582;
			Eq_2 a0_270;
			Eq_2 a3_273;
			Eq_2 a4_274;
			ptr32 mstatus_278;
			Eq_2 s1_281;
			word32 s0_584;
			word32 a0_585;
			word32 a1_586;
			word32 a2_587;
			word32 a7_588;
			word32 s2_589;
			word32 s3_590;
			word32 s4_591;
			word32 s5_592;
			word32 s6_593;
			word32 s8_594;
			ra_323 = pbuf_free(udp_sendto(ra_93, g_t4200F5D8, s1_237, ((word32) (s3_231 + (s5_75 + 272))->b000B << 2) + (s6_76 + 0x05E0), 53, s4_246, mstatus, s4, dwLoc18, dwArg08, dwArg38, s9, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0_579, out s1_281, out a0_270, out a2_580, out a3_273, out a4_274, out s3_581, out s4_582, out s5_583, out s9, out mstatus_278), s1_281, a3_273, a4_274, a0_270, mstatus_278, dwArgE8, out s0_584, out s1_308, out a0_585, out a1_586, out a2_587, out a3_305, out a4_306, out a5_307, out a7_588, out s2_589, out s3_590, out s4_591, out s5_592, out s6_593, out s8_594, out mstatus);
		}
	}
l2306BD1A:
	0x00 = (int8) dwArg0198;
	s1Out = s1_308;
	a2Out = dwArg0138;
	a3Out = a3_305;
	a4Out = a4_306;
	a5Out = a5_307;
	s4Out = dwLoc14;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra_323;
}

// 2306BE5A: Register Eq_2 dns_check_entry(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s4, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0198, Register out Eq_2 s1Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_2) a3Out, Register out (ptr32 Eq_388907) a4Out, Register out Eq_388908 a5Out, Register out Eq_2 s4Out, Register out Eq_2 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      dns_recv
//      dns_tmr
//      dns_gethostbyname
Eq_2 dns_check_entry(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 s4, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0198, union Eq_2 & s1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, struct Eq_388907 & a4Out, union Eq_388908 & a5Out, union Eq_2 & s4Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	<anonymous> * a3_147;
	struct Eq_388913 * a0_48;
	union Eq_2 * a3_15 = (union Eq_2 *) 0x02;
	Eq_388908 a5_17 = (word32) a0 + 1107406216;
	struct Eq_388907 * a4_18 = (word32) *((word32) a0 + 1107406226);
	if (a4_18 != (struct Eq_388907 *) 0x02)
	{
		a3_15 = (union Eq_2 *) 0x03;
		if (a4_18 != (struct Eq_388907 *) 0x03)
		{
			a5_17.u0 = 0x01;
			if (a4_18 == (struct Eq_388907 *) 0x01)
			{
				word32 a4_76 = (word32) g_w4200F5E8;
				a3_147 = (<anonymous> *) &g_w4200F5E8;
l2306BEA0:
				word32 a4_81 = a4_76 + 0x01;
				a4_76 = (word32) (word16) a4_81;
				struct Eq_388956 * a5_85 = &g_t4201AC78;
				do
				{
					if ((word32) a5_85->b000A == 0x02 && (word32) a5_85->w0008 == (word32) ((word16) a4_81))
						goto l2306BEA0;
					++a5_85;
				} while (a5_85 != &g_t4201B0B8);
				g_w4200F5E8 = (word16) a4_76;
				*((word32) a0 + 1107406226) = 0x02;
				*((word32) a0 + 1107406224) = (word16) a4_76;
				*((word32) a0 + 1107406228) = 0x01;
l2306BEDE:
				Eq_2 a2_150;
				union Eq_2 * a3_151;
				struct Eq_388907 * a4_152;
				Eq_388908 a5_153;
				ptr32 mstatus_156;
				Eq_2 s1_159;
				Eq_2 s4_162;
				Eq_2 s9_174;
				Eq_2 ra_157 = dns_send(ra, s1, a0, dwArg10, a3_147, s4, s9, mstatus, dwArg04, dwArg08, dwArg38, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, dwArg0198, out s1_159, out a2_150, out a3_151, out a4_152, out a5_153, out s4_162, out s9_174, out mstatus_156);
				s1Out = s1_159;
				a2Out = a2_150;
				a3Out = a3_151;
				a4Out = a4_152;
				a5Out = a5_153;
				s4Out = s4_162;
				s9Out = s9_174;
				mstatusOut = mstatus_156;
				return ra_157;
			}
			goto l2306BF40;
		}
		a5_17 = a4_18->dw0000;
		if (a4_18 != null)
		{
			a4_18->tFFFFFFFF = a5_17;
			a4_18 = (struct Eq_388907 *) &a4_18->tFFFFFFFF;
			if (a4_18 != (struct Eq_388907 *) ~0x00)
				goto l2306BF40;
		}
		a5_17.u0 = 272;
		a0_48 = (word32) a0 + 272;
	}
	else
	{
		a4_18 = (word32) *((word32) a0 + 1107406228) + ~0x00 & 0x00FF;
		*((word32) a0 + 1107406228) = (byte) a4_18;
		if (a4_18 != null)
			goto l2306BF40;
		ui32 a4_26 = (word32) *((word32) a0 + 1107406229) + 0x01 & 0x00FF;
		*((word32) a0 + 1107406229) = (byte) a4_26;
		a3_147 = (<anonymous> *) 0x04;
		if (a4_26 != 0x04)
		{
			*((word32) a0 + 1107406228) = (byte) a4_26;
			goto l2306BEDE;
		}
		if ((word32) *((word32) a0 + 1107406227) == 0x00 && g_dw4200F5E4 != 0x00)
		{
			*((word32) a0 + 1107406227) = 0x01;
			*((word32) a0 + 1107406228) = 0x01;
			goto l2306BEDE;
		}
		ra = dns_call_found(ra, a0, a2, (<anonymous> *) 0x04, out s1, out a3_15, out a4_18, out a5_17);
		a0_48 = (word32) s1 + 272;
	}
	a0_48->b4201AC82 = 0x00;
l2306BF40:
	s1Out = s1;
	a2Out = dwArg10;
	a3Out = a3_15;
	a4Out = a4_18;
	a5Out = a5_17;
	s4Out = s4;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra;
}

// 2306BF66: void dns_recv(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s5, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgE4, Stack Eq_2 dwArg0128)
void dns_recv(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 s4, Eq_2 s5, word32 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgE4, Eq_2 dwArg0128)
{
	uint16 wLoc5E = SLICE(dwLoc60, uint16, 16);
	uint16 wLoc60 = (uint16) dwLoc60;
	uint16 wLoc44_1032 = (uint16) s4;
	uint16 wLoc4A_1024 = SLICE(s8, uint16, 16);
	uint16 wLoc4C_1039 = (uint16) s8;
	Eq_2 a4_111 = (word32) *((word32) a2 + 8);
	Eq_2 s1_207 = a2;
	if (a4_111 > 0x0F)
	{
		Eq_2 a0_40;
		word32 a2_1102;
		word32 a1_1101;
		word32 a5_1103;
		word32 s8_1106;
		word32 s2_1104;
		word32 s3_1105;
		pbuf_copy_partial(a2, fp + -88, 0x0C, 0x00, out s1_207, out a0_40, out a1_1101, out a2_1102, out a3, out a4_111, out a5_1103, out s2_1104, out s3_1105, out s4, out s8_1106);
		Eq_2 s0_119 = a0_40;
		if (a0_40 == 0x0C)
		{
			ui32 s2_64;
			word32 a5_1107;
			Eq_2 a0_65 = lwip_htons((word32) wLoc58, out a5_1107);
			struct Eq_389183 * a5_67 = &g_t4201AC78;
			a3.u0 = 0x02;
			a4_111.u0 = 0x04;
			for (s2_64 = 0x00; s2_64 != 0x04; ++s2_64)
			{
				Eq_2 s6_75 = s2_64 & 0x00FF;
				if ((word32) a5_67->b000A == 0x02 && (word32) a5_67->w0008 == a0_65)
				{
					word32 a5_1108;
					Eq_2 a0_88 = lwip_htons((word32) wLoc54, out a5_1108);
					s4 = a0_88;
					word32 a5_1109;
					Eq_2 s5_290 = lwip_htons((word32) wLoc52, out a5_1109);
					if ((int32) bLoc56 >= 0x00 || a0_88 != 0x01)
						break;
					s4 = s2_64 + 272;
					a4_111 = *a3.u0;
					if (a4_111 != *((char *) (&g_t4200F5E0) + (word32) (*((word32) s4 + 1107405955)) * 0x04))
						break;
					byte * s7_115 = (word32) s4 + 1107405959;
					do
					{
						word32 a5_1111;
						int32 a0_123 = pbuf_try_get_at(s1_207, s0_119, out a3, out a4_111, out a5_1111);
						if (a0_123 < 0x00 || s0_119 == 0x0FFFFFFF)
							goto l2306C29A;
						a4_111.u0 = 0x00C0;
						s0_119 = (word32) (word16) ((word32) s0_119 + 1);
						if ((a0_123 & 0x00C0) == 0x00C0)
							goto l2306C29A;
						byte * a5_136 = s7_115 + a0_123;
						for (; s7_115 != a5_136; ++s7_115)
						{
							int32 a0_145 = pbuf_try_get_at(s1_207, s0_119, out a3, out a4_111, out a5_136);
							if (a0_145 < 0x00)
								goto l2306C29A;
							a4_111 = (word32) *s7_115;
							if (((word32) *((word32) a4_111 + 588035505) & 0x03) == 0x01)
								a4_111 += 32;
							ui32 a3_164 = (word32) (a0_145 & 0x00FF)->b230CB5B1;
							Eq_2 a0_160 = a0_145 & 0x00FF;
							a3 = a3_164 & 0x03;
							if ((a3_164 & 0x03) == 0x01)
								a0_160 = (a0_145 & 0x00FF) + 32;
							if (a4_111 != a0_160 || s0_119 == 0x0FFFFFFF)
								goto l2306C29A;
							s0_119 = (word32) (word16) ((word32) s0_119 + 1);
						}
						++s7_115;
						word32 a5_1110;
						int32 a0_185 = pbuf_try_get_at(s1_207, s0_119, out a3, out a4_111, out a5_1110);
						if (a0_185 < 0x00)
							goto l2306C29A;
					} while (a0_185 != 0x00);
					if (s0_119 == 0x0FFFFFFF)
						break;
					Eq_2 s7_195 = (word32) (word16) ((word32) s0_119 + 1);
					if (s7_195 == 0x0FFFFFFF)
						break;
					word32 a0_200;
					Eq_2 a2_201;
					struct Eq_389295 * s8_205;
					word32 s2_208;
					word32 s3_214;
					word32 a1_1112;
					word32 a5_1113;
					Eq_2 s0_203 = pbuf_copy_partial(s1_207, fp + -96, 0x04, s7_195, out s1_207, out a0_200, out a1_1112, out a2_201, out a3, out a4_111, out a5_1113, out s2_208, out s3_214, out s4, out s8_205);
					if (a0_200 != 0x04)
						break;
					Eq_2 a5_224 = (word32) wLoc5E;
					a4_111.u0 = 0x0100;
					if (a5_224 != 0x0100)
						break;
					a4_111 = (word32) wLoc60;
					if (a4_111 != a5_224 || s7_195 > 0x0FFFFFFB)
						break;
					if (((word32) bLoc55 & 0x0F) == 0x00)
					{
						Eq_2 s0_285 = (word32) (word16) ((word32) s0_203 + 5);
						Eq_2 s8_287 = 0x0FFFFFFF;
						while (s5_290 != 0x00)
						{
							a4_111 = (word32) *((word32) s1_207 + 8);
							if (s0_285 >= a4_111)
								break;
							do
							{
								word32 a5_1129;
								int32 a0_358 = pbuf_try_get_at(s1_207, s0_285, out a3, out a4_111, out a5_1129);
								if (a0_358 < 0x00 || a3 == 0x00)
									goto l2306C29A;
								if ((a0_358 & 0x00C0) == 0x00C0)
								{
									s0_285 = a3;
									break;
								}
								int32 a0_369 = (byte) a3.u0 + a0_358;
								if (a0_369 >= (word32) (*((word32) s1_207 + 8)))
									goto l2306C29A;
								s0_285 = (word32) (word16) a0_369;
								word32 a5_1130;
								int32 a0_374 = pbuf_try_get_at(s1_207, s0_285, out a3, out a4_111, out a5_1130);
								if (a0_374 < 0x00)
									goto l2306C29A;
							} while (a0_374 != 0x00);
							if (s0_285 == s8_287)
								goto l2306C29A;
							a4_111 = (word32) (word16) ((word32) s0_285 + 1);
							if (a4_111 == s8_287)
								goto l2306C29A;
							word32 a0_394;
							word32 s3_1136;
							word32 a1_1131;
							word32 a5_1134;
							word32 s2_1135;
							word32 a2_1132;
							word32 a3_1133;
							Eq_2 s0_397 = pbuf_copy_partial(s1_207, fp + -76, 0x0A, a4_111, out s1_207, out a0_394, out a1_1131, out a2_1132, out a3_1133, out a4_111, out a5_1134, out s2_1135, out s3_1136, out s4, out s8_287);
							a3.u0 = 0x0A;
							if (a0_394 != 0x0A || a4_111 > 0x0FFFFFF5)
								goto l2306C29A;
							uint32 s0_420 = (word32) s0_397 + 11 << 0x10;
							Eq_2 a0_423 = (word32) wLoc44_1032;
							if ((word32) wLoc4A_1024 == 0x0100 && ((word32) wLoc4C_1039 == 0x0100 && a0_423 == 0x0400))
							{
								word32 a0_456;
								struct Eq_389502 * s2_464;
								word32 a1_1138;
								word32 a5_1140;
								word32 a2_1139;
								word32 s8_1142;
								word32 s3_1141;
								pbuf_copy_partial(s1_207, fp + -92, 0x04, s0_420 >> 16, out s1_207, out a0_456, out a1_1138, out a2_1139, out a3, out a4_111, out a5_1140, out s2_464, out s3_1141, out s4, out s8_1142);
								if (a0_456 != 0x04)
									goto l2306C29A;
								s2_464->dw4201AD8C = (char *) s2_464 + 272;
								Eq_2 a0_551;
								Eq_2 a2_552;
								word32 s2_561;
								struct Eq_389535 * s3_562;
								Eq_2 s6_567;
								word32 a5_1148;
								word32 s5_1151;
								word32 s8_1152;
								word32 mstatus_1153;
								word32 s4_1150;
								word32 a7_1149;
								word32 s0_1143;
								word32 a3_1146;
								word32 a4_1147;
								word32 s1_1144;
								word32 a1_1145;
								Eq_2 ra_575 = pbuf_free(ra, s1_207, a3, a4_111, dwArg74, mstatus, dwArgB8, out s0_1143, out s1_1144, out a0_551, out a1_1145, out a2_552, out a3_1146, out a4_1147, out a5_1148, out a7_1149, out s2_561, out s3_562, out s4_1150, out s5_1151, out s6_567, out s8_1152, out mstatus_1153);
								<anonymous> * a3_578;
								word32 a4_1154;
								word32 a5_1155;
								Eq_2 a0_577 = lwip_htonl(a0_551, out a3_578, out a4_1154, out a5_1155);
								s3_562->b000A = 0x03;
								if (a0_577 <= 604800)
									s3_562->t0000 = a0_577;
								else
									s3_562->t0000.u0 = 604800;
								word32 s1_1156;
								word32 a3_1157;
								word32 a4_1158;
								word32 a5_1159;
								dns_call_found(ra_575, s6_567, a2_552, a3_578, out s1_1156, out a3_1157, out a4_1158, out a5_1159);
								struct Eq_389589 * s2_607 = s2_561 + 272 + dwArgE4;
								if (s2_607->dw0000 == 0x00 && (word32) s2_607->b000A == 0x03)
									s2_607->b000A = 0x00;
								return;
							}
							word32 a5_1137;
							if ((word32) lwip_htons(a0_423, out a5_1137) + (s0_420 >> 16) >= 0x10000000)
								goto l2306C29A;
							word32 a5_1160;
							s0_285 = (word32) (word16) ((word32) lwip_htons((word32) wLoc44_1032, out a5_1160) + (s0_420 >> 16));
							s5_290 = (word32) (word16) ((word32) s5_290 - 1);
						}
					}
					else
					{
						struct Eq_389334 * a5_232 = s2_208 + 272 + s3_214;
						a4_111 = (word32) a5_232->b000B;
						if (a4_111 == 0x00)
						{
							a4_111 = s8_205->t0004;
							if (a4_111 != 0x00)
							{
								a5_232->w000C = 0x0301;
								word32 a5_1162;
								word32 s9_1163;
								word32 a2_1161;
								ra = dns_check_entry(ra, s1_207, s6_75, a2_201, s4, 0x0FFFFFFB, mstatus, dwLoc6C, dwLoc68, dwLoc60, dwLoc38, dwLoc08, dwArg08, dwArg18, dwArg28, s5, dwArg48, dwArg68, dwArg78, dwArgA8, dwArg0128, out s1_207, out a2_1161, out a3, out a4_111, out a5_1162, out s4, out s9_1163, out mstatus);
								break;
							}
						}
					}
					Eq_2 a2_311;
					<anonymous> * a3_316;
					word32 s2_320;
					ptr32 s3_321;
					Eq_2 s6_326;
					word32 s5_1122;
					word32 s1_1125;
					word32 a3_1126;
					word32 a5_1128;
					word32 a4_1127;
					word32 mstatus_1124;
					word32 s8_1123;
					word32 s0_1114;
					word32 a0_1116;
					word32 a1_1117;
					word32 a7_1120;
					word32 s4_1121;
					word32 a4_1118;
					word32 a5_1119;
					word32 s1_1115;
					dns_call_found(pbuf_free(ra, s1_207, a3, a4_111, s4, mstatus, dwArgB8, out s0_1114, out s1_1115, out a0_1116, out a1_1117, out a2_311, out a3_316, out a4_1118, out a5_1119, out a7_1120, out s2_320, out s3_321, out s4_1121, out s5_1122, out s6_326, out s8_1123, out mstatus_1124), s6_326, a2_311, a3_316, out s1_1125, out a3_1126, out a4_1127, out a5_1128);
					(s3_321 + (s2_320 + 272))->b000A = 0x00;
					return;
				}
				++a5_67;
			}
		}
	}
l2306C29A:
	word32 s8_1099;
	word32 s4_1096;
	word32 mstatus_1100;
	word32 a0_1087;
	word32 s0_1085;
	word32 s6_1098;
	word32 s1_1086;
	word32 a1_1088;
	word32 a2_1089;
	word32 a5_1092;
	word32 a3_1090;
	word32 a4_1091;
	word32 a7_1093;
	word32 s2_1094;
	word32 s3_1095;
	word32 s5_1097;
	pbuf_free(ra, s1_207, a3, a4_111, s4, mstatus, dwArgB8, out s0_1085, out s1_1086, out a0_1087, out a1_1088, out a2_1089, out a3_1090, out a4_1091, out a5_1092, out a7_1093, out s2_1094, out s3_1095, out s4_1096, out s5_1097, out s6_1098, out s8_1099, out mstatus_1100);
}

// 2306C2DC: void dns_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 word32) a5, Register ptr32 mstatus)
// Called from:
//      lwip_init
void dns_init(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, word32 * a5, ptr32 mstatus)
{
	word32 s0_8 = *a5;
	if (a5 != null)
		return;
	word32 s1_72;
	word32 a3_73;
	word32 a4_74;
	word32 a5_75;
	udp_new_ip_type(ra, s1, a3, a4, mstatus, out s1_72, out a3_73, out a4_74, out a5_75);
	*(word32 *) 46 = s0_8;
	word32 a3_76;
	word32 a4_77;
	word32 a5_78;
	Eq_2 a0_33 = udp_bind(46, 588036828, null, out a3_76, out a4_77, out a5_78);
	udp_recv(a0_33, &g_t2306BF66, 0x00);
}

