pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306C324: Register uint32 dns_setserver(Register uint32 a0, Register ptr32 a1, Register (ptr32 Eq_109206) a4, Register out (ptr32 Eq_109206) a4Out, Register out Eq_109206 a5Out)
// Called from:
//      stateConnectedIPNoEnter
//      dhcp_handle_ack.isra.3
uint32 dns_setserver(uint32 a0, ptr32 a1, union Eq_109206 * a4, union Eq_109206 & a4Out, union Eq_109206 & a5Out)
{
	Eq_109206 a5_23 = 0x01;
	if (a0 <= 0x01)
	{
		a0 <<= 2;
		a5_23 = (a0 << 2) + 0x4200F5E0;
		if (a1 == 0x00)
			a4 = g_ptr230CBADC;
		*a4 = (union Eq_109206 *) a5_23;
	}
	a4Out = a4;
	a5Out = a5_23;
	return a0;
}

// 2306C348: Register ui32 dns_getserver(Register uint32 a0)
// Called from:
//      wifi_mgmr_sta_dns_get
//      netif_status_callback
ui32 dns_getserver(uint32 a0)
{
	if (a0 > 0x01)
		return 0x01;
	return a0 << 0x02;
}

// 2306C368: void dns_tmr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s4, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198)
void dns_tmr(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 s4, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0188, Eq_2 dwArg0198)
{
	Eq_2 a2_12;
	ptr32 mstatus_21;
	Eq_2 s1_24;
	Eq_2 s4_28;
	Eq_2 s9_32;
	Eq_2 a2_40;
	ptr32 mstatus_49;
	Eq_2 s1_52;
	Eq_2 s4_56;
	Eq_2 s9_60;
	ptr32 mstatus_77;
	Eq_2 s1_80;
	Eq_2 s4_84;
	Eq_2 s9_88;
	word32 a3_148;
	word32 a4_149;
	word32 a5_150;
	word32 a3_151;
	word32 a4_152;
	word32 a5_153;
	word32 a2_154;
	word32 a3_155;
	word32 a4_156;
	word32 a5_157;
	Eq_2 ra_78 = dns_check_entry(dns_check_entry(dns_check_entry(ra, s1, 0x00, a2, s4, s9, mstatus, dwLoc0C, dwLoc08, dwArg00, dwArg28, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, dwArg0188, out s1_24, out a2_12, out a3_148, out a4_149, out a5_150, out s4_28, out s9_32, out mstatus_21), s1_24, 0x01, a2_12, s4_28, s9_32, mstatus_21, dwLoc0C, dwLoc08, dwArg00, dwArg28, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, dwArg0188, out s1_52, out a2_40, out a3_151, out a4_152, out a5_153, out s4_56, out s9_60, out mstatus_49), s1_52, 0x02, a2_40, s4_56, s9_60, mstatus_49, dwLoc0C, dwLoc08, dwArg00, dwArg28, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, dwArg0188, out s1_80, out a2_154, out a3_155, out a4_156, out a5_157, out s4_84, out s9_88, out mstatus_77);
	word32 s1_158;
	word32 a2_159;
	word32 a3_160;
	word32 a4_161;
	word32 a5_162;
	word32 s4_163;
	word32 s9_164;
	word32 mstatus_165;
	dns_check_entry(ra_78, s1_80, 0x03, dwArg10, s4_84, s9_88, mstatus_77, dwArg04, dwArg08, dwArg10, dwArg38, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, dwArg0198, out s1_158, out a2_159, out a3_160, out a4_161, out a5_162, out s4_163, out s9_164, out mstatus_165);
}

// 2306C388: Register Eq_2 dns_gethostbyname_addrtype(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_389890) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      dns_gethostbyname
//      lwip_netconn_do_gethostbyname
Eq_2 dns_gethostbyname_addrtype(Eq_2 ra, Eq_2 a0, struct Eq_389890 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	if (a1 == null)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x0F;
		a3Out = a3;
		a4Out = ~0x0F;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	ptr32 a4_101;
	Eq_2 s2_237 = a0;
	if (a0 != 0x00)
	{
		a5 = (word32) *a0;
		if (a5 != 0x00)
		{
			a5 = g_t4200F5D8;
			if (a5 != 0x00)
			{
				word32 a4_574;
				word32 a5_575;
				word32 a1_572;
				word32 a2_573;
				Eq_2 a0_39 = strlen(a0, out a1_572, out a2_573, out a3, out a4_574, out a5_575);
				a5.u0 = 0x00FF;
				s3 = a0_39;
				if (a0_39 <= 0x00FF)
				{
					word32 a0_50;
					Eq_2 s4_65;
					word32 s8_577;
					word32 a4_576;
					ip4addr_aton(a0, a1, out a0_50, out a3, out a4_576, out a5, out s4_65, out s8_577);
					a4_101 = 0x00;
					if (a0_50 == 0x00)
					{
						struct Eq_389981 * s8_110 = &g_t4201AC78;
						Eq_2 s9_70 = 1107405944;
						s1.u0 = 0x0110;
						do
						{
							if ((word32) s9_70.u31->b000A == 0x03 && lwip_strnicmp(a0, &(s9_70.u31)->b000A + 5, 0x0100, out a5) == 0x00)
							{
								a1->t0000 = a5;
								s1.u0 = s1.u0;
								a4_101 = 0x00;
								goto l2306C392;
							}
							s1 = (byte) s1.u0 + 1;
							++s9_70.u31;
						} while (s1 != ~0x010B);
						a5 = g_t4200F5E0;
						a4_101 = ~0x05;
						if (a5 != 0x00)
						{
							a3 = (word32) g_b4200F5DC;
							a5.u0 = 0x00;
							s1.u0 = 0x04;
							uint32 a2_106 = 0x00;
							do
							{
								struct Eq_390027 * s0_140;
								word32 a4_112 = (word32) s8_110->b000A;
								Eq_2 a1_114 = a5 & 0x00FF;
								if (a4_112 == 0x00)
								{
									s1 = a1_114;
									s0_140 = (struct Eq_390027 *) ((byte) a5.u0 + 1107406216);
									goto l2306C486;
								}
								if (a4_112 == 0x03)
								{
									ui32 a4_118 = a3 - (word32) s8_110->b000E;
									if (a2_106 < (a4_118 & 0x00FF))
									{
										s1 = a1_114;
										a2_106 = a4_118 & 0x00FF;
									}
								}
								a5 = (byte) a5.u0 + 1;
								++s8_110;
							} while (a5 != 0x04);
							a4_101 = ~0x00;
							if (s1 != a5)
							{
								struct Eq_390124 * s0_133 = (byte) s1.u0 + 272;
								a5.u0 = 0x03;
								a4_101 = ~0x00;
								s0_140 = (struct Eq_390027 *) ((char *) s0_133 + 1107405944);
								if ((word32) s0_133->b4201AC82 == 0x03)
								{
l2306C486:
									s0_140->b000A = 0x01;
									s0_140->b000E = (byte) a3;
									struct Eq_390048 * a4_152 = s1 << 0x03;
									a4_152->t4201AC58 = s4_65;
									a4_152->t4201AC5C = a3;
									word32 a1_578;
									word32 a3_579;
									word32 a4_580;
									word32 a6_582;
									Eq_2 a2_186;
									word32 a5_581;
									word32 a7_583;
									memcpy(&s0_140->b000E + 1, a0, a0_39, out a1_578, out a2_186, out a3_579, out a4_580, out a5_581, out a6_582, out a7_583);
									word32 a5_198 = (word32) g_b4200F5DC;
									Mem200[s0_140 + a0_39 + 0x0F:byte] = 0x00;
									g_b4200F5DC = (byte) (a5_198 + 0x01);
									word32 a2_584;
									word32 a4_585;
									word32 s4_586;
									word32 s9_587;
									ra = dns_check_entry(ra, s1, s1, a2_186, s4_65, s9_70, mstatus, s8, s6, s2, dwArg08, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, dwArg0168, out s1, out a2_584, out a3, out a4_585, out a5, out s4_586, out s9_587, out mstatus);
									a4_101 = ~0x04;
								}
							}
						}
					}
					goto l2306C392;
				}
			}
		}
	}
	a4_101 = ~0x0F;
l2306C392:
	0x00 = (int8) dwArg0128;
	0x00 = (int8) dwArg1C;
	s0Out = s4;
	s1Out = s1;
	a0Out = a4_101;
	a3Out = a3;
	a4Out = a4_101;
	a5Out = a5;
	s2Out = s2_237;
	s3Out = s3;
	s4Out = dwArg78;
	mstatusOut = mstatus;
	return ra;
}

// 2306C50C: Register Eq_2 dns_gethostbyname(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_389890) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_390164) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      sntp_request
//      httpc_get_file_dns
Eq_2 dns_gethostbyname(Eq_2 ra, Eq_2 a0, struct Eq_389890 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_390164 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	ptr32 a0_14;
	ptr32 a4_16;
	ptr32 s0_18;
	struct Eq_390164 * s2_19;
	ptr32 s4_20;
	ptr32 a3_26;
	ptr32 s3_27;
	ptr32 s1_37;
	ptr32 mstatus_41;
	word32 a5_64;
	Eq_2 ra_42 = dns_gethostbyname_addrtype(ra, a0, a1, a3, s2, s5, s6, s8, mstatus, dwArg08, dwArg1C, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, dwArg0128, dwArg0168, out s0_18, out s1_37, out a0_14, out a3_26, out a4_16, out a5_64, out s2_19, out s3_27, out s4_20, out mstatus_41);
	s0Out = s0_18;
	s1Out = s1_37;
	a0Out = a0_14;
	a3Out = a3_26;
	a4Out = a4_16;
	s2Out = s2_19;
	s3Out = s3_27;
	s4Out = s4_20;
	mstatusOut = mstatus_41;
	return ra_42;
}

