pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306C512: Register Eq_2 lwip_standard_chksum(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register out ptr32 a2Out, Register out Eq_390196 a3Out, Register out Eq_390197 a4Out, Register out Eq_390198 a5Out)
// Called from:
//      ip_chksum_pseudo
//      ip_chksum_pseudo_partial
//      inet_chksum
//      inet_chksum_pbuf
//      lwip_chksum_copy
Eq_2 lwip_standard_chksum(Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 & a2Out, union Eq_390196 & a3Out, union Eq_390197 & a4Out, union Eq_390198 & a5Out)
{
	Eq_2 a0_10;
	word16 wLoc02_106 = 0x00;
	a0_10 = a0;
	if ((a0 & 1) != 0x00)
	{
		a0_10 = a0;
		if (a1 > 0x00)
		{
			a1 = (word32) a1 - 1;
			a0_10 = (word32) a0 + 1;
			wLoc02_106 = SEQ((byte) (word32) *a0, 0x00);
		}
	}
	byte bLoc01_118 = SLICE(wLoc02_106, byte, 8);
	Eq_2 a5_101 = a0_10 & 3;
	if (a5_101 != 0x00)
	{
		a4.u0 = 0x01;
		a5_101.u0 = 0x00;
		if (a1 > 0x01)
		{
			a5_101 = (word32) *a0_10;
			a1 = (word32) a1 - 2;
			a0_10 = (word32) a0_10 + 2;
		}
	}
	ptr32 a2_124 = 0x07;
	while (a1 > 0x07)
	{
		struct Eq_390240 * a0_26 = *a4.u0;
		a4 += a5_101;
		if (a4 < a5_101)
			a4 = (byte) a4.u0 + 1;
		a0_10 = &a0_26->dw0004 + 1;
		a5_101 = (byte) a4.u0 + a0_26->dw0004;
		if (a5_101 < a4)
			a5_101 = (word32) a5_101 + 1;
		a1 = (word32) a1 - 8;
	}
	word32 a5_43 = (word32) (word16) a5_101 + (a5_101 >> 0x10);
	while (a1 > 0x01)
	{
		a0_10 = (word32) a0_10 + 2;
		a2_124 = (word32) *((word32) a0_10 - 2);
		a1 = (word32) a1 - 2;
		a5_43 += a2_124;
	}
	if (a1 == 0x01)
		wLoc02_106 = SEQ(bLoc01_118, (byte) (word32) *a0_10);
	uint32 a0_68 = (word32) wLoc02_106 + a5_43;
	uint32 a5_71 = (a0_68 >> 0x10) + (a0_68 & 0x0FFFFFFF);
	Eq_390197 a4_126 = 0x0FFFFFFF;
	Eq_390198 a5_127 = a5_71 & 0x0FFFFFFF;
	uint32 a0_74 = (a5_71 >> 0x10) + (a5_71 & 0x0FFFFFFF);
	if ((a0 & 1) != 0x00)
	{
		a4_126 = a0_74 << 0x08 & 0x0FFFFFFF;
		a5_127 = a0_74 << 0x08;
		a0_74 = a0_74 >> 8 & 0x00FF | a4_126;
	}
	a2Out = a2_124;
	a3Out = a0 & 1;
	a4Out = a4_126;
	a5Out = a5_127;
	return (word32) (word16) a0_74;
}

// 2306C5C0: Register word32 inet_chksum_pseudo(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_390330 a3Out, Register out Eq_2 a4Out, Register out ptr32 a6Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_390336 s5Out)
// Called from:
//      ip_chksum_pseudo
word32 inet_chksum_pseudo(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_390330 & a3Out, union Eq_2 & a4Out, ptr32 & a6Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_390336 & s5Out)
{
	uint32 a4_19 = *a4;
	uint32 a3_21 = *a3;
	uint32 a3_30 = (a3_21 >> 16) + (((a4_19 & 0x0FFFFFFF) + (a4_19 >> 16)) + (a3_21 & 0x0FFFFFFF));
	uint32 a3_33 = (a3_30 & 0x0FFFFFFF) + (a3_30 >> 0x10);
	Eq_2 a4_163 = a3_21 & 0x0FFFFFFF;
	Eq_390330 a3_161 = a3_33 & 0x0FFFFFFF;
	Eq_2 s3_37 = a0;
	uint32 s0_121 = (a3_33 >> 0x10) + (a3_33 & 0x0FFFFFFF);
	Eq_390336 s5_123 = 0x00;
	while (s3_37 != 0x00)
	{
		word32 a2_178;
		word32 a5_179;
		uint32 s0_57 = (word32) lwip_standard_chksum(*((word32) s3_37 + 4), (word32) *((word32) s3_37 + 0x0A), a4_163, out a2_178, out a3_161, out a4_163, out a5_179) + s0_121;
		s0_121 = (s0_57 & 0x0FFFFFFF) + (s0_57 >> 0x10);
		if (((word32) *((word32) s3_37 + 0x0A) & 0x01) != 0x00)
		{
			s5_123 = s5_123 ^ 1;
			s0_121 = s0_121 >> 8 & 0x00FF | s0_121 << 0x08 & 0x0FFFFFFF;
		}
		s3_37 = *s3_37;
	}
	if (s5_123 != 0x00)
	{
		a4_163.u0 = 0x0FFFFFFF;
		s0_121 = s0_121 >> 8 & 0x00FF | s0_121 << 0x08 & 0x0FFFFFFF;
	}
	word32 a5_176;
	Eq_2 a0_85 = lwip_htons(a1, out a5_176);
	word32 a5_177;
	word32 s0_97 = s0_121 + (lwip_htons(a2, out a5_177) + a0_85);
	s1Out = a0_85;
	uint32 s0_101 = (s0_97 & 0x0FFFFFFF) + (s0_97 >> 0x10);
	a0Out = (word32) (word16) ~((s0_101 & 0x0FFFFFFF) + (s0_101 >> 0x10));
	a2Out = dwArg48;
	a3Out = a3_161;
	a4Out = a4_163;
	a6Out = dwArg28;
	s2Out = a2;
	s3Out = s3_37;
	s4Out = dwArg04;
	s5Out = s5_123;
	return s1;
}

// 2306C694: Register word32 ip_chksum_pseudo(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register out (ptr32 Eq_390471) s1Out, Register out Eq_390472 a0Out, Register out Eq_390473 a2Out, Register out Eq_390474 a3Out, Register out (ptr32 Eq_2) a4Out, Register out ptr32 a6Out, Register out (ptr32 Eq_390477) s2Out, Register out (ptr32 Eq_390478) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      tcp_input
//      tcp_output_control_segment
//      udp_input
//      udp_sendto
word32 ip_chksum_pseudo(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_390471 & s1Out, union Eq_390472 & a0Out, union Eq_390473 & a2Out, union Eq_390474 & a3Out, union Eq_2 & a4Out, ptr32 & a6Out, struct Eq_390477 & s2Out, struct Eq_390478 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_390472 a0_8;
	Eq_390473 a2_10;
	Eq_390474 a3_11;
	union Eq_2 * a4_12;
	ptr32 a6_14;
	struct Eq_390471 * s1_16;
	struct Eq_390477 * s2_17;
	struct Eq_390478 * s3_18;
	ptr32 s4_19;
	ptr32 s5_20;
	word32 s0_15 = inet_chksum_pseudo(a0, a1, a2, a3, a4, out s1_16, out a0_8, out a2_10, out a3_11, out a4_12, out a6_14, out s2_17, out s3_18, out s4_19, out s5_20);
	s1Out = s1_16;
	a0Out = a0_8;
	a2Out = a2_10;
	a3Out = a3_11;
	a4Out = a4_12;
	a6Out = a6_14;
	s2Out = s2_17;
	s3Out = s3_18;
	s4Out = s4_19;
	s5Out = s5_20;
	return s0_15;
}

// 2306C698: Register word32 inet_chksum_pseudo_partial(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register uint32 a3, Register Eq_2 a4, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_390518 s6Out)
// Called from:
//      ip_chksum_pseudo_partial
word32 inet_chksum_pseudo_partial(Eq_2 a0, Eq_2 a1, Eq_2 a2, uint32 a3, Eq_2 a4, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_390518 & s6Out)
{
	uint32 a4_24 = *a4;
	uint32 a4_33 = (a4_24 >> 16) + (((a2 & 0x0FFFFFFF) + (a2 >> 16)) + (a4_24 & 0x0FFFFFFF));
	uint32 a4_36 = (a4_33 & 0x0FFFFFFF) + (a4_33 >> 0x10);
	Eq_2 a4_100 = a4_36 & 0x0FFFFFFF;
	Eq_2 s4_40 = a0;
	uint32 s0_104 = (a4_36 >> 0x10) + (a4_36 & 0x0FFFFFFF);
	Eq_390518 s6_154 = 0x00;
	while (s4_40 != 0x00 && a3 != 0x00)
	{
		uint32 a5_49 = (word32) *((word32) s4_40 + 0x0A);
		uint32 s3_50 = a5_49;
		if (a3 < a5_49)
			s3_50 = a3;
		uint32 s3_53 = s3_50 << 16;
		word32 a3_68;
		word32 a5_238;
		word32 a2_237;
		uint32 s0_73 = (word32) lwip_standard_chksum(*((word32) s4_40 + 4), s3_53 >> 0x10, a4_100, out a2_237, out a3_68, out a4_100, out a5_238) + s0_104;
		s3 = a3_68 - (s3_53 >> 0x10);
		s0_104 = (s0_73 & 0x0FFFFFFF) + (s0_73 >> 0x10);
		a3 = (word32) (word16) s3;
		if (((word32) *((word32) s4_40 + 0x0A) & 0x01) != 0x00)
		{
			s6_154 = s6_154 ^ 1;
			s0_104 = s0_104 >> 8 & 0x00FF | s0_104 << 0x08 & 0x0FFFFFFF;
		}
		s4_40 = *s4_40;
	}
	if (s6_154 != 0x00)
	{
		a4_100.u0 = 0x0FFFFFFF;
		s0_104 = s0_104 >> 8 & 0x00FF | s0_104 << 0x08 & 0x0FFFFFFF;
	}
	word32 a5_235;
	Eq_2 a0_111 = lwip_htons(a1, out a5_235);
	word32 a5_236;
	word32 s0_125 = s0_104 + (lwip_htons(a2, out a5_236) + a0_111);
	0x00 = (int8) dwArg0128;
	s1Out = a0_111;
	uint32 s0_129 = (s0_125 & 0x0FFFFFFF) + (s0_125 >> 0x10);
	a0Out = (word32) (word16) ~((s0_129 & 0x0FFFFFFF) + (s0_129 >> 0x10));
	a4Out = a4_100;
	s3Out = s3;
	s4Out = dwArg78;
	s5Out = a1;
	s6Out = s6_154;
	return dwArgE4;
}

// 2306C792: Register word32 ip_chksum_pseudo_partial(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register uint32 a3, Register Eq_2 a4, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_390662) s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out (ptr32 Eq_421656) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_390668) s6Out)
// Called from:
//      tcp_output
//      udp_sendto
word32 ip_chksum_pseudo_partial(Eq_2 a0, Eq_2 a1, Eq_2 a2, uint32 a3, Eq_2 a4, Eq_2 dwArg0128, struct Eq_390662 & s1Out, ptr32 & a0Out, ptr32 & a4Out, union Eq_421656 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_390668 & s6Out)
{
	ptr32 a0_9;
	ptr32 a4_13;
	struct Eq_390662 * s1_17;
	union Eq_421656 * s3_19;
	ptr32 s4_20;
	ptr32 s5_21;
	struct Eq_390668 * s6_22;
	word32 s0_16 = inet_chksum_pseudo_partial(a0, a1, a2, a3, a4, dwArg0128, out s1_17, out a0_9, out a4_13, out s3_19, out s4_20, out s5_21, out s6_22);
	s1Out = s1_17;
	a0Out = a0_9;
	a4Out = a4_13;
	s3Out = s3_19;
	s4Out = s4_20;
	s5Out = s5_21;
	s6Out = s6_22;
	return s0_16;
}

