pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306C796: Register Eq_2 inet_chksum(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      igmp_send
//      igmp_input
//      ip4_input
//      tcp_split_unsent_seg
//      icmp_input
//      icmp_dest_unreach
Eq_2 inet_chksum(Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_12;
	ptr32 a4_13;
	ptr32 a5_14;
	word32 a2_26;
	Eq_2 a0_18 = (word32) (word16) ~lwip_standard_chksum(a0, a1, a4, out a2_26, out a3_12, out a4_13, out a5_14);
	a2Out = dwArg10;
	a3Out = a3_12;
	a4Out = a4_13;
	a5Out = a5_14;
	return a0_18;
}

// 2306C7AC: Register uint32 inet_chksum_pbuf(Register Eq_2 a0, Register Eq_2 a4, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      icmp_input
uint32 inet_chksum_pbuf(Eq_2 a0, Eq_2 a4, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s4Out)
{
	Eq_2 s1_16 = a0;
	ui32 s3_17 = 0x00;
	uint32 s0_18 = 0x00;
	while (s1_16 != 0x00)
	{
		struct Eq_390723 * s1_24 = *((word32) a0 + 4);
		word32 a2_124;
		word32 a5_125;
		a0 = lwip_standard_chksum(a0, (word32) *((word32) s1_16 + 0x0A), a4, out a2_124, out a3, out a4, out a5_125);
		uint32 s0_33 = (word32) a0 + s0_18;
		s0_18 = (s0_33 & 0x0FFFFFFF) + (s0_33 >> 0x10);
		if (((word32) s1_24->w000A & 0x01) != 0x00)
		{
			s3_17 = s3_17 ^ 1;
			s0_18 = s0_18 >> 8 & 0x00FF | s0_18 << 0x08 & 0x0FFFFFFF;
		}
		s1_16 = s1_24->t0000;
	}
	if (s3_17 != 0x00)
	{
		a4.u0 = 0x0FFFFFFF;
		s0_18 = s0_18 >> 8 & 0x00FF | s0_18 << 0x08 & 0x0FFFFFFF;
	}
	s1Out = s1_16;
	a0Out = (word32) (word16) ~s0_18;
	a3Out = a3;
	a4Out = a4;
	s2Out = 0x0FFFFFFF;
	s4Out = dwArg04;
	return s0_18;
}

// 2306C826: Register Eq_2 lwip_chksum_copy(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out)
// Called from:
//      lwip_sendto
//      altcp_tcp_write
Eq_2 lwip_chksum_copy(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a4Out)
{
	Eq_2 a4_15;
	word32 a1_48;
	word32 a2_49;
	word32 a3_50;
	word32 a5_51;
	word32 a6_52;
	word32 a7_53;
	memcpy(a0, a1, a2, out a1_48, out a2_49, out a3_50, out a4_15, out a5_51, out a6_52, out a7_53);
	ptr32 a2_36;
	ptr32 a4_38;
	word32 a3_54;
	word32 a5_55;
	a0Out = lwip_standard_chksum(a0, a2, a4_15, out a2_36, out a3_54, out a4_38, out a5_55);
	a2Out = a2_36;
	a4Out = a4_38;
	return a2;
}

// 2306C846: Register Eq_2 lwip_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      tcpip_init
Eq_2 lwip_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	stats_init();
	sys_init();
	mem_init(ra, mstatus, dwLoc10, dwLoc0C, ra, dwArgE8, dwArg0128, dwArg0168);
	struct Eq_64398 * a2_31;
	Eq_2 a0_30 = memp_init(out a2_31);
	netif_init();
	struct Eq_64398 * a2_45;
	word32 * a0_54;
	Eq_2 a3_57;
	Eq_2 s1_62;
	Eq_2 ra_61 = tcp_init(ra, udp_init(a0_30, a2_31, out a2_45), a2_45, dwLoc08, dwArg18, dwArg60, dwArg88, dwArgAC, out s1_62, out a0_54, out a3_57);
	word32 * a5_78;
	Eq_2 a4_77 = igmp_init(out a5_78);
	dns_init(ra_61, s1_62, a3_57, a4_77, a5_78, mstatus);
	ptr32 a1_83;
	ptr32 a3_85;
	ptr32 a4_86;
	a0Out = sys_timeouts_init(a0_54, a3_57, a4_77, mstatus, dwArg34, dwArg38, out a1_83, out a3_85, out a4_86);
	a1Out = a1_83;
	a3Out = a3_85;
	a4Out = a4_86;
	return ra_61;
}

// 2306C876: Register word32 dhcp_set_state(Register Eq_2 a0, Register word32 a1)
// Called from:
//      dhcp_check
//      dhcp_bind
//      dhcp_select
//      dhcp_recv
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_renew
//      dhcp_start
//      dhcp_coarse_tmr
//      dhcp_stop
word32 dhcp_set_state(Eq_2 a0, word32 a1)
{
	word32 a5_5 = (word32) *((word32) a0 + 5);
	if (a5_5 != a1)
	{
		*((word32) a0 + 5) = (byte) a1;
		*((word32) a0 + 6) = 0x00;
		*((word32) a0 + 8) = 0x00;
	}
	return a5_5;
}

// 2306C88C: Register int32 dhcp_option_short(Register int32 a0, Register (ptr32 byte) a1, Register Eq_390925 a2)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_renew
//      dhcp_coarse_tmr
int32 dhcp_option_short(int32 a0, byte * a1, Eq_390925 a2)
{
	a1[a0] = (byte) (a2 >> 0x08);
	a1[(word32) (word16) (a0 + 1)] = (byte) a2;
	return (word32) (word16) (a0 + 0x02);
}

// 2306C8AE: Register Eq_390942 dhcp_option_long(Register Eq_390942 a0, Register Eq_390943 a1, Register Eq_2 a2)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_stop
Eq_390942 dhcp_option_long(Eq_390942 a0, Eq_390943 a1, Eq_2 a2)
{
	Mem8[a1 + a0:byte] = SLICE(a2 >>u 0x18, byte, 0);
	*((word32) a1.u1 + (word32) ((word16) ((word32) a0.u0 + 1))) = (byte) (a2 >> 0x10);
	*((word32) a1.u1 + (word32) ((word16) ((word32) a0.u0 + 2))) = (byte) (a2 >> 0x08);
	*((word32) a1.u1 + (word32) ((word16) ((word32) a0.u0 + 3))) = (byte) a2;
	return (word32) (word16) ((word32) a0.u0 + 4);
}

// 2306C8F4: Register Eq_2 dhcp_create_msg(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_391004) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_renew
//      dhcp_coarse_tmr
//      dhcp_stop
Eq_2 dhcp_create_msg(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, struct Eq_391004 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 s1_108;
	Eq_2 s5_184;
	s1_108 = s1;
	if (a0 == 0x00)
	{
l2306C908:
		s5_184.u0 = 0x00;
		goto l2306C90A;
	}
	s1_108 = s1;
	if (a1 == 0x00)
		goto l2306C908;
	Eq_2 a0_33;
	struct Eq_64398 * a2_34;
	word32 s0_394;
	word32 a1_395;
	word32 s5_397;
	word32 s8_398;
	word32 a7_396;
	word16 * s4_179;
	ra = pbuf_alloc(ra, s0, a0, 0x00B6, 308, 640, a3, a4, mstatus, s4, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_394, out s1_108, out a0_33, out a1_395, out a2_34, out a3, out a4, out a5, out a7_396, out s2, out s3, out s4_179, out s5_397, out s6, out s8_398, out mstatus);
	s5_184 = a0_33;
	if (a0_33 == 0x00)
		goto l2306C908;
	if (s2 != 0x03 || (word32) s3->b0005 == s2)
	{
		Eq_2 a5_63 = (word32) s3->b0006;
		if (a5_63 == 0x00)
		{
			word32 a3_411;
			word32 a2_410;
			word32 * a0_68;
			word32 a1_409;
			word32 s8_413;
			word32 a4_412;
			s1_108 = bl_rand(a0_33, a2_34, out a0_68, out a1_409, out a2_410, out a3_411, out a4_412, out a5_63, out s4_179, out s8_413);
			*a0_68 = 0x4200F5F4;
		}
		s3->t0000 = a5_63;
	}
	Eq_2 s0_89 = *((word32) a0_33 + 4);
	word32 a3_403;
	word32 a4_404;
	word32 a5_405;
	word32 a2_402;
	word32 a1_401;
	word32 a0_400;
	word32 t1_399;
	ra = memset(ra, s0_89, 0x00, 308, out t1_399, out a0_400, out a1_401, out a2_402, out a3_403, out a4_404, out a5_405);
	*s0_89 = 0x01;
	*((word32) s0_89 + 1) = 0x01;
	*((word32) s0_89 + 2) = (byte) (word32) *((word32) s1_108 + 64);
	word32 a5_408;
	word32 a3_406;
	word32 a4_407;
	Eq_2 a0_115 = lwip_htonl(s3->t0000, out a3_406, out a4_407, out a5_408);
	*((word32) s0_89 + 4) = (byte) a0_115;
	*((word32) s0_89 + 5) = (byte) (a0_115 >> 0x08);
	*((word32) s0_89 + 6) = (byte) (a0_115 >> 0x10);
	*((word32) s0_89 + 7) = (byte) (a0_115 >> 24);
	s6 = 0x01;
	struct Eq_391139 * a5_126 = (struct Eq_391139 *) 0x04;
	if (s2 == 0x04)
	{
l2306C9D0:
		s1_108 = a5_126->t0004;
		*((word32) s0_89 + 0x0C) = (byte) a5_126;
		*((word32) s0_89 + 0x0D) = (byte) (a5_126 >> 0x08);
		*((word32) s0_89 + 0x0E) = (byte) (a5_126 >> 0x10);
		*((word32) s0_89 + 0x0F) = (byte) (a5_126 >> 24);
		goto l2306C9EC;
	}
	else
	{
		a5_126 = s2 + -7 & 0x00FF;
		if (a5_126 <= (struct Eq_391139 *) 0x01)
			goto l2306C9D0;
		if (s2 == 0x03)
		{
			a5_126 = (word32) s3->b0005 + ~0x03 & 0x00FF;
			if (a5_126 <= (struct Eq_391139 *) 0x01)
				goto l2306C9D0;
		}
l2306C9EC:
		Eq_2 a5_148 = (word32) s1_108 + 58;
		struct Eq_391202 * a4_150 = (word32) s0_89 + 28;
		s1_108 = (word32) s1_108 + 64;
		do
		{
			a3 = (word32) *a5_148;
			++a4_150;
			a4_150[0x0FFF] = (struct Eq_391202) (byte) a3;
			a5_148 = (word32) a5_148 + 1;
		} while (a5_148 != s1_108);
		((word32) s0_89 + 0x00EC)->u0 = 99;
		*((word32) s0_89 + 0x00EF) = 99;
		*((word32) s0_89 + 0x00ED) = 0x82;
		*((word32) s0_89 + 0x00F0) = 0x35;
		*((word32) s0_89 + 0x00F1) = 0x01;
		*((word32) s0_89 + 0x00EE) = 0x53;
		*((word32) s0_89 + 242) = (byte) s2;
		*s4_179 = 0x03;
		a4.u0 = 83;
		a5 = 0x03;
l2306C90A:
		0x00 = (int8) dwArgA8;
		s0Out = s1;
		s1Out = s1_108;
		a0Out = s5_184;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5_184;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
}

