pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306CA3E: Register Eq_2 dhcp_option_trailer(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_renew
//      dhcp_coarse_tmr
//      dhcp_stop
Eq_2 dhcp_option_trailer(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Mem10[a1 + a0:byte] = ~0x00;
	uint32 a5_5 = (word32) a0 + 1 << 16;
	Eq_391298 a5_14 = a5_5 >> 16;
	word32 a1_11 = a1 + (a5_5 >>u 16);
	while (a5_14 <= 67)
	{
		*a1_11 = 0x00;
		a5_14 = (word32) (word16) ((word32) a5_14.u1 + 1);
		++a1_11;
	}
	Eq_2 a1_23 = (word32) (word16) ((word32) a5_14 + 0x00F0);
	word32 a2_89;
	ptr32 s1_46;
	ptr32 mstatus_52;
	ptr32 s2_54;
	ptr32 s3_55;
	ptr32 s4_56;
	ptr32 s6_58;
	ptr32 s8_59;
	word32 a3_90;
	word32 a4_91;
	word32 a5_92;
	word32 s5_93;
	Eq_2 ra_53 = pbuf_realloc(ra, s0, a2, a1_23, ~0x00, 67, s2, s3, s4, mstatus, dwArg14, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0168, out s1_46, out a2_89, out a3_90, out a4_91, out a5_92, out s2_54, out s3_55, out s4_56, out s5_93, out s6_58, out s8_59, out mstatus_52);
	s1Out = s1_46;
	s2Out = s2_54;
	s3Out = s3_55;
	s4Out = s4_56;
	s6Out = s6_58;
	s8Out = s8_59;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 2306CA76: Register Eq_2 dhcp_discover(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_2) s0Out, Register out (ptr32 Eq_391371) s1Out, Register out ptr32 a0Out, Register out Eq_391373 a3Out, Register out (ptr32 Eq_391374) a4Out, Register out Eq_391375 a5Out, Register out (ptr32 Eq_391376) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_recv
//      dhcp_network_changed
//      dhcp_start
//      dhcp_fine_tmr
Eq_2 dhcp_discover(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, struct Eq_391371 & s1Out, ptr32 & a0Out, union Eq_391373 & a3Out, struct Eq_391374 & a4Out, union Eq_391375 & a5Out, struct Eq_391376 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a0_14 = *((word32) s1 + 40);
	*((word32) s1 + 28) = 0x00;
	dhcp_set_state(s1, 0x06);
	struct Eq_391394 * s0_36;
	word32 a0_51;
	word32 a4_325;
	word32 a5_326;
	struct Eq_391371 * s1_156;
	Eq_2 s4_161;
	Eq_2 s3_158;
	struct Eq_391376 * s2_157;
	ptr32 mstatus_170;
	Eq_391373 a3_153;
	ptr32 s5_162;
	ptr32 s6_163;
	Eq_2 ra_171 = dhcp_create_msg(ra, s0, a0_14, s1, fp + -0x0022, a4, s4, mstatus, dwLoc0C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_36, out s1_156, out a0_51, out a3_153, out a4_325, out a5_326, out s2_157, out s3_158, out s4_161, out s5_162, out s6_163, out mstatus_170);
	if (a0_51 != 0x00)
	{
		int32 a5_53 = (word32) wLoc22;
		Eq_2 a0_52 = s0_36->t0004;
		((char *) &s0_36->t0004 + 0x00EC)[a5_53] = 0x39;
		((char *) &s0_36->t0004 + 0x00EC)[(word32) (word16) (a5_53 + 0x01)] = 0x02;
		Eq_2 a0_71 = dhcp_option_short((word32) (word16) (a5_53 + 2), (char *) &s0_36->t0004 + 0x00EC, (word32) *((word32) s3_158 + 56));
		Mem77[s0_36 + 0x00F0 + a0_71:byte] = 55;
		((char *) &s0_36->t0004 + 0x00EC)[(word32) (word16) ((word32) a0_71 + 1)] = 0x04;
		uint16 wLoc22_222 = (word16) ((word32) a0_71 + 2);
		byte * a5_104 = g_a230CBAD8;
		do
		{
			int32 a4_92 = (word32) wLoc22_222;
			((char *) &s0_36->t0004 + 0x00EC)[a4_92] = (byte) (word32) *a5_104;
			uint32 a0_98 = a4_92 + 1 << 16;
			wLoc22_222 = (word16) (a0_98 >> 16);
			++a5_104;
		} while (a5_104 != (byte *) 3706930476);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		ptr32 mstatus_121;
		Eq_2 s2_124;
		Eq_2 s3_125;
		Eq_2 s4_126;
		word32 s1_327;
		word32 s8_329;
		word32 s6_328;
		Eq_2 ra_122 = dhcp_option_trailer(ra_171, (char *) &s0_36->t0004 + 0x00EC, a0_98 >> 16, (char *) &s0_36->t0004 + 0x00EC, a0_52, a0_52, s3_158, s4_161, mstatus_170, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_327, out s2_124, out s3_125, out s4_126, out s6_328, out s8_329, out mstatus_121);
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg296 = <invalid>;
		word32 a3_345;
		word32 a4_346;
		word32 s2_347;
		word32 s3_348;
		word32 s4_349;
		word32 mstatus_350;
		udp_sendto_if_src(ra, a0, a1, a2, a3, a4, a5, s8, mstatus, stackArg20, stackArg120, stackArg136, stackArg168, stackArg184, stackArg200, stackArg232, stackArg248, stackArg296, out a3_345, out a4_346, out s2_347, out s3_348, out s4_349, out mstatus_350);
		word32 s0_351;
		word32 a0_352;
		word32 a1_353;
		word32 a2_354;
		word32 a4_355;
		word32 a5_356;
		word32 a7_357;
		word32 s8_358;
		ra_171 = pbuf_free(ra_122, s2_124, 67, s3_125, s4_126, mstatus_121, dwArgF8, out s0_351, out s1_156, out a0_352, out a1_353, out a2_354, out a3_153, out a4_355, out a5_356, out a7_357, out s2_157, out s3_158, out s4_161, out s5_162, out s6_163, out s8_358, out mstatus_170);
	}
	int32 a5_174 = (word32) s1_156->b0006;
	if (a5_174 != 0x00FF)
		s1_156->b0006 = (byte) (a5_174 + 0x01);
	word32 a5_183;
	up32 a4_180 = (word32) s1_156->b0006;
	if (a4_180 <= 0x05)
		a5_183 = (word32) (word16) ((0x01 << a4_180) + 1000);
	else
		a5_183 = 0x0EFFFA60;
	word32 a5_191 = a5_183 + 499;
	s1_156->w0008 = (word16) (a5_191 ^ 500);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_156;
	a0Out = 0x00;
	a3Out = a3_153;
	a4Out = (struct Eq_391374 *) 500;
	a5Out = a5_191 ^ 500;
	s2Out = s2_157;
	s3Out = s3_158;
	s4Out = s4_161;
	s5Out = s5_162;
	s6Out = s6_163;
	mstatusOut = mstatus_170;
	return ra_171;
}

// 2306CBB8: Register Eq_2 dhcp_check(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF0, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out Eq_391672 a3Out, Register out (ptr32 Eq_391673) a4Out, Register out (ptr32 Eq_391674) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_recv
//      dhcp_fine_tmr
Eq_2 dhcp_check(Eq_2 ra, Eq_2 s0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF0, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0168, ptr32 & s1Out, union Eq_391672 & a3Out, struct Eq_391673 & a4Out, struct Eq_391674 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 a0_10 = *((word32) s0 + 40);
	dhcp_set_state(s0, 0x08);
	Eq_391672 a3_23;
	struct Eq_391689 * s0_27;
	struct Eq_391674 * s2_28;
	ptr32 s4_29;
	ptr32 mstatus_33;
	ptr32 s1_35;
	ptr32 s3_36;
	ptr32 s5_37;
	ptr32 s6_38;
	ptr32 s7_39;
	Eq_2 ra_34 = etharp_query(ra, a0_10, (word32) s0 + 28, s4, mstatus, dwArg04, dwArg28, dwArg38, dwArg48, dwArg64, dwArg68, ra, dwArg78, dwArg88, dwArg90, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF0, dwArgF4, dwArgF8, dwArg0118, dwArg0168, out s0_27, out s1_35, out a3_23, out s2_28, out s3_36, out s4_29, out s5_37, out s6_38, out s7_39, out mstatus_33);
	int32 a5_48 = (word32) s0_27->b0006;
	if (a5_48 != 0x00FF)
		s0_27->b0006 = (byte) (a5_48 + 0x01);
	s0_27->w0008 = 0x01;
	s1Out = s1_35;
	a3Out = a3_23;
	a4Out = (struct Eq_391673 *) 0x00FF;
	s2Out = s2_28;
	s3Out = s3_36;
	s4Out = s4_29;
	s5Out = s5_37;
	s6Out = s6_38;
	s7Out = s7_39;
	mstatusOut = mstatus_33;
	return ra_34;
}

