pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306CBFA: Register Eq_2 dhcp_bind(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_391794 a3Out, Register out (ptr32 Eq_391795) a4Out, Register out (ptr32 Eq_391796) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_recv
//      dhcp_fine_tmr
Eq_2 dhcp_bind(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_391794 & a3Out, struct Eq_391795 & a4Out, struct Eq_391796 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 a0_11 = *((word32) s0 + 40);
	if (s0 == 0x00)
	{
l2306CCD8:
		s0Out = s0;
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 s0_13 = *((word32) a5 + 40);
	*((word32) s0_13 + 18) = 0x00;
	if (a5 != ~0x00)
	{
		word32 a4_19;
		a5 += 0x1E;
		if (a5 < 0xFFC4001E)
		{
			a5 = a5 + 0x1E >>u 60;
			a4_19 = (word32) (word16) a5;
			if (a5 == 0x00)
			{
				*((word32) s0_13 + 20) = 0x01;
				a5.u0 = 0x01;
				goto l2306CC34;
			}
		}
		else
			a4_19 = 0x0FFFFFFF;
		*((word32) s0_13 + 20) = (word16) a4_19;
	}
l2306CC34:
	Eq_2 s0_32 = *((word32) a5 + 44);
	if (a5 == ~0x00)
	{
l2306CC62:
		Eq_2 s0_53 = *((byte) a5.u0 + 48);
		if (a5 == ~0x00)
		{
l2306CC90:
			Eq_2 a5_74 = (word32) *((word32) s0_53 + 0x0C);
			Eq_2 a4_107 = (word32) *((word32) s0_53 + 0x0A);
			if (a4_107 >= a5_74 && a5_74 != 0x00)
				((word32) s0_53 + 0x0A)->u0 = 0x00;
			Eq_2 a5_79 = (word32) *((word32) s0_53 + 7);
			if (a5_79 == 0x00)
			{
				Eq_391945 a5_80 = (word32) *((word32) s0_53 + 28);
				a4_107 = (int32) (byte) a5_80;
				if (a4_107 >= 0x00)
					a5_79.u0 = 0x00FF;
				else
				{
					word32 a5_84;
					a4_107.u0 = 191;
					if (a5_80 > 191)
						a5_84 = 0x01000000;
					else
						a5_84 = 0x10000000;
					a5_79 = a5_84 + ~0x00;
				}
			}
			Eq_2 s0_103 = *((byte) a5_79.u0 + 36);
			if (a5_79 == 0x00)
			{
				s0_103 = *((word32) a5_79 + 28);
				a4_107.u0 = 0x01000000;
			}
			word32 a1_580;
			word32 a5_582;
			word32 s4_583;
			word32 a2_581;
			ra = netif_set_addr(ra, a0_11, a0_11, (word32) s0_103 + 28, fp + ~0x17, fp + ~0x13, a4_107, dhcp_set_state(s0_103, 0x0A), s3, s4, s7, mstatus, a5_79, dwLoc18, dwLoc08, dwArg08, dwArg0C, dwArg24, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg54, dwArg58, s1, dwArg78, dwArg98, dwArg0108, dwArg0118, out s0, out s1, out a1_580, out a2_581, out a3, out a4, out a5_582, out s2, out s3, out s4_583, out s5, out s6, out s7, out mstatus);
			goto l2306CCD8;
		}
		word32 a4_58;
		word32 a5_55 = a5 + 0x1E;
		if (a5_55 < (struct Eq_391895 *) 0x003C0000)
		{
			a4_58 = (word32) (word16) (a5_55 >> 60);
			if (a5_55 >> 60 == 0x00)
			{
				((word32) s0_53 + 0x0C)->u2 = 0x01;
				goto l2306CC88;
			}
		}
		else
			a4_58 = 0x0FFFFFFF;
		((word32) s0_53 + 0x0C)->u2 = (word16) a4_58;
l2306CC88:
		*((word32) s0_53 + 16) = (word16) (word32) *((word32) s0_53 + 0x0C);
		goto l2306CC90;
	}
	word32 a4_37;
	word32 a5_34 = a5 + 0x1E;
	if (a5_34 < (struct Eq_391862 *) 0x003C0000)
	{
		a4_37 = (word32) (word16) (a5_34 >> 60);
		if (a5_34 >> 60 == 0x00)
		{
			((word32) s0_32 + 0x0A)->u0 = 0x01;
			goto l2306CC5A;
		}
	}
	else
		a4_37 = 0x0FFFFFFF;
	*((word32) s0_32 + 0x0A) = (word16) a4_37;
l2306CC5A:
	a5 = (word32) *((word32) s0_32 + 0x0A);
	*((word32) s0_32 + 0x0E) = (word16) a5;
	goto l2306CC62;
}

// 2306CD36: Register Eq_2 dhcp_inc_pcb_refcount(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out Eq_392014 a5Out, Register out (ptr32 Eq_392015) s2Out)
// Called from:
//      dhcp_start
Eq_2 dhcp_inc_pcb_refcount(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, ptr32 & a0Out, ptr32 & a4Out, union Eq_392014 & a5Out, struct Eq_392015 & s2Out)
{
	Eq_392014 a5_100;
	ptr32 a4_32;
	if ((word32) g_b4200F5F0 == 0x00)
	{
		word32 s1_23;
		word32 a3_123;
		word32 a4_124;
		ra = udp_new(ra, 0x4200F000, a3, a4, mstatus, out s1_23, out a3_123, out a4_124, out a5_100);
		*a0 = s1_23 + 1516;
		a4_32 = ~0x00;
		if (a0 == 0x00)
		{
l2306CDA6:
			0x00 = (int8) dwArg38;
			a0Out = a4_32;
			a4Out = a4_32;
			a5Out = a5_100;
			s2Out = s2;
			return ra;
		}
		*((word32) a0 + 9) = (byte) ((word32) *((word32) a0 + 9) | 32);
		word32 a3_125;
		word32 a4_126;
		word32 a5_127;
		word32 a3_128;
		word32 a4_129;
		word32 a5_130;
		udp_recv(udp_connect(udp_bind(a0, 588036828, (union Eq_2 *) 0x0044, out a3_125, out a4_126, out a5_127), &g_ptr230CBADC, (struct Eq_392075 *) 67, dwArg28, out a3_128, out a4_129, out a5_130, out s2), &g_t2306D2B2, 0x00);
	}
	word32 a5_66 = (word32) g_b4200F5F0;
	g_b4200F5F0 = (byte) (a5_66 + 0x01);
	a4_32 = 0x00;
	a5_100 = a5_66 + 0x01;
	goto l2306CDA6;
}

// 2306CDB4: Register Eq_2 dhcp_option_hostname.isra.0(Register Eq_2 a0, Register (ptr32 byte) a1, Stack Eq_2 dwArg44, Register out Eq_2 a0Out, Register out ptr32 s8Out)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_renew
//      dhcp_coarse_tmr
Eq_2 dhcp_option_hostname.isra.0(Eq_2 a0, byte * a1, Eq_2 dwArg44, union Eq_2 & a0Out, ptr32 & s8Out)
{
	Eq_2 s0_59 = a0;
	ptr32 a2_10 = *a0;
	if (a0 != 0x00)
	{
		byte a1_18[];
		word32 a2_99;
		word32 a3_100;
		word32 a4_101;
		word32 a5_102;
		Eq_2 a0_14 = strlen(a0, out a1_18, out a2_99, out a3_100, out a4_101, out a5_102);
		if (a0_14 != 0x00)
		{
			Eq_2 a4_22 = 65 - a1;
			Eq_2 a2_24 = dwArg44;
			if (a0_14 < a4_22)
				a4_22 = a0_14;
			Mem30[a1_18 + a1:byte] = 0x0C;
			a1_18[(word32) (word16) (a1 + 1)] = (byte) a4_22;
			uint32 a3_34 = a1 + 2 << 16;
			word32 a0_41 = dwArg44 + a4_22;
			Eq_392148 a5_42 = a3_34 >> 16;
			while (a2_24 != a0_41)
			{
				a2_24 = (word32) a2_24 + 1;
				Mem52[a5_42 + a1_18:byte] = SLICE(CONVERT(Mem46[a2_24 + -1:byte], byte, word32), byte, 0);
				a5_42 = (word32) (word16) ((word32) a5_42 + 1);
			}
			s0_59 = (word32) (word16) ((word32) a4_22 + (a3_34 >> 16));
		}
	}
	a0Out = s0_59;
	s8Out = a2_10;
	return s0_59;
}

// 2306CE30: Register Eq_2 dhcp_reboot(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_2) s0Out, Register out (ptr32 Eq_392191) s1Out, Register out (ptr32 Eq_392192) a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_network_changed
//      dhcp_fine_tmr
Eq_2 dhcp_reboot(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, struct Eq_392191 & s1Out, struct Eq_392192 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a0_18 = *((word32) s1 + 40);
	dhcp_set_state(s1, 0x03);
	uint16 wLoc22_264 = SLICE(s4, uint16, 16);
	word32 a0_53;
	word32 s0_372;
	word32 a4_374;
	word32 a5_375;
	word32 s4_376;
	word32 a3_373;
	struct Eq_392191 * s1_196;
	ptr32 s6_203;
	ptr32 s5_202;
	ptr32 s2_197;
	Eq_2 s3_198;
	ptr32 mstatus_210;
	Eq_2 ra_211 = dhcp_create_msg(ra, s0, a0_18, s1, fp + -0x0022, a4, s4, mstatus, dwLoc0C, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_372, out s1_196, out a0_53, out a3_373, out a4_374, out a5_375, out s2_197, out s3_198, out s4_376, out s5_202, out s6_203, out mstatus_210);
	if (a0_53 != 0x00)
	{
		struct Eq_392241 * a5_56 = (word32) wLoc22_264;
		Eq_2 a0_55 = *(union Eq_2 *) 0x03;
		a5_56->b00EF = 0x39;
		((byte[]) 0xEF)[(word32) (word16) ((char *) a5_56 + 1)] = 0x02;
		Eq_2 a0_74 = dhcp_option_short((word32) (word16) ((char *) a5_56 + 2), (byte *) 0xEF, 576);
		*((word32) a0_74 + 0x00EF) = 0x32;
		Eq_2 a0_85 = (word32) (word16) ((word32) a0_74 + 1) + 0xEF;
		*a0_85 = 0x04;
		word32 s4_89 = a0_74 + 2 << 16;
		word32 a3_377;
		word32 a4_378;
		word32 a5_379;
		Eq_2 a0_99 = dhcp_option_long(s4_89 >> 0x10, 0xEF, lwip_htonl(a0_85, out a3_377, out a4_378, out a5_379));
		*((word32) a0_99 + 0x00EF) = 55;
		((byte[]) 0xEF)[(word32) (word16) ((word32) a0_99 + 1)] = 0x04;
		uint16 wLoc22_267 = (word16) ((word32) a0_99 + 2);
		byte * a5_114 = g_a230CBAD8;
		do
		{
			struct Eq_392320 * a4_119 = (word32) wLoc22_267;
			a4_119->b00EF = (byte) (word32) *a5_114;
			word32 a0_125 = a4_119 + 1 << 16;
			wLoc22_267 = (word16) (a0_125 >> 16);
			++a5_114;
		} while (a5_114 != (byte *) 3706930476);
		Eq_2 a0_144;
		word32 s8_380;
		Eq_2 s0_137 = dhcp_option_hostname.isra.0(a0_125 >> 16, (byte *) 0xEF, dwArg14, out a0_144, out s8_380);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		ptr32 mstatus_162;
		Eq_2 s2_165;
		Eq_2 s3_166;
		Eq_2 s4_167;
		word32 s6_382;
		word32 s8_383;
		word32 s1_381;
		Eq_2 ra_163 = dhcp_option_trailer(ra_211, s0_137, a0_144, s0_137, a0_55, a0_55, s3_198, s4_89 >> 0x10, mstatus_210, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_381, out s2_165, out s3_166, out s4_167, out s6_382, out s8_383, out mstatus_162);
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg296 = <invalid>;
		word32 a3_398;
		word32 a4_399;
		word32 s2_400;
		word32 s3_401;
		word32 s4_402;
		word32 s7_403;
		word32 s8_404;
		word32 mstatus_405;
		udp_sendto_if(ra, a0, a1, a2, a3, a4, s8, mstatus, stackArg20, stackArg120, stackArg136, stackArg168, stackArg184, stackArg200, stackArg232, stackArg248, stackArg296, out a3_398, out a4_399, out s2_400, out s3_401, out s4_402, out s7_403, out s8_404, out mstatus_405);
		word32 s0_406;
		word32 a0_407;
		word32 a1_408;
		word32 a2_409;
		word32 a3_410;
		word32 a4_411;
		word32 a5_412;
		word32 a7_413;
		word32 s4_414;
		word32 s8_415;
		ra_211 = pbuf_free(ra_163, s2_165, 67, s3_166, s4_167, mstatus_162, dwArgF8, out s0_406, out s1_196, out a0_407, out a1_408, out a2_409, out a3_410, out a4_411, out a5_412, out a7_413, out s2_197, out s3_198, out s4_414, out s5_202, out s6_203, out s8_415, out mstatus_210);
	}
	int32 a5_214 = (word32) s1_196->b0006;
	if (a5_214 != 0x00FF)
		s1_196->b0006 = (byte) (a5_214 + 0x01);
	word32 a5_223;
	up32 a5_220 = (word32) s1_196->b0006;
	if (a5_220 <= 0x09)
		a5_223 = (word32) (word16) (a5_220 + 1000);
	else
		a5_223 = 0x02000710;
	s1_196->w0008 = (word16) (a5_223 + 499 ^ 500);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_196;
	a4Out = (struct Eq_392192 *) 500;
	s2Out = s2_197;
	s3Out = s3_198;
	s4Out = dwArg78;
	s5Out = s5_202;
	s6Out = s6_203;
	mstatusOut = mstatus_210;
	return ra_211;
}

