pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306CFB2: Register Eq_2 dhcp_select(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_2) s0Out, Register out Eq_2 s1Out, Register out Eq_392519 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_recv
//      dhcp_fine_tmr
Eq_2 dhcp_select(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_392519 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	uint16 wLoc22_325 = SLICE(s4, uint16, 16);
	if (a0 != 0x00)
	{
		Eq_2 a0_20 = *((word32) s1 + 40);
		if (s1 != 0x00)
		{
			dhcp_set_state(s1, 0x01);
			Eq_2 a0_56;
			word32 s4_489;
			word32 a5_487;
			word32 s3_488;
			word32 s0_485;
			word32 a4_486;
			ra = dhcp_create_msg(ra, ~0x05, a0_20, s1, fp + -0x0022, a4, s4, mstatus, dwLoc0C, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_485, out s1, out a0_56, out a3, out a4_486, out a5_487, out s2, out s3_488, out s4_489, out s5, out s6, out mstatus);
			s3 = a0_56;
			if (a0_56 != 0x00)
			{
				struct Eq_392580 * a5_60 = (word32) wLoc22_325;
				a5_60->b00EF = 0x39;
				((byte[]) 0xEF)[(word32) (word16) ((char *) a5_60 + 1)] = 0x02;
				Eq_2 a0_77 = dhcp_option_short((word32) (word16) ((char *) a5_60 + 2), (byte *) 0xEF, (word32) *((word32) s2 + 56));
				*((word32) a0_77 + 0x00EF) = 0x32;
				((byte[]) 0xEF)[(word32) (word16) ((word32) a0_77 + 1)] = 0x04;
				word32 a5_492;
				word32 a4_491;
				word32 a3_490;
				Eq_2 a0_102 = dhcp_option_long((word32) (word16) ((word32) a0_77 + 2), 0xEF, lwip_htonl(a0_77, out a3_490, out a4_491, out a5_492));
				*((word32) a0_102 + 0x00EF) = 0x36;
				((byte[]) 0xEF)[(word32) (word16) ((word32) a0_102 + 1)] = 0x04;
				word32 s4_116 = a0_102 + 2 << 16;
				word32 a4_494;
				word32 a3_493;
				word32 a5_495;
				Eq_2 a0_126 = dhcp_option_long(s4_116 >> 0x10, 0xEF, lwip_htonl(a0_102, out a3_493, out a4_494, out a5_495));
				*((word32) a0_126 + 0x00EF) = 55;
				((byte[]) 0xEF)[(word32) (word16) ((word32) a0_126 + 1)] = 0x04;
				uint16 wLoc22_329 = (word16) ((word32) a0_126 + 2);
				byte * a5_141 = g_a230CBAD8;
				do
				{
					struct Eq_392683 * a4_146 = (word32) wLoc22_329;
					a4_146->b00EF = (byte) (word32) *a5_141;
					word32 a0_152 = a4_146 + 1 << 16;
					wLoc22_329 = (word16) (a0_152 >> 16);
					++a5_141;
				} while (a5_141 != (byte *) 3706930476);
				Eq_2 a0_171;
				word32 s8_496;
				Eq_2 s0_164 = dhcp_option_hostname.isra.0(a0_152 >> 16, (byte *) 0xEF, dwArg14, out a0_171, out s8_496);
				ptr32 mstatus_189;
				Eq_2 s2_192;
				Eq_2 s3_193;
				Eq_2 s8_197;
				Eq_2 a3_217;
				Eq_2 a4_218;
				ptr32 mstatus_222;
				Eq_2 s3_227;
				Eq_2 s4_228;
				word32 s1_497;
				word32 s4_498;
				word32 s6_499;
				word32 s2_500;
				word32 s0_501;
				word32 a0_502;
				word32 a1_503;
				word32 a2_504;
				word32 a5_506;
				word32 a4_505;
				word32 a7_507;
				word32 s4_508;
				word32 s8_509;
				ra = pbuf_free(udp_sendto_if_src(dhcp_option_trailer(ra, s0_164, a0_171, s0_164, a0_56, s2, a0_56, s4_116 >> 0x10, mstatus, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_497, out s2_192, out s3_193, out s4_498, out s6_499, out s8_197, out mstatus_189), g_t4200F5EC, s3_193, 588036832, 67, s2_192, 588036828, s8_197, mstatus_189, s0, dwArg48, s5, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out a3_217, out a4_218, out s2_500, out s3_227, out s4_228, out mstatus_222), s3_227, a3_217, a4_218, s4_228, mstatus_222, dwArgF8, out s0_501, out s1, out a0_502, out a1_503, out a2_504, out a3, out a4_505, out a5_506, out a7_507, out s2, out s3, out s4_508, out s5, out s6, out s8_509, out mstatus);
			}
			int32 a5_270 = (word32) *((word32) s1 + 6);
			if (a5_270 != 0x00FF)
				*((word32) s1 + 6) = (byte) (a5_270 + 0x01);
			word32 a5_279;
			up32 a4_276 = (word32) *((word32) s1 + 6);
			if (a4_276 <= 0x05)
				a5_279 = (word32) (word16) ((0x01 << a4_276) + 1000);
			else
				a5_279 = 0x0EFFFA60;
			*((word32) s1 + 8) = (word16) (a5_279 + 499 ^ 500);
			a4.u0 = 500;
		}
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg78;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 2306D188: Register Eq_2 dhcp_dec_pcb_refcount(Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_392813) a5Out)
// Called from:
//      dhcp_start
//      dhcp_stop
Eq_2 dhcp_dec_pcb_refcount(Eq_2 a0, Eq_2 a3, ptr32 mstatus, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_392813 & a5Out)
{
	struct Eq_392813 * a5_8 = (word32) g_b4200F5F0 + ~0x00 & 0x00FF;
	g_b4200F5F0 = (byte) a5_8;
	if (a5_8 != null)
	{
		a3Out = a3;
		a4Out = 0x4200F5F0;
		a5Out = a5_8;
		return s1;
	}
	else
	{
		word32 * s0_15 = *a0;
		Eq_2 a3_23;
		ptr32 a4_24;
		struct Eq_392813 * a5_25;
		word32 a0_52;
		word32 a2_53;
		Eq_2 s1_26 = udp_remove(a0, a3, mstatus, out a0_52, out a2_53, out a3_23, out a4_24, out a5_25);
		*s0_15 = 0x00;
		a3Out = a3_23;
		a4Out = a4_24;
		a5Out = a5_25;
		return s1_26;
	}
}

// 2306D1C2: Register Eq_2 dhcp_handle_ack.isra.3(Register Eq_2 a0, Register (ptr32 Eq_392851) a1, Register (ptr32 Eq_392852) a4, Register out (ptr32 Eq_392853) s1Out, Register out Eq_392854 a5Out, Register out ptr32 s4Out)
// Called from:
//      dhcp_recv
Eq_2 dhcp_handle_ack.isra.3(Eq_2 a0, struct Eq_392851 * a1, struct Eq_392852 * a4, struct Eq_392853 & s1Out, union Eq_392854 & a5Out, ptr32 & s4Out)
{
	word32 a5_12 = (word32) g_b420267DB;
	((word32) a0 + 32)->u0 = 0x00;
	((word32) a0 + 36)->u0 = 0x00;
	Eq_2 s0_111 = a0;
	if (a5_12 != 0x00)
		g_ptr420267BC->t0028 = a0;
	struct Eq_392871 * a5_25;
	struct Eq_392872 * a5_23 = (word32) g_b420267DC;
	if (a5_23 != null)
		a5_25 = g_ptr420267C0;
	else
	{
		s0_111 = a5_23->t0028;
		a5_25 = a5_23 >> 1;
	}
	struct Eq_392896 * a5_40;
	a5_25->t002C = s0_111;
	if ((word32) g_b420267DD != 0x00)
		a5_40 = g_ptr420267C4;
	else
	{
		s0_111 = a4->t0028;
		a5_40 = a4 + 0x07 >>u 3;
	}
	a5_40->t0030 = s0_111;
	((word32) a1->b0013 << 24 | (((word32) a1->b0011 << 8 | (word32) a1->b0010) | (word32) a1->b0012 << 16))->t001C = s0_111;
	if ((word32) g_b420267DE != 0x00)
	{
		word32 a3_176;
		word32 a4_177;
		word32 a5_178;
		a0 = lwip_htonl(g_t420267C8, out a3_176, out a4_177, out a5_178);
		*((word32) a0 + 32) = s0_111;
		((word32) s0_111 + 7)->u0 = 0x01;
	}
	else
		((word32) s0_111 + 7)->u0 = 0x00;
	if ((word32) g_b420267DF != 0x00)
	{
		word32 a3_179;
		word32 a4_180;
		word32 a5_181;
		a0 = lwip_htonl(g_t420267CC, out a3_179, out a4_180, out a5_181);
		*((word32) a0 + 36) = s0_111;
	}
	Eq_392854 a5_110 = (word32) g_b420267E0;
	if (a5_110 != 0x00)
	{
		s0_111 = *((word32) a0 + 32);
		union Eq_109206 * a4_96;
		word32 a3_182;
		word32 a5_183;
		lwip_htonl(a0, out a3_182, out a4_96, out a5_183);
		word32 a4_184;
		word32 a5_185;
		Eq_2 a0_107 = dns_setserver(0x00, fp + ~0x13, a4_96, out a4_184, out a5_185);
		a5_110 = (word32) g_b420267E1;
		if (a5_110 != 0x00)
		{
			s0_111 = *((word32) a0_107 + 36);
			union Eq_109206 * a4_114;
			word32 a3_186;
			word32 a5_187;
			lwip_htonl(a0_107, out a3_186, out a4_114, out a5_187);
			word32 a4_188;
			dns_setserver(0x01, fp + ~0x13, a4_114, out a4_188, out a5_110);
		}
	}
	s1Out = &g_t420267D8;
	a5Out = a5_110;
	s4Out = dwArg04;
	return s0_111;
}

