pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306D2B2: void dhcp_recv(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8)
void dhcp_recv(Eq_2 ra, Eq_2 s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8)
{
	struct Eq_393067 * s1_7 = g_ptr4202691C;
	Eq_2 s3_310 = s1_7->t0028;
	Eq_2 s2_101 = a2;
	if (s3_310 != 0x00 && (word32) (*((word32) s3_310 + 4)) != 0x00)
	{
		a4 = (word32) *((word32) a2 + 0x0A);
		if (a4 > 43)
		{
			a4.u0 = 0x02;
			a3 = (word32) *(union Eq_2 *) 43;
			if (a3 == 0x02)
			{
				uint32 a2_41 = (word32) s1_7->b0040;
				a4.u0 = 0x00;
				a3.u0 = 0x06;
				do
				{
					if ((a4_2289 & 0x00FF) >= a2_41 || a4_2289 == 0x06)
					{
						word32 a5_2240;
						if (lwip_htonl((word32) *(union Eq_2 *) 0x32 << 24 | ((word32) (*((union Eq_2 *) 0x31)) << 16 | ((word32) (*((union Eq_2 *) 0x30)) << 8 | (word32) (*((union Eq_393154 *) 0x2F)))), out a3, out a4, out a5_2240) == *s3_310)
						{
							word32 a1_2242;
							word32 a5_2245;
							word32 a2_2243;
							word32 t1_2241;
							word32 a4_2244;
							Eq_2 a0_296;
							ra = memset(ra, 0x420267D8, 0x00, 0x0A, out t1_2241, out a0_296, out a1_2242, out a2_2243, out a3, out a4_2244, out a5_2245);
							s4.u0 = 0x42026000;
							a4 = (word32) *((word32) a2 + 0x0A);
							if (a4 > 43)
							{
								Eq_2 s8_109 = (word32) *((word32) a2 + 8);
								Eq_2 s11_106 = 0x00F0;
l2306D368:
								Eq_2 s6_102 = s2_101;
								do
								{
									Eq_2 a5_105 = (word32) *((word32) s6_102 + 0x0A);
									if (s11_106 < a5_105)
									{
										Eq_2 s7_116 = 0x10000000;
										Eq_2 s9_117 = s11_106;
										Eq_2 dwLoc68_1426 = *((word32) s6_102 + 4);
										Eq_2 a5_121 = 0x0FFFFFFD;
										while (true)
										{
											byte bLoc44_2118 = (byte) s4;
											if (s9_117 >= s8_109)
												break;
											a4 = a5_121 + s9_117;
											a3.u0 = 0x00FF;
											Eq_2 a5_131 = (word32) *a4;
											if (a5_131 == 0x00FF)
												break;
											s7_116 = (word32) (word16) ((word32) s9_117 + 2);
											if (s7_116 < s9_117)
												goto l2306D39A;
											ui32 s10_162;
											a3 = (word32) s9_117 + 1;
											if (a3 < (word32) (*((word32) s6_102 + 0x0A)))
											{
												a4 = (word32) *((byte) a4.u0 + 1);
												goto l2306D400;
											}
											struct Eq_393570 * a4_138 = *s6_102;
											if (a4_138 != null)
											{
												a4 = (word32) *a4_138->ptr0004;
l2306D400:
												if (a5_131 != 0x0033)
												{
													if (a5_131 <= 0x0033)
													{
														if (a5_131 != 0x01)
														{
															if (a5_131 == 0x00)
																goto l2306D572;
															a3.u0 = 0x03;
															if (a5_131 != 0x03)
																goto l2306D41E;
															if (a5_131 >= a4)
																goto l2306D39A;
															s10_162 = 0x07;
															s0.u0 = 0x04;
														}
														else
														{
															a5_131.u0 = 0x04;
															if (a4 != 0x04)
																goto l2306D39A;
															s0.u0 = 0x04;
															s10_162 = 0x06;
														}
														goto l2306D486;
													}
													a3.u0 = 54;
													if (a5_131 == 54)
														goto l2306D558;
													if (a5_131 <= 54)
													{
														a3.u0 = 52;
														if (a5_131 != 52)
															goto l2306D450;
														goto l2306D542;
													}
													a3.u0 = 58;
													if (a5_131 != 58)
														goto l2306D46C;
													goto l2306D566;
												}
												a5_131.u0 = 0x04;
												if (a4 != 0x04)
													goto l2306D39A;
												s0.u0 = 0x04;
												s10_162 = 0x03;
												goto l2306D486;
											}
											a4.u0 = 0x0033;
											if (a5_131 == 0x0033)
												goto l2306D39A;
											if (a5_131 <= 0x0033)
											{
												a4.u0 = 0x01;
												if (a5_131 == 0x01)
													goto l2306D39A;
												if (a5_131 != 0x00)
												{
													a4.u0 = 0x03;
													if (a5_131 == 0x03)
														goto l2306D39A;
													a4.u0 = 0x00;
l2306D41E:
													a3.u0 = 0x06;
													if (a5_131 != 0x06)
														goto l2306D422;
													if ((a4 & 3) != 0x00)
														goto l2306D39A;
													a5_131.u0 = 0x08;
													s0 = a4 & 0x00FF;
													if (a4 > 0x08)
														s0.u0 = 0x08;
													if (a4 < s0)
														goto l2306D39A;
													s10_162 = 0x08;
													goto l2306D486;
												}
l2306D572:
												s9_117 = (word32) (word16) a3;
												goto l2306D57A;
											}
											if (a5_131 != 54)
											{
												if (a5_131 <= 54)
												{
													if (a5_131 != 52)
													{
														a4.u0 = 0x00;
l2306D450:
														a3.u0 = 53;
														if (a5_131 != 53)
															goto l2306D422;
														a5_131.u0 = 0x01;
														if (a4 != 0x01)
															goto l2306D39A;
														s0.u0 = 0x01;
														s10_162 = 0x01;
													}
													else
													{
														a4.u0 = 0x00;
l2306D542:
														if (a4 != 0x01)
															goto l2306D39A;
														a5_131.u0 = 0x00F0;
														if (s11_106 != 0x00F0)
															goto l2306D39A;
														s0.u0 = 0x01;
														s10_162 = 0x00;
													}
												}
												else if (a5_131 != 58)
												{
													a4.u0 = 0x00;
l2306D46C:
													a3.u0 = 59;
													if (a5_131 == 59)
													{
														a5_131.u0 = 0x04;
														if (a4 != 0x04)
															goto l2306D39A;
														s0.u0 = 0x04;
														s10_162 = 0x05;
													}
													else
													{
l2306D422:
														s10_162 = ~0x00;
														s0.u0 = 0x00;
													}
												}
												else
												{
													a4.u0 = 0x00;
l2306D566:
													a5_131.u0 = 0x04;
													if (a4 != 0x04)
														goto l2306D39A;
													s0.u0 = 0x04;
													s10_162 = 0x04;
												}
											}
											else
											{
												a4.u0 = 0x00;
l2306D558:
												a5_131.u0 = 0x04;
												if (a4 != 0x04)
													goto l2306D39A;
												s0.u0 = 0x04;
												s10_162 = 0x02;
											}
l2306D486:
											s4 = dwArg74;
											if (a5_131 < a4 + s9_117)
												goto l2306D39A;
											a4 += s7_116;
											s9_117 = (word32) (word16) a4;
											if (s0 != 0x00)
											{
												dwArg24.u0 = 0x00;
												byte * a5_274 = (word32) dwArg74 + 2008 + s10_162;
												while (true)
												{
													a4 = (word32) *a5_274;
													if (a4 != 0x00)
														break;
													Eq_2 a4_280 = s0 & 0x00FF;
													if (s0 > 0x04)
														a4_280.u0 = 0x04;
													dwLoc64 = a4_280;
													Eq_2 a5_308;
													word32 a1_2283;
													word32 a2_2284;
													word32 s8_2285;
													word32 s1_2282;
													s0 = pbuf_copy_partial(s6_102, fp + -0x0044, a4_280, s7_116, out s1_2282, out a0_296, out a1_2283, out a2_2284, out a3, out a4, out a5_308, out s2_101, out s3_310, out s4, out s8_2285);
													s8_109 = dwArg54;
													if (a4 != a0_296)
														goto l2306D39A;
													if (s0 <= 0x04)
													{
														if (s0 == 0x04)
														{
															word32 a5_2288;
															word32 a4_2287;
															a0_296 = lwip_htonl(a0_296, out a3, out a4_2287, out a5_2288);
															dwArg24 = a0_296;
														}
														else
														{
															if (s0 != 0x01)
																goto l2306D39A;
															dwArg24 = (word32) bLoc44_2118;
														}
														byte * a5_332 = s10_162 + 0x420267D8;
														*a5_332 = 0x01;
														(&g_dw420267B0)[s10_162 * 0x04] = a5_332;
														a4.u0 = 0x01;
														break;
													}
													a4 = s0 & 3;
													if ((s0 & 3) != 0x00)
														goto l2306D39A;
													*a5_308 = 0x01;
													word32 a5_397;
													word32 a4_2286;
													a0_296 = lwip_htonl(a0_296, out a3, out a4_2286, out a5_397);
													*a0_296 = (s10_162 << 0x02) + 0x420267B0;
													dwLoc64 = a5_308;
													s8_109 = dwArg74;
													a4 = CONVERT(SLICE(s7_116 + 4, word16, 0), word16, word32);
													s0 = s0 + ~0x03 & 0x00FF;
													a5_274 = a5_397 + 0x01;
													if (a4 < s7_116)
														goto l2306D39A;
													++s10_162;
													s7_116 = a4;
												}
											}
l2306D57A:
											a5_121 = (word32) *((word32) s6_102 + 0x0A);
											if (s9_117 < a5_121)
												continue;
											s9_117 = (word32) (word16) (s9_117 - a5_121);
											s8_109 = (word32) (word16) (s8_109 - a5_121);
											if (s9_117 >= s8_109)
												goto l2306D39A;
											s6_102 = *s6_102;
											if (s6_102 == 0x00)
												goto l2306D39A;
											a5_121 = *((word32) s6_102 + 4);
											dwLoc68_1426 = a5_121;
										}
										a4 = (byte) s4.u0 + 2008;
										int32 a5_421 = (word32) *a4;
										if (a5_421 != 0x00)
										{
											a5_421 = g_dw420267B0;
											*a4 = 0x00;
											a4.u0 = 0x01;
											if (a5_421 == 0x01)
											{
l2306D676:
												s8_109.u0 = 0x00EC;
												s11_106.u0 = 0x006C;
												goto l2306D368;
											}
											a4.u0 = 0x02;
											if (a5_421 == 0x02)
											{
l2306D660:
												s8_109.u0 = 0x006C;
												s11_106.u0 = 44;
												goto l2306D368;
											}
											a4.u0 = 0x03;
											if (a5_421 == 0x03)
												goto l2306D676;
										}
										if (a5_421 == 0x00)
										{
											if ((word32) g_b420267D9 == 0x00)
												break;
											a4 = (word32) g_b420267B4;
											a3.u0 = 0x05;
											struct Eq_392851 * a1_481 = *((word32) s2_101 + 4);
											if (a4 != 0x05)
											{
												a3.u0 = 0x06;
												if (a4 == 0x06)
												{
													a4 = (word32) *((word32) s3_310 + 5);
													a3.u0 = 0x02;
													if ((a4 + -3 & 0x00FF) <=u 0x02 || a4 == 0x01)
													{
														Eq_2 s1_646 = *((word32) a0_296 + 40);
														Eq_2 a4_671;
														ptr32 mstatus_675;
														Eq_2 s0_677;
														Eq_2 s1_678;
														Eq_2 s4_683;
														word32 s1_2268;
														word32 s7_2266;
														word32 s6_2273;
														word32 s0_2267;
														word32 s6_2265;
														word32 s2_2262;
														word32 a5_2261;
														word32 s3_2271;
														word32 a2_2259;
														word32 a1_2258;
														word32 a3_2260;
														word32 s3_2263;
														word32 s5_2264;
														word32 a5_2270;
														word32 a0_2269;
														word32 s5_2272;
														ra = dhcp_discover(netif_set_addr(ra, s1_646, s1_646, &g_ptr230CBADC, 588036828, 588036828, a4, dhcp_set_state(a0_296, 0x0C), s3_310, s4, s7_116, mstatus, dwLoc6C, dwLoc68_1426, dwLoc58, s6, s4, dwLoc2C, dwLoc28, dwLoc18, dwLoc08, dwLoc04, dwArg04, dwArg08, 0x0FFFFFFD, dwArg28, dwArg48, dwArgB8, dwArgC8, out s0_677, out s1_678, out a1_2258, out a2_2259, out a3_2260, out a4_671, out a5_2261, out s2_2262, out s3_2263, out s4_683, out s5_2264, out s6_2265, out s7_2266, out mstatus_675), s0_677, s1_678, a4_671, s4_683, mstatus_675, dwLoc18, dwLoc08, dwArg08, 0x0FFFFFFD, dwArg28, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, out s0_2267, out s1_2268, out a0_2269, out a3, out a4, out a5_2270, out s2_101, out s3_2271, out s4, out s5_2272, out s6_2273, out mstatus);
													}
												}
												else if (a4 == 0x02)
												{
													a4 = (word32) *((word32) s3_310 + 5);
													if (a4 == 0x06)
													{
														a4 = (word32) g_b420267DA;
														if (a4 != 0x00)
														{
															Eq_2 s1_522 = *((word32) s0 + 40);
															*((word32) s0 + 8) = 0x00;
															word32 a3_2274;
															word32 a5_2276;
															word32 a4_2275;
															*((word32) lwip_htonl(a0_296, out a3_2274, out a4_2275, out a5_2276) + 24) = s0;
															Eq_2 a4_560 = (word32) a1_481->b0011 << 8 | (word32) a1_481->b0010 | (word32) a1_481->b0012 << 16;
															((word32) a1_481->b0013 << 24 | a4_560)->t001C = s0;
															word32 s0_2277;
															word32 s1_2278;
															word32 s6_2281;
															word32 s5_2280;
															word32 s3_2279;
															ra = dhcp_select(ra, s0, s1_522, s1_522, a4_560, s4, 0x420267B0, mstatus, dwLoc5C, dwLoc28, dwLoc08, dwArg08, 0x0FFFFFFD, dwArg28, s5, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, out s0_2277, out s1_2278, out a3, out a4, out s2_101, out s3_2279, out s4, out s5_2280, out s6_2281, out mstatus);
														}
													}
												}
												break;
											}
											Eq_2 s4_732;
											Eq_2 a5_729;
											Eq_2 s1_731;
											Eq_2 s0_730;
											Eq_2 a0_738;
											word32 a5_722 = (word32) *((word32) s3_310 + 5);
											if (a5_722 == 0x01)
											{
												word32 a5_2246;
												s0_730 = dhcp_handle_ack.isra.3(a0_296, a1_481, (struct Eq_392852 *) 0x01, out s1_731, out a5_2246, out s4_732);
												ui32 a5_750 = (word32) *((word32) s1_731 + 65);
												a0_738 = s1_731;
												a5_729 = a5_750 & 0x08;
												if ((a5_750 & 0x08) != 0x00)
												{
													word32 s1_2253;
													word32 s3_2254;
													word32 s6_2256;
													word32 s7_2257;
													word32 s5_2255;
													ra = dhcp_check(ra, s0_730, s4_732, mstatus, dwLoc6C, s6, dwLoc38, dwLoc28, dwLoc0C, dwLoc08, dwArg08, 0x0FFFFFFD, dwArg20, dwArg24, dwArg28, s5, dwArg48, dwArg58, dwArg64, dwArg68, dwArg78, dwArg80, dwArg84, dwArg88, dwArgA8, dwArgF8, out s1_2253, out a3, out a4, out s2_101, out s3_2254, out s4, out s5_2255, out s6_2256, out s7_2257, out mstatus);
													break;
												}
											}
											else
											{
												a4.u0 = 0x02;
												if ((a5_722 + ~0x02 & 0x00FF) > 0x02)
													break;
												s0_730 = dhcp_handle_ack.isra.3(a0_296, a1_481, (struct Eq_392852 *) 0x02, out s1_731, out a5_729, out s4_732);
												a0_738 = s1_731;
											}
											word32 s7_2252;
											word32 s3_2249;
											word32 s5_2250;
											word32 s0_2247;
											word32 s1_2248;
											word32 s6_2251;
											ra = dhcp_bind(ra, s0_730, s1_731, a0_738, a5_729, s3_310, s4_732, s7_116, mstatus, dwLoc68_1426, dwLoc64, s8, s6, dwLoc38, dwLoc28, dwLoc24, dwLoc1C, dwLoc18, dwArg08, dwArg28, dwArg98, dwArgA8, out s0_2247, out s1_2248, out a3, out a4, out s2_101, out s3_2249, out s4, out s5_2250, out s6_2251, out s7_2252, out mstatus);
											break;
										}
										goto l2306D660;
									}
									s6_102 = *s6_102;
									s11_106 = (word32) (word16) (s11_106 - a5_105);
									s8_109 = (word32) (word16) (s8_109 - a5_105);
								} while (s6_102 != 0x00);
							}
						}
						break;
					}
					a4 = (word32) a4_2289 + 1;
					a4_2289 = a4;
				} while (CONVERT(Mem31[a4 + 70:byte], byte, word32) == CONVERT(Mem31[(s1_7 + a4_2289) + 58:byte], byte, word32));
			}
		}
	}
l2306D39A:
	word32 s3_2234;
	word32 s0_2224;
	word32 s8_2238;
	word32 s6_2237;
	word32 mstatus_2239;
	word32 s1_2225;
	word32 a7_2232;
	word32 s2_2233;
	word32 s4_2235;
	word32 a4_2230;
	word32 s5_2236;
	word32 a5_2231;
	word32 a1_2227;
	word32 a2_2228;
	word32 a3_2229;
	word32 a0_2226;
	pbuf_free(ra, s2_101, a3, a4, s4, mstatus, dwArgB8, out s0_2224, out s1_2225, out a0_2226, out a1_2227, out a2_2228, out a3_2229, out a4_2230, out a5_2231, out a7_2232, out s2_2233, out s3_2234, out s4_2235, out s5_2236, out s6_2237, out s8_2238, out mstatus_2239);
}

// 2306D782: Register Eq_2 dhcp_network_changed(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_393832) a5, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out ptr32 mstatusOut)
// Called from:
//      netif_set_link_up
Eq_2 dhcp_network_changed(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_393832 * a5, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, ptr32 & mstatusOut)
{
	if (a5 == null)
	{
l2306D7AE:
		s0Out = s0;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a4_6 = (word32) a5->b0005;
		if (a4_6 <= 0x05)
		{
			if (a4_6 < 0x03)
			{
				if (a4_6 != 0x00)
				{
l2306D798:
					a5->b0006 = 0x00;
					ptr32 mstatus_68;
					Eq_2 s0_70;
					word32 s6_208;
					word32 s5_207;
					word32 s4_206;
					word32 s2_204;
					word32 s3_205;
					word32 a5_203;
					word32 a4_202;
					word32 a3_201;
					word32 a0_200;
					word32 s1_199;
					Eq_2 ra_69 = dhcp_discover(ra, s0, s1, a4_6, s4, mstatus, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out s0_70, out s1_199, out a0_200, out a3_201, out a4_202, out a5_203, out s2_204, out s3_205, out s4_206, out s5_207, out s6_208, out mstatus_68);
					s0Out = s0_70;
					mstatusOut = mstatus_68;
					return ra_69;
				}
				goto l2306D7AE;
			}
		}
		else if (a4_6 != 0x0A)
			goto l2306D798;
		a5->b0006 = 0x00;
		word32 s6_215;
		ptr32 mstatus_34;
		Eq_2 s0_36;
		word32 s5_214;
		word32 s4_213;
		word32 s3_212;
		word32 s2_211;
		word32 a4_210;
		word32 s1_209;
		Eq_2 ra_35 = dhcp_reboot(ra, s0, s1, a4_6, s4, s5, mstatus, dwArg14, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out s0_36, out s1_209, out a4_210, out s2_211, out s3_212, out s4_213, out s5_214, out s6_215, out mstatus_34);
		s0Out = s0_36;
		mstatusOut = mstatus_34;
		return ra_35;
	}
}

