pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306D7B0: Register Eq_2 dhcp_arp_reply(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_input
Eq_2 dhcp_arp_reply(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		uint16 wLoc22_209 = SLICE(s4, uint16, 16);
		Eq_2 a0_17 = *((word32) s0 + 40);
		if (s0 != 0x00)
		{
			a4 = (word32) *((word32) s0 + 5);
			if (a4 == 0x08)
			{
				Eq_2 s0_21 = *(union Eq_2 *) 0x24;
				if (a4 == 0x08)
				{
					dhcp_set_state(s0_21, 0x0C);
					struct Eq_393978 * s1_41;
					Eq_2 a0_55;
					word32 s6_359;
					word32 s5_358;
					word32 s2_357;
					word32 a5_356;
					word32 a4_355;
					struct Eq_393985 * s0_151;
					ra = dhcp_create_msg(ra, s0_21, a0_17, s0_21, fp + -0x0022, a4, a0_17, mstatus, dwLoc0C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_151, out s1_41, out a0_55, out a3, out a4_355, out a5_356, out s2_357, out s3, out s4, out s5_358, out s6_359, out mstatus);
					if (a0_55 != 0x00)
					{
						int32 a5_58 = (word32) wLoc22_209;
						Eq_2 a0_57 = s1_41->t0004;
						((char *) &s1_41->t0004 + 0x00EC)[a5_58] = 0x32;
						((char *) &s1_41->t0004 + 0x00EC)[(word32) (word16) (a5_58 + 0x01)] = 0x04;
						uint32 s3_71 = a5_58 + 2 << 16;
						ptr32 mstatus_96;
						Eq_2 s2_99;
						Eq_2 s4_101;
						Eq_2 s8_104;
						Eq_2 a3_124;
						Eq_2 a4_125;
						ptr32 mstatus_129;
						Eq_2 s2_133;
						Eq_2 s4_135;
						word32 a0_368;
						word32 a1_369;
						word32 a2_370;
						word32 s1_367;
						word32 s3_366;
						word32 s6_365;
						word32 s3_364;
						word32 s1_363;
						word32 a5_362;
						word32 a4_361;
						word32 a3_360;
						word32 a4_371;
						word32 a5_372;
						word32 a7_373;
						word32 s2_374;
						word32 s5_375;
						word32 s6_376;
						word32 s8_377;
						ra = pbuf_free(udp_sendto_if_src(dhcp_option_trailer(ra, *((word32) a0_57 + 28), dhcp_option_long(s3_71 >> 0x10, (char *) &s1_41->t0004 + 0x00EC, lwip_htonl(a0_57, out a3_360, out a4_361, out a5_362)), (char *) &s1_41->t0004 + 0x00EC, a0_55, a0_55, s3_71 >> 0x10, s4, mstatus, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_363, out s2_99, out s3_364, out s4_101, out s6_365, out s8_104, out mstatus_96), g_t4200F5EC, s2_99, 588036832, 67, s4_101, 588036828, s8_104, mstatus_96, s0, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out a3_124, out a4_125, out s2_133, out s3_366, out s4_135, out mstatus_129), s2_133, a3_124, a4_125, s4_135, mstatus_129, dwArgF8, out s0_151, out s1_367, out a0_368, out a1_369, out a2_370, out a3, out a4_371, out a5_372, out a7_373, out s2_374, out s3, out s4, out s5_375, out s6_376, out s8_377, out mstatus);
					}
					int32 a5_176 = (word32) s0_151->t0006;
					a4.u0 = 0x00FF;
					if (a5_176 != 0x00FF)
						s0_151->t0006 = (byte) (a5_176 + 0x01);
					s0_151->w0008 = 0x14;
				}
			}
		}
		0x00 = (int8) dwArg0128;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
}

// 2306D894: Register Eq_2 dhcp_renew(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_394152) s0Out, Register out (ptr32 Eq_394153) s1Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_coarse_tmr
Eq_2 dhcp_renew(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, struct Eq_394152 & s0Out, struct Eq_394153 & s1Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 a0_14 = *((word32) s1 + 40);
	dhcp_set_state(s1, 0x05);
	word32 a0_50;
	word32 s5_380;
	word32 s6_381;
	word32 a5_378;
	word32 s2_379;
	word32 a3_376;
	word32 a4_377;
	word32 s0_375;
	struct Eq_394153 * s1_195;
	Eq_2 s4_200;
	Eq_2 s3_197;
	ptr32 mstatus_209;
	Eq_2 ra_210 = dhcp_create_msg(ra, s0, a0_14, s1, fp + -0x0022, a4, s4, mstatus, dwLoc0C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_375, out s1_195, out a0_50, out a3_376, out a4_377, out a5_378, out s2_379, out s3_197, out s4_200, out s5_380, out s6_381, out mstatus_209);
	if (a0_50 != 0x00)
	{
		struct Eq_394204 * a5_53 = (word32) wLoc22;
		Eq_2 a0_52 = *(union Eq_2 *) 0x03;
		a5_53->b00EF = 0x39;
		((byte[]) 0xEF)[(word32) (word16) ((char *) a5_53 + 1)] = 0x02;
		Eq_2 a0_71 = dhcp_option_short((word32) (word16) ((char *) a5_53 + 2), (byte *) 0xEF, (word32) *((word32) s3_197 + 56));
		*((word32) a0_71 + 0x00EF) = 55;
		((byte[]) 0xEF)[(word32) (word16) ((word32) a0_71 + 1)] = 0x04;
		uint16 wLoc22_262 = (word16) ((word32) a0_71 + 2);
		byte * a5_104 = g_a230CBAD8;
		do
		{
			struct Eq_394252 * a4_92 = (word32) wLoc22_262;
			a4_92->b00EF = (byte) (word32) *a5_104;
			word32 a0_98 = a4_92 + 1 << 16;
			wLoc22_262 = (word16) (a0_98 >> 16);
			++a5_104;
		} while (a5_104 != (byte *) 3706930476);
		Eq_2 a0_117;
		word32 s8_382;
		Eq_2 s0_110 = dhcp_option_hostname.isra.0(a0_98 >> 16, (byte *) 0xEF, dwArg14, out a0_117, out s8_382);
		ptr32 mstatus_135;
		word32 s1_137;
		Eq_2 s2_138;
		Eq_2 s3_139;
		Eq_2 s8_143;
		Eq_2 a3_160;
		Eq_2 a4_161;
		ptr32 mstatus_165;
		Eq_2 s2_169;
		Eq_2 s4_171;
		word32 s6_384;
		word32 s8_387;
		word32 s7_386;
		word32 a0_389;
		word32 s0_388;
		word32 a2_391;
		word32 a1_390;
		word32 a4_393;
		word32 a3_392;
		word32 s5_397;
		word32 a5_394;
		word32 a7_395;
		word32 s6_398;
		word32 s8_399;
		word32 s2_396;
		word32 s3_385;
		word32 s4_383;
		ra_210 = pbuf_free(udp_sendto_if(dhcp_option_trailer(ra_210, s0_110, a0_117, s0_110, a0_52, a0_52, s3_197, s4_200, mstatus_209, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_137, out s2_138, out s3_139, out s4_383, out s6_384, out s8_143, out mstatus_135), g_t4200F5EC, s2_138, s1_137 + 24, 67, s3_139, s8_143, mstatus_135, s0, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out a3_160, out a4_161, out s2_169, out s3_385, out s4_171, out s7_386, out s8_387, out mstatus_165), s2_169, a3_160, a4_161, s4_171, mstatus_165, dwArgF8, out s0_388, out s1_195, out a0_389, out a1_390, out a2_391, out a3_392, out a4_393, out a5_394, out a7_395, out s2_396, out s3_197, out s4_200, out s5_397, out s6_398, out s8_399, out mstatus_209);
	}
	int32 a5_213 = (word32) s1_195->t0006;
	if (a5_213 != 0x00FF)
		s1_195->t0006 = (byte) (a5_213 + 0x01);
	word32 a5_222;
	up32 a5_219 = (word32) s1_195->t0006;
	if (a5_219 <= 0x09)
		a5_222 = (word32) (word16) (a5_219 + 2000);
	else
		a5_222 = 0x04FFFE20;
	s1_195->w0008 = (word16) (a5_222 + 499 ^ 500);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_195;
	s3Out = s3_197;
	s4Out = s4_200;
	mstatusOut = mstatus_209;
	return ra_210;
}

