pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306DDAA: void dhcp_fine_tmr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void dhcp_fine_tmr(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 s0_262 = g_t420267E8;
	Eq_2 s1_113 = 0x01;
	Eq_2 s2_114 = 0x0C;
	Eq_2 s3_115 = 0x06;
	Eq_2 s4_116 = 0x08;
	Eq_2 s5_117 = 0x03;
	up32 s6_118 = 0x05;
	while (s0_262 != 0x00)
	{
		Eq_2 s0_135;
		Eq_2 s0_193 = *((word32) a4 + 40);
		if (a4 != 0x00)
		{
			Eq_2 a5_32 = (word32) *((word32) a4 + 8);
			if (s1_113 < a5_32)
			{
				*((word32) a4 + 8) = (word16) ((word32) a5_32 - 1);
				goto l2306DDF8;
			}
			if (a5_32 != s1_113)
				goto l2306DDF8;
			((word32) a4 + 8)->u2 = 0x00;
			s0_193 = *((word32) a4 + 40);
			Eq_2 a5_36 = (word32) *((word32) a4 + 5);
			if (a5_36 != s2_114 && a5_36 != s3_115)
			{
				if (a5_36 == s1_113)
				{
					if (s6_118 >= (word32) (*((word32) a4 + 6)))
					{
						word32 a3_547;
						ra = dhcp_select(ra, s0_193, s1_113, s0_193, a4, s4_116, s5_117, mstatus, dwLoc0C, dwArg28, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s0_193, out s1_113, out a3_547, out a4, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out mstatus);
					}
					else
					{
						Eq_2 a3_141;
						ptr32 mstatus_145;
						Eq_2 s4_152;
						Eq_2 s7_155;
						word32 s2_542;
						word32 s1_539;
						word32 a4_540;
						word32 a5_541;
						word32 s3_543;
						word32 s5_544;
						word32 s6_545;
						word32 a5_546;
						ra = dhcp_start(dhcp_release_and_stop(ra, s0_193, s3_115, s4_116, s7, mstatus, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s0_135, out s1_539, out a3_141, out a4_540, out a5_541, out s2_542, out s3_543, out s4_152, out s5_544, out s6_545, out s7_155, out mstatus_145), s0_135, a3_141, s4_152, s7_155, mstatus_145, s4, s2, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0158, out s1_113, out a4, out a5_546, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out s7, out mstatus);
						s0_193 = s0_135;
					}
					goto l2306DDF8;
				}
				if (a5_36 == s4_116)
				{
					Eq_2 a5_71 = (word32) *((word32) a4 + 6);
					if (s1_113 >= a5_71)
					{
						word32 a3_549;
						ra = dhcp_check(ra, s0_193, s4_116, mstatus, s4, dwArg08, dwArg18, dwArg28, dwArg44, dwArg48, dwArg58, s1, dwArg70, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD0, dwArgD4, dwArgD8, dwArgF8, dwArg0148, out s1_113, out a3_549, out a4, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out s7, out mstatus);
					}
					else
					{
						word32 a3_548;
						ra = dhcp_bind(ra, s0_193, s1_113, s0_193, a5_71, s3_115, s4_116, s7, mstatus, s2, s0, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg58, dwArg78, dwArgE8, dwArgF8, out s0_193, out s1_113, out a3_548, out a4, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out s7, out mstatus);
					}
					goto l2306DDF8;
				}
				if (a5_36 != s5_117)
					goto l2306DDF8;
				if (s1_113 < (word32) (*((word32) a4 + 6)))
					goto l2306DE14;
				ra = dhcp_reboot(ra, s0_193, s1_113, a4, s4_116, s5_117, mstatus, dwLoc0C, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s0_193, out s1_113, out a4, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out mstatus);
			}
			else
			{
l2306DE14:
				word32 a0_550;
				word32 a3_551;
				word32 a5_552;
				ra = dhcp_discover(ra, s0_193, s1_113, a4, s4_116, mstatus, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s0_193, out s1_113, out a0_550, out a3_551, out a4, out a5_552, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out mstatus);
			}
		}
l2306DDF8:
		s0_262 = *s0_193;
	}
	0x00 = (int8) dwArgA8;
}

// 2306DE68: Register Eq_2 dhcp_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcpd_start
Eq_2 dhcp_stop(Eq_2 ra, Eq_2 s0, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & s3Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_22;
	ptr32 s1_24;
	ptr32 s3_28;
	ptr32 s7_32;
	word32 s0_64;
	word32 a3_65;
	word32 a4_66;
	word32 a5_67;
	word32 s2_68;
	word32 s4_69;
	word32 s5_70;
	word32 s6_71;
	Eq_2 ra_23 = dhcp_release_and_stop(ra, s0, s3, s4, s7, mstatus, dwArg14, dwArg18, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out s0_64, out s1_24, out a3_65, out a4_66, out a5_67, out s2_68, out s3_28, out s4_69, out s5_70, out s6_71, out s7_32, out mstatus_22);
	s1Out = s1_24;
	s3Out = s3_28;
	s7Out = s7_32;
	mstatusOut = mstatus_22;
	return ra_23;
}

// 2306DE6C: Register Eq_2 etharp_free_entry(Register Eq_2 ra, Register (ptr32 Eq_395664) a0, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_395664) s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_find_entry
//      etharp_cleanup_netif
//      etharp_tmr
Eq_2 etharp_free_entry(Eq_2 ra, struct Eq_395664 * a0, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg0118, struct Eq_395664 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	struct Eq_395664 * s1_17 = a0;
	int32 s0_18 = 0x4201B0B8;
	union Eq_2 * s2_19 = &a0->t4201B0D0;
	Eq_2 a0_20 = a0->t4201B0D0;
	if (a0_20 != 0x00)
	{
		word32 a1_115;
		word32 a2_116;
		word32 a4_117;
		word32 a5_118;
		word32 a7_119;
		word32 s8_120;
		ra = pbuf_free(ra, a0_20, a3, (char *) &a0->t0007 + 0x0011, s4, mstatus, dwArg0118, out s0_18, out s1_17, out a0_20, out a1_115, out a2_116, out a3, out a4_117, out a5_118, out a7_119, out s2_19, out s3, out s4, out s5, out s6, out s8_120, out mstatus);
		*s2_19 = (union Eq_2 *) 0x00;
	}
	((char *) &s1_17->t0007 + 0x0011 + s0_18)[20] = 0x00;
	0x00 = (int8) dwArg38;
	s1Out = s1_17;
	a0Out = a0_20;
	a3Out = a3;
	s2Out = s2_19;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 2306DEB2: Register Eq_2 etharp_find_entry(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8, Register out ptr32 s0Out, Register out (ptr32 Eq_395664) s1Out, Register out (ptr32 Eq_395664) a0Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_input
//      etharp_query
Eq_2 etharp_find_entry(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 a2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgF8, ptr32 & s0Out, struct Eq_395664 & s1Out, struct Eq_395664 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a3_145 = 0x4201B0B8;
	up32 t0_16 = 0x00;
	up32 t6_17 = 0x00;
	up32 t5_18 = 0x00;
	struct Eq_395664 * t1_105 = (struct Eq_395664 *) 0x0A;
	struct Eq_395664 * a5_185 = null;
	struct Eq_395664 * a4_161 = (struct Eq_395664 *) 0x0A;
	struct Eq_395664 * a7_22 = (struct Eq_395664 *) 0x0A;
	struct Eq_395664 * s1_100 = (struct Eq_395664 *) 0x0A;
	ptr32 s0_180 = 0x4201B0B8;
	do
	{
		word32 t4_29 = (word32) *((word32) a3_145 + 20);
		if (a4_161 == (struct Eq_395664 *) 0x0A)
		{
			if (t4_29 != 0x00)
				goto l2306DEEA;
			a4_161 = a5_185;
		}
		else if (t4_29 != 0x00)
		{
l2306DEEA:
			if (a0 != 0x00)
			{
				s2 = *a0;
				if (s2 == *((word32) a3_145 + 4) && (a2 == 0x00 || *((word32) a3_145 + 8) == a2))
					goto l2306DF80;
			}
			up32 a6_45 = (word32) *((word32) a3_145 + 18);
			if (t4_29 == 0x01)
			{
				if (*a3_145 != 0x00)
				{
					if (a6_45 >= t5_18)
					{
						t5_18 = a6_45;
						t1_105 = a5_185;
					}
				}
				else if (a6_45 >= t6_17)
				{
					t6_17 = a6_45;
					s1_100 = a5_185;
				}
			}
			else if (a6_45 >= t0_16)
			{
				t0_16 = a6_45;
				a7_22 = a5_185;
			}
		}
		word32 a6_72 = (word32) (word16) &a5_185->b0001;
		a3_145 = (word32) a3_145 + 24;
		a5_185 = (int32) (word16) a6_72;
	} while (a6_72 != 0x0A);
	a3_145.u0 = 0x01;
	a5_185 = (struct Eq_395664 *) ~0x00;
	if (a1 == 0x01)
	{
		s3 = a2;
		s2 = a0;
		if (a4_161 == (struct Eq_395664 *) 0x0A)
		{
			if (a7_22 == a4_161)
			{
				if (s1_100 == a7_22)
				{
					if (t1_105 == s1_100)
						goto l2306DF80;
					s1_100 = t1_105;
				}
			}
			else
				s1_100 = a7_22;
			word32 a0_351;
			word32 s4_352;
			ra = etharp_free_entry(ra, s1_100, 0x01, s4, mstatus, dwArg18, dwArgF8, out s1_100, out a0_351, out a3_145, out s2, out s3, out s4_352, out s5, out s6, out mstatus);
			a4_161 = s1_100;
		}
		if (s2 != 0x00)
		{
			a3_145 = *s2;
			*((byte) a3_145.u0 + 4) = &a4_161->t4201B0D0;
		}
		struct Eq_395852 * a5_178 = (char *) &a4_161->t0007 + 0x0011;
		a5_178->w4201B0CA = 0x00;
		a5_178->t4201B0C0 = s3;
		s0_180 = (char *) a5_178 + 1107407032;
		a5_185 = a4_161;
	}
l2306DF80:
	s0Out = s0_180;
	s1Out = s1_100;
	a0Out = a5_185;
	a3Out = a3_145;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 2306DFAC: Register Eq_2 etharp_raw(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out (ptr32 Eq_395893) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_395897 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_input
//      etharp_request
//      etharp_output_to_arp_index
Eq_2 etharp_raw(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0198, ptr32 & s0Out, struct Eq_395893 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_395897 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	ptr32 a0_213;
	word32 a0_47;
	struct Eq_395907 * s0_52;
	struct Eq_395908 * s1_53;
	Eq_2 s8_54;
	Eq_2 s4_60;
	Eq_2 a7_62;
	word32 a2_312;
	word32 a5_313;
	Eq_2 s3_199;
	ptr32 s2_198;
	ptr32 mstatus_211;
	Eq_395897 a4_195;
	ptr32 a3_194;
	ptr32 a1_193;
	ptr32 s5_203;
	Eq_2 s6_204;
	Eq_2 ra_212 = pbuf_alloc(ra, s0, 0x42026000, 0x008E, 0x1C, 640, a3, a4, mstatus, dwLoc3C, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_52, out s1_53, out a0_47, out a1_193, out a2_312, out a3_194, out a4_195, out a5_313, out a7_62, out s2_198, out s3_199, out s4_60, out s5_203, out s6_204, out s8_54, out mstatus_211);
	struct Eq_395893 * s1_197 = (char *) s1_53 + 2032;
	if (a0_47 == 0x00)
	{
		s1_53->w0814 = (word16) ((word32) s1_53->w0814 + 0x01);
		a0_213 = ~0x00;
	}
	else
	{
		Eq_2 a0_74 = s0_52->t0004;
		word32 a5_314;
		Eq_2 a0_77 = lwip_htons(a7_62, out a5_314);
		s0_52->b0006 = (byte) a0_77;
		s0_52->b0007 = (byte) (a0_77 >> 8);
		word32 a1_315;
		word32 a2_316;
		word32 a3_317;
		word32 a4_318;
		word32 a5_319;
		word32 a6_320;
		word32 a7_321;
		memcpy(&s0_52->b0007 + 1, a3, 0x06, out a1_315, out a2_316, out a3_317, out a4_318, out a5_319, out a6_320, out a7_321);
		word32 a1_322;
		word32 a2_323;
		word32 a3_324;
		word32 a4_325;
		word32 a5_326;
		word32 a6_327;
		word32 a7_328;
		memcpy(&s0_52->b0007 + 11, s8_54, 0x06, out a1_322, out a2_323, out a3_324, out a4_325, out a5_326, out a6_327, out a7_328);
		word32 a1_329;
		word32 a2_330;
		word32 a3_331;
		word32 a4_332;
		word32 a5_333;
		word32 a6_334;
		word32 a7_335;
		memcpy(&s0_52->b0007 + 7, a4, 0x04, out a1_329, out a2_330, out a3_331, out a4_332, out a5_333, out a6_334, out a7_335);
		word32 a1_336;
		word32 a2_337;
		word32 a3_338;
		word32 a4_339;
		word32 a5_340;
		word32 a6_341;
		word32 a7_342;
		memcpy(&s0_52->b0007 + 0x0011, s6_204, 0x04, out a1_336, out a2_337, out a3_338, out a4_339, out a5_340, out a6_341, out a7_342);
		s0_52->b0001 = 0x01;
		s0_52->b0002 = 0x08;
		s0_52->t0004.u0 = 0x06;
		s0_52->b0005 = 0x04;
		s0_52->b0000 = 0x00;
		s0_52->b0003 = 0x00;
		Eq_2 a3_165;
		Eq_2 a4_166;
		struct Eq_396086 * s1_169;
		Eq_2 s2_170;
		Eq_2 s4_172;
		word32 s0_343;
		word32 s3_344;
		Eq_2 ra_178 = ethernet_output(ra_212, s3_199, a0_74, s4_60, 0x00FFF806, dwLoc08, dwArg18, dwArg34, dwArgA4, dwArgC0, dwArgC4, dwArgE8, out s0_343, out s1_169, out a3_165, out a4_166, out s2_170, out s3_344, out s4_172);
		s1_169->w0018 = (word16) ((word32) s1_169->w0018 + 0x01);
		word32 s0_345;
		word32 a0_346;
		word32 a2_347;
		word32 a5_348;
		word32 a7_349;
		word32 s4_350;
		word32 s8_351;
		ra_212 = pbuf_free(ra_178, s2_170, a3_165, a4_166, s4_172, mstatus_211, dwArgE8, out s0_345, out s1_197, out a0_346, out a1_193, out a2_347, out a3_194, out a4_195, out a5_348, out a7_349, out s2_198, out s3_199, out s4_350, out s5_203, out s6_204, out s8_351, out mstatus_211);
		a0_213 = 0x00;
	}
	0x00 = (int8) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_197;
	a0Out = a0_213;
	a1Out = a1_193;
	a3Out = a3_194;
	a4Out = a4_195;
	s2Out = s2_198;
	s3Out = s3_199;
	s4Out = dwLoc14;
	s5Out = s5_203;
	s6Out = s6_204;
	s7Out = a4;
	mstatusOut = mstatus_211;
	return ra_212;
}

// 2306E09E: Register Eq_395361 etharp_cleanup_netif(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8, Register out ptr32 s4Out)
// Called from:
//      netif_set_down
Eq_395361 etharp_cleanup_netif(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgF8, ptr32 & s4Out)
{
	Eq_2 s3_16 = a0;
	Eq_395361 s0_17 = 0x4201B0B8;
	struct Eq_395664 * s1_18 = null;
	struct Eq_395664 * s2_19 = (struct Eq_395664 *) 0x0A;
	do
	{
		Eq_2 a5_22 = (word32) *((word32) s0_17 + 20);
		if (a5_22 != 0x00)
		{
			s0_17 = *((word32) a5_22 + 8);
			if (a5_22 == s3_16)
			{
				word32 a0_141;
				word32 s5_142;
				word32 s6_143;
				ra = etharp_free_entry(ra, s1_18, a3, s4, mstatus, dwArg18, dwArgF8, out s1_18, out a0_141, out a3, out s2_19, out s3_16, out s4, out s5_142, out s6_143, out mstatus);
			}
		}
		s1_18 = (struct Eq_395664 *) &s1_18->b0001;
		s0_17 = (word32) s0_17 + 24;
	} while (s1_18 != s2_19);
	s4Out = dwArg04;
	return s0_17;
}

