pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306E0E0: void etharp_input(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158, Stack word32 dwArg0198)
// Called from:
//      ethernet_input
void etharp_input(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0158, word32 dwArg0198)
{
	if (a1 == 0x00)
		return;
	Eq_2 s3_130 = *((word32) s1 + 4);
	Eq_2 a4_227 = 0x0100;
	struct Eq_396246 * s2_120 = &g_t420267F0;
	if (((word32) *((word32) s1 + 1) << 8 | (word32) (*s1)) == 0x0100)
	{
		a4_227 = (word32) *((word32) s1 + 4);
		if (a4_227 == 0x06)
		{
			a4_227 = (word32) *((word32) s1 + 5);
			if (a4_227 == 0x04)
			{
				a4_227.u0 = 0x08;
				if (((word32) *((word32) s1 + 3) << 8 | (word32) (*((word32) s1 + 2))) == 0x08)
				{
					word32 s5_134;
					word32 s6_101;
					g_w4202680A = (word16) ((word32) g_w4202680A + 0x01);
					word32 a2_594;
					word32 a1_593;
					word32 a3_595;
					word32 a7_599;
					word32 a4_596;
					word32 a5_597;
					word32 a6_598;
					memcpy(fp + -56, (word32) s1 + 0x0E, 0x04, out a1_593, out a2_594, out a3_595, out a4_596, out a5_597, out a6_598, out a7_599);
					word32 a4_64;
					word32 a5_65;
					word32 a7_603;
					word32 a2_601;
					word32 a6_602;
					word32 a1_600;
					memcpy(fp + -52, (word32) s1 + 24, 0x04, out a1_600, out a2_601, out a3, out a4_64, out a5_65, out a6_602, out a7_603);
					s4 = (word32) s1 + 8;
					if (a5_65 != 0x00 && a5_65 == a4_64)
					{
						s5_134 = 0x01;
						s6_101 = 0x01;
					}
					else
					{
						s5_134 = 0x00;
						s6_101 = 0x02;
					}
					Eq_2 s1_119;
					Eq_2 s0_118 = dwArg04;
					s1_119 = s1;
					if (fp != ~0x33)
					{
						s1_119 = s1;
						ui32 a5_95;
						word32 a4_604;
						if (ip4_addr_isbroadcast_u32(fp + -52, dwArg04, out a3, out a4_604, out a5_95) == null)
						{
							s0_118 = dwArgA4;
							s1_119 = s1;
							if ((a5_95 & 0x00F0) != 224)
							{
								struct Eq_396401 * a0_111;
								word32 s6_605;
								ra = etharp_find_entry(ra, fp + -56, s6_101, dwArgA4, (word32) s1 + 8, mstatus, s2, dwArgB8, out s0_118, out s1_119, out a0_111, out a3, out s2_120, out s3_130, out s4, out s5_134, out s6_605, out mstatus);
								if (a0_111 >= null)
								{
									a0_111->b4201B0E4 = 0x02;
									a0_111->t4201B0D8 = s0_118;
									word32 a5_609;
									word32 a6_610;
									word32 a7_611;
									word32 a1_606;
									word32 a2_607;
									word32 a4_608;
									memcpy((char *) &a0_111->t4201B0D8 + 4, s4, 0x06, out a1_606, out a2_607, out a3, out a4_608, out a5_609, out a6_610, out a7_611);
									Eq_2 s7_162 = a0_111->t4201B0D0;
									a0_111->w4201B0E2 = 0x00;
									if (s7_162 != 0x00)
									{
										a0_111->t4201B0D0.u0 = 0x00;
										Eq_2 a3_174;
										Eq_2 a4_175;
										Eq_2 s4_181;
										word32 a7_621;
										word32 s6_622;
										word32 s8_623;
										word32 a2_618;
										word32 a4_619;
										word32 a5_620;
										word32 s3_615;
										word32 a0_616;
										word32 a1_617;
										word32 s0_612;
										word32 s1_613;
										word32 s2_614;
										ra = pbuf_free(ethernet_output(ra, s0_118, s7_162, (word32) s0_118 + 58, 0x00FFF800, dwLoc08, dwArg18, dwArg34, dwArgA4, dwArgC0, dwArgC4, dwArgE8, out s0_612, out s1_613, out a3_174, out a4_175, out s2_614, out s3_615, out s4_181), s7_162, a3_174, a4_175, s4_181, mstatus, dwArgE8, out s0_118, out s1_119, out a0_616, out a1_617, out a2_618, out a3, out a4_619, out a5_620, out a7_621, out s2_120, out s3_130, out s4, out s5_134, out s6_622, out s8_623, out mstatus);
									}
								}
							}
						}
					}
					int32 a5_226 = (word32) *((word32) s1_119 + 7) << 8 | (word32) (*((word32) s1_119 + 6));
					a4_227.u0 = 0x0100;
					if (a5_226 != 0x0100)
					{
						a4_227.u0 = 0x0200;
						if (a5_226 != 0x0200)
							s2_120->w002C = (word16) ((word32) s2_120->w002C + 0x01);
						else
							ra = dhcp_arp_reply(ra, s0_118, s0_118, s4, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, out a3, out a4_227, out s3_130, out s4, out mstatus);
					}
					else if (s5_134 != 0x00)
					{
						word32 s7_647;
						word32 s5_645;
						word32 s6_646;
						word32 a0_642;
						word32 a1_643;
						word32 s2_644;
						word32 s0_640;
						word32 s1_641;
						ra = etharp_raw(ra, s0_118, (word32) s0_118 + 58, (word32) s0_118 + 4, mstatus, dwLoc3C, s2, dwLoc0C, dwArg28, dwArg38, s1, dwArg64, dwArg68, dwArg78, dwArg80, dwArg84, dwArg98, dwArgA8, dwArgD8, dwArg0158, out s0_640, out s1_641, out a0_642, out a1_643, out a3, out a4_227, out s2_644, out s3_130, out s4, out s5_645, out s6_646, out s7_647, out mstatus);
					}
l2306E154:
					word32 mstatus_639;
					word32 s5_636;
					word32 s6_637;
					word32 s8_638;
					word32 s2_633;
					word32 s3_634;
					word32 s4_635;
					word32 a4_630;
					word32 a5_631;
					word32 a7_632;
					word32 a1_627;
					word32 a2_628;
					word32 a3_629;
					word32 s0_624;
					word32 s1_625;
					word32 a0_626;
					pbuf_free(ra, s3_130, a3, a4_227, s4, mstatus, dwArgE8, out s0_624, out s1_625, out a0_626, out a1_627, out a2_628, out a3_629, out a4_630, out a5_631, out a7_632, out s2_633, out s3_634, out s4_635, out s5_636, out s6_637, out s8_638, out mstatus_639);
					0x00 = dwArg0198;
					return;
				}
			}
		}
	}
	g_w42026818 = (word16) ((word32) g_w42026818 + 0x01);
	g_w4202680E = (word16) ((word32) g_w4202680E + 0x01);
	goto l2306E154;
}

// 2306E27A: Register Eq_2 etharp_request(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_396614) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_396617 a1Out, Register out Eq_396618 a3Out, Register out Eq_396619 a4Out, Register out ptr32 s2Out, Register out Eq_396621 s3Out, Register out Eq_396622 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_tmr
//      etharp_output_to_arp_index
//      etharp_query
//      netif_issue_reports
Eq_2 etharp_request(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0198, struct Eq_396614 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_396617 & a1Out, union Eq_396618 & a3Out, union Eq_396619 & a4Out, ptr32 & s2Out, union Eq_396621 & s3Out, union Eq_396622 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	ptr32 a0_18;
	Eq_396617 a1_19;
	Eq_396618 a3_21;
	Eq_396619 a4_22;
	ptr32 mstatus_26;
	struct Eq_396614 * s0_28;
	ptr32 s1_29;
	ptr32 s2_30;
	Eq_396621 s3_31;
	Eq_396622 s4_32;
	ptr32 s5_33;
	ptr32 s6_34;
	ptr32 s7_35;
	Eq_2 ra_27 = etharp_raw(ra, s0, (word32) a0 + 58, (word32) a0 + 4, mstatus, dwArg04, dwArg18, dwArg34, dwArg68, dwArg78, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC0, dwArgC4, dwArgD8, dwArgE8, dwArg0118, dwArg0198, out s0_28, out s1_29, out a0_18, out a1_19, out a3_21, out a4_22, out s2_30, out s3_31, out s4_32, out s5_33, out s6_34, out s7_35, out mstatus_26);
	s0Out = s0_28;
	s1Out = s1_29;
	a0Out = a0_18;
	a1Out = a1_19;
	a3Out = a3_21;
	a4Out = a4_22;
	s2Out = s2_30;
	s3Out = s3_31;
	s4Out = s4_32;
	s5Out = s5_33;
	s6Out = s6_34;
	s7Out = s7_35;
	mstatusOut = mstatus_26;
	return ra_27;
}

// 2306E29C: void etharp_tmr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack word32 dwArg0128, Stack Eq_2 dwArg0168)
void etharp_tmr(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, word32 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_396679 * s0_114 = &g_t4201B0B8;
	struct Eq_395664 * s1_112 = null;
	Eq_2 s4_102 = 299;
	uint32 s5_103 = 0x01;
	uint32 s6_104 = 0x03;
	uint32 s2_133 = 0x04;
	word32 s7_134 = 0x02;
	struct Eq_395664 * s3_101 = (struct Eq_395664 *) 0x0A;
	do
	{
		uint32 a4_33 = (word32) s0_114[20];
		if (a4_33 != 0x00)
		{
			uint32 a5_36 = (word32) s0_114[18] + 0x01 << 16;
			s0_114[18] = (struct Eq_396679) (word16) (a5_36 >> 16);
			if (s4_102 >= a5_36 >> 16)
			{
				if (a4_33 == s5_103)
				{
					if (s2_133 < a5_36 >> 16)
						goto l2306E2E8;
					word32 a1_268;
					word32 a4_269;
					ra = etharp_request(ra, *((word32) a0 + 8), a0, mstatus, dwLoc2C, dwLoc18, dwArg04, dwArg38, dwArg48, dwArg68, dwArg74, dwArg78, dwArg88, dwArg90, dwArg94, dwArgA8, dwArgB8, dwArgE8, dwArg0168, out s0_114, out s1_112, out a0, out a1_268, out a3, out a4_269, out s2_133, out s3_101, out s4_102, out s5_103, out s6_104, out s7_134, out mstatus);
				}
				else if (a4_33 == s6_104)
					s0_114[20] = (struct Eq_396679) (byte) s2_133;
				else if (a4_33 == s2_133)
					s0_114[20] = (struct Eq_396679) (byte) s7_134;
			}
			else
			{
l2306E2E8:
				ra = etharp_free_entry(ra, s1_112, a3, s4_102, mstatus, dwArg08, dwArgE8, out s1_112, out a0, out a3, out s2_133, out s3_101, out s4_102, out s5_103, out s6_104, out mstatus);
			}
		}
		s1_112 = (struct Eq_395664 *) &s1_112->b0001;
		s0_114 += 24;
	} while (s1_112 != s3_101);
	0x00 = dwArg0128;
}

// 2306E32C: void etharp_output_to_arp_index(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_396393) a2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0178)
// Called from:
//      etharp_output
void etharp_output_to_arp_index(Eq_2 ra, Eq_2 a0, struct Eq_396393 * a2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE4, Eq_2 dwArgF8, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, Eq_2 dwArg0178)
{
	Eq_2 s2_115 = a0;
	if ((word32) a2->b4201B0E4 == 0x02)
	{
		struct Eq_396804 * s1_100;
		word32 a0_44;
		Eq_396806 a5_31 = (word32) a2->w4201B0E2;
		if (a5_31 > 0x011C)
		{
			word32 s7_223;
			word32 mstatus_224;
			word32 s5_221;
			word32 s6_222;
			word32 s3_219;
			word32 s4_220;
			word32 a3_217;
			word32 a4_218;
			word32 s0_215;
			word32 a1_216;
			ra = etharp_request(ra, (char *) a2 + 1107407068, a0, mstatus, s4, dwLoc08, dwArg14, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA0, dwArgA4, dwArgB8, dwArgC8, dwArgF8, dwArg0178, out s0_215, out s1_100, out a0_44, out a1_216, out a3_217, out a4_218, out s2_115, out s3_219, out s4_220, out s5_221, out s6_222, out s7_223, out mstatus_224);
		}
		else
		{
			if (a5_31 <= 269)
				goto l2306E380;
			word32 s0_232;
			word32 a1_233;
			word32 a3_234;
			word32 a4_235;
			word32 s3_236;
			word32 s4_237;
			word32 s5_238;
			word32 s6_239;
			word32 s7_240;
			word32 mstatus_241;
			ra = etharp_raw(ra, (char *) a2 + 1107407068, (word32) a0 + 58, (word32) a0 + 4, mstatus, s4, dwLoc08, dwArg14, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA0, dwArgA4, dwArgB8, dwArgC8, dwArgF8, dwArg0178, out s0_232, out s1_100, out a0_44, out a1_233, out a3_234, out a4_235, out s2_115, out s3_236, out s4_237, out s5_238, out s6_239, out s7_240, out mstatus_241);
		}
		if (a0_44 == 0x00)
			s1_100->b0014 = 0x03;
	}
l2306E380:
	word32 s0_225;
	word32 s1_226;
	word32 a3_227;
	word32 a4_228;
	word32 s2_229;
	word32 s3_230;
	word32 s4_231;
	ethernet_output(ra, s2_115, dwArg04, dwArg48, 0x00FFF800, dwArg38, dwArg58, dwArg74, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_225, out s1_226, out a3_227, out a4_228, out s2_229, out s3_230, out s4_231);
}

// 2306E3C8: Register Eq_2 etharp_query(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_391733 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_check
//      etharp_output
Eq_2 etharp_query(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_391733 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s1_113;
	Eq_2 s2_12 = a0;
	word32 a5_593;
	word32 a4_592;
	Eq_2 a3_112;
	if (ip4_addr_isbroadcast_u32(*a1, a0, out a3_112, out a4_592, out a5_593) == null)
	{
		Eq_2 a5_29 = *a1;
		a3_112 = a5_29 & 0x00F0;
		if ((a5_29 & 0x00F0) != 224 && a5_29 != 0x00)
		{
			int32 a0_37;
			Eq_2 s4_144;
			Eq_2 s0_118;
			ra = etharp_find_entry(ra, a1, 0x01, a0, a1, mstatus, dwLoc08, dwArgD8, out s0_118, out s1_113, out a0_37, out a3_112, out s2_12, out s3, out s4_144, out s5, out s6, out mstatus);
			if (a0_37 < 0x00)
			{
				if (s0_118 != 0x00)
					g_w42026814 = (word16) ((word32) g_w42026814 + 0x01);
				goto l2306E422;
			}
			struct Eq_396945 * a4_65 = (a0_37 & 0x00FF) + 0x18;
			s3 = a0_37 & 0x00FF;
			s1_113.u0 = 0x4201B0B8;
			if ((word32) a4_65->b4201B0CC != 0x00)
			{
				if (s0_118 != 0x00)
					goto l2306E45E;
			}
			else
			{
				a4_65->b4201B0CC = 0x01;
				a4_65->t4201B0C0 = s2_12;
			}
			word32 a4_596;
			word32 a0_594;
			word32 a1_595;
			ra = etharp_request(ra, s0_118, s2_12, mstatus, s4, dwLoc08, dwArg14, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA0, dwArgA4, dwArgB8, dwArgC8, dwArgF8, dwArg0178, out s0_118, out s1_113, out a0_594, out a1_595, out a3_112, out a4_596, out s2_12, out s3, out s4_144, out s5, out s6, out s7, out mstatus);
			if (s0_118 == 0x00)
				goto l2306E422;
l2306E45E:
			a3_112 = (word32) s3.u0 + 24;
			word32 a4_116 = CONVERT(Mem115[s1_113 + a3_112 + 20:byte], byte, word32);
			if (a4_116 > 0x01)
			{
				g_b4200F5F8 = (byte) s3;
				Eq_2 a2_232 = (word32) s2_12 + 58;
				Eq_2 a3_243;
				Eq_2 s0_246;
				Eq_2 s1_247;
				Eq_2 s2_248;
				Eq_391733 s3_249;
				ptr32 s4_250;
				word32 a4_597;
				Eq_2 ra_256 = ethernet_output(ra, s2_12, s0_118, a2_232, 0x00FFF800, dwArg38, dwArg58, dwArg74, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_246, out s1_247, out a3_243, out a4_597, out s2_248, out s3_249, out s4_250);
				s0Out = s0_246;
				s1Out = s1_247;
				a3Out = a3_243;
				s2Out = s2_248;
				s3Out = s3_249;
				s4Out = s4_250;
				s5Out = s5;
				s6Out = s6;
				s7Out = s7;
				mstatusOut = mstatus;
				return ra_256;
			}
			if (a4_116 == 0x01)
			{
				Eq_2 a5_119 = s0_118;
				do
				{
					Eq_2 a4_135;
					Eq_2 a0_155;
					ui32 a4_122 = (word32) *((word32) a5_119 + 0x0C);
					if ((a4_122 & 64) != 0x00)
					{
						ra = pbuf_clone(ra, s0_118, 0x008E, 640, s0_118, a3_112, a4_122 & 64, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s1_113, out a0_155, out a3_112, out a4_135, out s2_12, out s3, out s4_144, out s5, out s6, out mstatus);
						s0_118 = a0_155;
						if (a0_155 != 0x00)
							goto l2306E4C4;
						g_w42026814 = (word16) ((word32) g_w42026814 + 0x01);
						goto l2306E422;
					}
					a5_119 = *a5_119;
				} while (a5_119 != 0x00);
				word32 a5_598;
				a0_155 = pbuf_ref(s0_118, a3_112, a4_122 & 64, mstatus, out a3_112, out a4_135, out a5_598);
l2306E4C4:
				if (a0_155 != 0x00)
				{
					word32 s8_606;
					word32 s4_605;
					word32 a7_604;
					word32 a5_603;
					word32 a4_602;
					word32 a2_601;
					word32 a1_600;
					word32 a0_599;
					ra = pbuf_free(ra, a0_155, a3_112, a4_135, s4_144, mstatus, dwArg0108, out s0_118, out s1_113, out a0_599, out a1_600, out a2_601, out a3_112, out a4_602, out a5_603, out a7_604, out s2_12, out s3, out s4_605, out s5, out s6, out s8_606, out mstatus);
				}
				s1_113 = (byte) s1_113.u0 + ((word32) s3.u0 + 24);
				*s0_118 = s1_113;
			}
l2306E422:
			s0Out = s1;
			s1Out = s1_113;
			a3Out = a3_112;
			s2Out = s2_12;
			s3Out = s3;
			s4Out = dwArg04;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s1_113 = s1;
	goto l2306E422;
}

// 2306E50E: void etharp_output(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0158)
void etharp_output(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0158)
{
	union Eq_2 * a5_22;
	word32 a4_477;
	word32 a3_476;
	struct Eq_396393 * a0_19 = ip4_addr_isbroadcast_u32(a0, a0, out a3_476, out a4_477, out a5_22);
	if (a0_19 == null)
	{
		Eq_2 s1_229 = *a5_22;
		if ((a5_22 & 0x00F0) != 224)
		{
			Eq_2 s0_30 = (a5_22 & 0x00F0)->t0008;
			struct Eq_396393 * a4_31 = a0_19;
			if (((a5_22 ^ 224) & (a5_22 & 0x00F0)) != 0x00)
			{
				struct Eq_397235 * a5_36 = (word32) (word16) a5_22;
				if (a5_36 != (struct Eq_397235 *) 0x0FFFFEA9)
				{
					s0_30 = a5_36->t000C;
					if (a5_36 == null)
						return;
					s1_229 = (word32) s0_30 + 0x0C;
				}
			}
			struct Eq_396393 * a2_136 = (word32) g_b4200F5F8;
			struct Eq_397227 * a5_49 = &g_t4201B0B8;
			if ((word32) a2_136->b4201B0E4 > 0x01)
			{
				Eq_2 a3_53 = *(union Eq_2 *) 0x09;
				if (s0_30 == 0x01)
				{
					s1_229 = *(union Eq_2 *) 0x01;
					if (*((word32) a3_53 + 4) == 0x01)
					{
						g_w4202681E = (word16) ((word32) g_w4202681E + 0x01);
l2306E5E6:
						etharp_output_to_arp_index(ra, s0_30, a2_136, s4, mstatus, dwLoc1C, dwLoc0C, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg64, s1, dwArg78, dwArg80, dwArg84, dwArg98, dwArgA8, dwArgC4, dwArgD8, dwArgE0, dwArgE4, dwArg0108, dwArg0158);
						return;
					}
				}
			}
			do
			{
				Eq_2 a0_61 = (word32) a5_49->b0014;
				if (a0_61 > 0x01)
				{
					a5_49 = (struct Eq_397227 *) *((word32) a0_61 + 8);
					if (a0_61 == s0_30)
					{
						a5_49 = (struct Eq_397227 *) *((word32) a0_61 + 4);
						if (*s1_229 == a0_61)
						{
							g_b4200F5F8 = (byte) a4_31;
							a2_136 = a4_31;
							goto l2306E5E6;
						}
					}
				}
				ui32 a4_70 = (char *) a4_31 + 1;
				a4_31 = a4_70 & 0x00FF;
				++a5_49;
			} while ((a4_70 & 0x00FF) != 0x0A);
			word32 s0_485;
			word32 s1_486;
			word32 a3_487;
			word32 s4_490;
			word32 s5_491;
			word32 s3_489;
			word32 s6_492;
			word32 s2_488;
			word32 s7_493;
			word32 mstatus_494;
			etharp_query(ra, s0_30, s1_229, s4, mstatus, dwLoc0C, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg64, s1, dwArg78, dwArg80, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE0, dwArgE4, dwArgE8, dwArg0108, dwArg0158, out s0_485, out s1_486, out a3_487, out s2_488, out s3_489, out s4_490, out s5_491, out s6_492, out s7_493, out mstatus_494);
			return;
		}
	}
	word32 s1_479;
	word32 s0_478;
	word32 a4_481;
	word32 a3_480;
	word32 s4_484;
	word32 s3_483;
	word32 s2_482;
	ethernet_output(ra, a0, a1, (word32) a0 + 58, 0x00FFF800, dwArg18, dwArg38, dwArg54, dwArgC4, dwArgE0, dwArgE4, dwArg0108, out s0_478, out s1_479, out a3_480, out a4_481, out s2_482, out s3_483, out s4_484);
}

