pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
struct Eq_126409 * g_ptr2306E522 = &g_t619000EF;
// 2306E640: Register Eq_2 igmp_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_397343 a3Out, Register out (ptr32 Eq_397344) a4Out, Register out (ptr32 Eq_397345) a5Out, Register out (ptr32 Eq_397346) s2Out, Register out (ptr32 Eq_397347) s3Out, Register out (ptr32 Eq_397348) s4Out, Register out Eq_2 s5Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      igmp_joingroup_netif
//      igmp_leavegroup_netif
//      igmp_tmr
Eq_2 igmp_send(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_397343 & a3Out, struct Eq_397344 & a4Out, struct Eq_397345 & a5Out, struct Eq_397346 & s2Out, struct Eq_397347 & s3Out, struct Eq_397348 & s4Out, union Eq_2 & s5Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	struct Eq_397345 * a5_166;
	struct Eq_397353 * s1_41;
	Eq_2 s4_48;
	Eq_2 s6_54;
	word32 a1_271;
	word32 a3_272;
	word32 a5_273;
	word32 a7_274;
	word32 s8_275;
	struct Eq_397347 * s3_169;
	Eq_2 s5_173;
	Eq_2 s0_160;
	struct Eq_397346 * s2_168;
	ptr32 mstatus_181;
	ptr32 a2_159;
	struct Eq_397344 * a4_165;
	Eq_2 a0_158;
	Eq_2 ra_52 = pbuf_alloc(ra, s0, 0x42026000, 0x00B6, 0x08, 640, a3, a4, mstatus, dwLoc4C, dwLoc0C, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_160, out s1_41, out a0_158, out a1_271, out a2_159, out a3_272, out a4_165, out a5_273, out a7_274, out s2_168, out s3_169, out s4_48, out s5_173, out s6_54, out s8_275, out mstatus_181);
	if (a0_158 != 0x00)
	{
		Eq_397408 a5_68 = s3_169->t0004;
		if (s5_173 == 22)
		{
			*((word32) s0_160 + 7) = (byte) (a5_68 >> 24);
			*((word32) s0_160 + 4) = (byte) (a5_68 & 0x00FF);
			*((word32) s0_160 + 5) = (byte) (a5_68 >> 0x08);
			*((word32) s0_160 + 6) = (byte) (a5_68 >> 0x10);
			s3_169->b0008 = 0x01;
		}
		else
		{
			*((word32) s0_160 + 4) = (byte) (a5_68 & 0x00FF);
			*((word32) s0_160 + 5) = (byte) (a5_68 >> 0x08);
			*((word32) s0_160 + 6) = (byte) (a5_68 >> 0x10);
			*((word32) s0_160 + 7) = (byte) (a5_68 >> 24);
		}
		*s0_160 = (byte) s5_173;
		*((word32) s0_160 + 1) = 0x00;
		*((word32) s0_160 + 2) = 0x00;
		*((word32) s0_160 + 3) = 0x00;
		Eq_2 a2_101;
		word32 a3_276;
		word32 a4_277;
		word32 a5_278;
		Eq_2 a0_99 = inet_chksum(s0_160, 0x08, a5_68 >> 0x10, out a2_101, out a3_276, out a4_277, out a5_278);
		*((word32) s0_160 + 2) = (byte) a0_99;
		*((word32) s0_160 + 3) = (byte) (a0_99 >> 8);
		s1_41->w0850 = (word16) ((word32) s1_41->w0850 + 0x01);
		Eq_2 a3_133;
		Eq_2 a4_134;
		Eq_2 s2_141;
		Eq_2 s4_143;
		word32 s0_279;
		word32 s1_280;
		word32 a0_281;
		word32 a1_282;
		word32 a5_283;
		word32 a7_284;
		word32 s3_285;
		word32 s5_286;
		word32 s6_287;
		word32 s8_288;
		word32 s9_289;
		word32 s1_290;
		word32 a1_291;
		word32 a3_292;
		word32 a7_293;
		word32 s4_294;
		word32 s6_295;
		word32 s8_296;
		pbuf_free(ip4_output_if_opt(ra_52, s0_160, (char *) s1_41 + 2032, a0_158, fp + -40, a2_101, 0x01, 0x00, 0x02, s4_48, fp + -36, s4_48, s5_173, s6_54, s7, 0x04, out s0_279, out s1_280, out a0_281, out a1_282, out a3_133, out a4_134, out a5_283, out a7_284, out s2_141, out s3_285, out s4_143, out s5_286, out s6_287, out s7, out s8_288, out s9_289), s2_141, a3_133, a4_134, s4_143, mstatus_181, dwArgD8, out s0_160, out s1_290, out a0_158, out a1_291, out a2_159, out a3_292, out a4_165, out a5_166, out a7_293, out s2_168, out s3_169, out s4_294, out s5_173, out s6_295, out s8_296, out mstatus_181);
	}
	else
	{
		word32 a5_61 = (word32) s1_41->w085A;
		s1_41->w085A = (word16) (a5_61 + 0x01);
		a5_166 = a5_61 + 0x01;
	}
	s0Out = s0_160;
	s1Out = dwLoc4C;
	a0Out = a0_158;
	a2Out = a2_159;
	a3Out = s2;
	a4Out = a4_165;
	a5Out = a5_166;
	s2Out = s2_168;
	s3Out = s3_169;
	s4Out = dwArg0168;
	s5Out = s5_173;
	s7Out = s7;
	mstatusOut = mstatus_181;
	return dwLoc08;
}

// 2306E740: Register Eq_2 igmp_delaying_member(Register Eq_2 a0, Register Eq_397619 a1, Register (ptr32 Eq_64398) a2, Register out Eq_397619 a1Out, Register out (ptr32 Eq_64398) a2Out, Register out Eq_397623 a3Out, Register out Eq_397624 a4Out, Register out Eq_397619 a5Out, Register out ptr32 s4Out)
// Called from:
//      igmp_input
//      netif_issue_reports
Eq_2 igmp_delaying_member(Eq_2 a0, Eq_397619 a1, struct Eq_64398 * a2, union Eq_397619 & a1Out, struct Eq_64398 & a2Out, union Eq_397623 & a3Out, union Eq_397624 & a4Out, union Eq_397619 & a5Out, ptr32 & s4Out)
{
	Eq_397619 a5_5 = (word32) *((word32) a0 + 9);
	Eq_397624 a4_31 = 0x02;
	if (a5_5 != 0x02)
	{
		a4_31.u0 = 0x01;
		if (a5_5 != 0x01)
		{
l2306E792:
			a1Out = a1;
			a2Out = a2;
			a3Out = a3;
			a4Out.u0 = 0x01;
			a5Out = a5_5;
			s4Out = s4;
			return s1;
		}
		a5_5 = (word32) *((word32) a0 + 0x0A);
		if (a5_5 != 0x00 && a1 >= a5_5)
			goto l2306E792;
	}
	Eq_2 s1_25 = a0;
	if (a1 > 0x02)
	{
		ui32 a0_28;
		word32 s8_124;
		word32 a5_123;
		word32 a2_122;
		s1_25 = bl_rand(a0, a2, out a0_28, out a1, out a2_122, out a3, out a4_31, out a5_123, out s4, out s8_124);
		ui32 s0_39 = a0_28 & a1;
		*((word32) s1_25 + 0x0A) = (word16) s0_39;
		if (s0_39 != 0x00)
			goto l2306E772;
	}
	*((word32) s1_25 + 0x0A) = 0x01;
l2306E772:
	*((word32) s1_25 + 9) = 0x01;
	a1Out = a1;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4_31;
	a5Out.u0 = 0x01;
	s4Out = s4;
	return s1_25;
}

// 2306E794: Register word32 igmp_init(Register out ptr32 a5Out)
// Called from:
//      lwip_init
word32 igmp_init(ptr32 & a5Out)
{
	g_t4200F600.u0 = 0x010000E0;
	g_dw4200F5FC = 0x020000E0;
	a5Out = 0x020000E0;
	return 0x4200F000;
}

// 2306E7B6: Register Eq_2 igmp_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_397697) a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out Eq_2 a3Out)
// Called from:
//      netif_remove
Eq_2 igmp_stop(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, struct Eq_397697 * a5, ptr32 mstatus, Eq_2 dwArg38, union Eq_2 & a3Out)
{
	((word32) *((word32) s0 + 44) + 44)->u0 = 0x00;
	while (s0 != 0x00)
	{
		word32 s1_18 = a5->dw0048;
		Eq_2 s2_19 = *s0;
		if (a5 != null)
		{
			word32 a5_33;
			a5();
		}
		word32 a2_89;
		word32 a0_88;
		memp_free(0x0A, s0, a3, a4, mstatus, out a0_88, out a2_89, out a3, out a4, out a5);
		s0 = s2_19;
	}
	0x00 = (int8) dwArg38;
	a3Out = a3;
	return ra;
}

