pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306EB3A: Register Eq_2 igmp_leavegroup_netif(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Register out Eq_2 s1Out, Register out Eq_398555 a0Out, Register out Eq_2 a4Out, Register out Eq_398555 a5Out, Register out ptr32 s2Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      igmp_leavegroup
Eq_2 igmp_leavegroup_netif(Eq_2 ra, Eq_2 a0, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, union Eq_2 & s1Out, union Eq_398555 & a0Out, union Eq_2 & a4Out, union Eq_398555 & a5Out, ptr32 & s2Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	ptr32 a1_5 = *a4;
	if ((a4 & 0x00F0) == 224)
	{
		Eq_2 a3_10 = g_t4200F600;
		Eq_398555 a5_11 = ~0x05;
		if (a4 != a3_10)
		{
			ui32 a4_24 = (word32) *((word32) a0 + 65);
			Eq_2 s1_153 = a0;
			Eq_2 a4_106 = a4_24 & 32;
			if ((a4_24 & 32) != 0x00)
			{
				Eq_2 a0_28 = igmp_lookfor_group(a0, a4_24 & 32, ~0x05);
				s2 = a1_5;
				Eq_2 s0_109 = a0_28;
				a5_11.u0 = ~0x05;
				if (a0_28 != 0x00)
				{
					up32 a5_32 = (word32) *((word32) a0_28 + 0x0C);
					a4_106.u0 = 0x01;
					if (a5_32 <= 0x01)
					{
						while (a5_32 != 0x00)
						{
							Eq_2 a5_40 = *(union Eq_2 *) 0x01;
							if (a0_28 == 0x01)
							{
								s0_109 = *(union Eq_2 *) 0x01;
								*(union Eq_2 *) 0x01 = a5_40;
								break;
							}
							a5_32 = 0x01;
						}
						struct Eq_398615 * a5_47 = (word32) *((word32) s0_109 + 8);
						if (a5_47 != null)
						{
							word32 a4_50 = (word32) g_w42026868;
							g_w42026868 = (word16) (a4_50 + 0x01);
							word32 s4_415;
							word32 a2_413;
							word32 s3_414;
							word32 a0_412;
							word32 s1_411;
							word32 s5_416;
							ra = igmp_send(ra, s0_109, a3_10, a4_50 + 0x01, s7, mstatus, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out s0_109, out s1_411, out a0_412, out a2_413, out a3_10, out a4_106, out a5_47, out s2, out s3_414, out s4_415, out s5_416, out s7, out mstatus);
						}
						word32 s1_99 = a5_47->dw0048;
						if (a5_47 != null)
						{
							word32 tp_124;
							word32 a6_127;
							word32 a7_128;
							word32 s3_129;
							word32 s4_130;
							word32 s5_131;
							word32 s6_132;
							word32 s8_133;
							word32 t0_134;
							word32 t1_135;
							word32 t3_136;
							word32 t4_137;
							word32 t5_138;
							word32 t6_139;
							word32 s9_140;
							a5_47();
						}
						word32 a5_420;
						word32 a3_419;
						word32 a0_417;
						word32 a2_418;
						s1_153 = memp_free(0x0A, s0_109, a3_10, a4_106, mstatus, out a0_417, out a2_418, out a3_419, out a4_106, out a5_420);
					}
					else
						*((word32) a0_28 + 0x0C) = (byte) (a5_32 + ~0x00);
					a5_11.u0 = 0x00;
				}
			}
			0x00 = (int8) dwArg38;
			s1Out = s1_153;
			a0Out = a5_11;
			a4Out = a4_106;
			a5Out = a5_11;
			s2Out = s2;
			s7Out = s7;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s1Out = s1;
	a0Out.u0 = ~0x05;
	a4Out = a4;
	a5Out.u0 = ~0x05;
	s2Out = s2;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

// 2306EBE8: Register Eq_2 igmp_leavegroup(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_2) a0, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Register out (ptr32 Eq_398714) a0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_join_leave_group
Eq_2 igmp_leavegroup(Eq_2 ra, Eq_2 s1, union Eq_2 * a0, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, struct Eq_398714 & a0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 a4_16 = 224;
	struct Eq_398714 * s1_17 = (struct Eq_398714 *) ~0x05;
	if ((a5 & 0x00F0) == 224)
	{
		a4_16 = g_t4200F600;
		s1_17 = (struct Eq_398714 *) ~0x05;
		if (a5 != a4_16)
		{
			a5.u0 = 0x42026000;
			s0 = g_t420267E8;
			union Eq_2 * s2_26 = a0;
			while (s0 != 0x00)
			{
				ui32 a5_29 = (word32) *((word32) s0 + 65);
				a5 = a5_29 & 32;
				if ((a5_29 & 32) != 0x00)
				{
					if (s2_26 != null)
					{
						a5 = *s2_26;
						if (a5 == 0x00)
							goto l2306EC4A;
						s0 = *((word32) a4_16 + 4);
						if (a5 == a4_16)
							goto l2306EC4A;
					}
					else
					{
l2306EC4A:
						struct Eq_398714 * a0_50;
						ra = igmp_leavegroup_netif(ra, s0, a4_16, s7, mstatus, dwArg18, dwArg28, dwArg38, dwArg58, s1, dwArg78, dwArg98, dwArgA8, dwArgD8, out s1_17, out a0_50, out a4_16, out a5, out s2_26, out s7, out mstatus);
						if (s1_17 != null)
							s1_17 = a0_50;
					}
				}
				s0 = *s0;
			}
		}
	}
	a0Out = s1_17;
	a4Out = a4_16;
	a5Out = a5;
	mstatusOut = mstatus;
	return s0;
}

// 2306EC5A: void igmp_tmr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8)
void igmp_tmr(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8)
{
	Eq_2 s1_25 = g_t420267E8;
	word32 s3_21 = 0x01;
	struct Eq_398792 * s4_102 = &g_t4200F000;
	word32 s5_104 = 0x02;
	struct Eq_398796 * s2_106 = &g_t420267F0;
	while (s1_25 != 0x00)
	{
		Eq_2 s1_108 = *((word32) s0 + 44);
		while (s0 != 0x00)
		{
			word32 a5_31 = (word32) *((word32) s0 + 0x0A);
			if (a5_31 != 0x00)
			{
				uint32 a5_33 = a5_31 + ~0x00 << 16;
				((word32) s0 + 0x0A)->u2 = (word16) (a5_33 >> 16);
				if (a5_33 >> 16 == 0x00 && (word32) (*((word32) s0 + 9)) == s3_21)
				{
					s0 = *((word32) a4 + 4);
					if (a4 != s4_102->t0600)
					{
						*((word32) s0 + 9) = (byte) s5_104;
						s2_106->w007A = (word16) ((word32) s2_106->w007A + 0x01);
						word32 a0_217;
						word32 a2_218;
						word32 a5_219;
						ra = igmp_send(ra, s0, a3, a4, s7, mstatus, dwArg38, dwArg48, s1, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0, out s1_108, out a0_217, out a2_218, out a3, out a4, out a5_219, out s2_106, out s3_21, out s4_102, out s5_104, out s7, out mstatus);
					}
				}
			}
			s0 = *s0;
		}
		s1_25 = *s1_108;
	}
}

// 2306ECDE: Register Eq_2 ip4_input_accept(Register Eq_2 a0, Register Eq_2 a4, Register out Eq_398879 a3Out, Register out Eq_2 a4Out)
// Called from:
//      ip4_input
Eq_2 ip4_input_accept(Eq_2 a0, Eq_2 a4, union Eq_398879 & a3Out, union Eq_2 & a4Out)
{
	if (((word32) *((word32) a0 + 65) & 0x01) == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		return 0x00;
	}
	else
	{
		Eq_2 a0_9 = *((word32) a4 + 4);
		Eq_2 a0_11 = 0x00;
		if (a4 != 0x00)
		{
			Eq_2 a5_13 = g_t4202692C;
			a0_11.u0 = 0x01;
			if (a4 != a5_13)
			{
				Eq_398879 a3_20;
				Eq_2 a4_21;
				word32 a5_48;
				Eq_2 a0_25 = (word32) (ip4_addr_isbroadcast_u32(a5_13, a0_9, out a3_20, out a4_21, out a5_48) != null);
				a3Out = a3_20;
				a4Out = a4_21;
				return a0_25;
			}
		}
		a3Out = a3;
		a4Out = a4;
		return a0_11;
	}
}

// 2306ED14: Register Eq_2 ip4_route(Register Eq_2 a2, Register Eq_2 a5, Register out Eq_2 a2Out, Register out (ptr32 Eq_398920) a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      raw_send
//      tcp_input
//      tcp_output_control_segment
//      tcp_output
//      udp_sendto
//      icmp_dest_unreach
//      altcp_tcp_connect
Eq_2 ip4_route(Eq_2 a2, Eq_2 a5, union Eq_2 & a2Out, struct Eq_398920 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a4_24;
	Eq_2 a0_12;
	struct Eq_398920 * a3_15 = a5 & 0x00F0;
	if ((a5 & 0x00F0) == 224)
	{
		a4_24.u0 = 0x4200F000;
		a0_12 = g_t4200F604;
		if (a0_12 != 0x00)
			goto l2306ED9E;
	}
	a0_12 = g_t420267E8;
	while (a0_12 != 0x00)
	{
		a3_15 = (word32) *((word32) a0_12 + 65);
		if ((a3_15 & 1) != 0x00)
		{
			struct Eq_398989 * a4_18 = a3_15 >> 0x02 & 0x01;
			if (a4_18 != null)
			{
				a0_12 = a4_18->t0004;
				if (a4_18 != null)
				{
					a0_12 = *((byte) a2.u0 + 8);
					a4_24 = (a4_18 ^ a5) & a2;
					if (a4_24 == 0x00)
						goto l2306ED9E;
					a3_15 &= 0x02;
					if ((a3_15 & 0x02) == 0x00)
					{
						a0_12 = *((byte) a4_24.u0 + 0x0C);
						if (a5 == a4_24)
							goto l2306ED9E;
					}
				}
			}
		}
		a0_12 = *a0_12;
	}
	Eq_2 a4_31 = g_t420267E4;
	if (a4_31 != 0x00)
	{
		ui32 a3_32 = (word32) *((word32) a4_31 + 65);
		a2.u0 = 0x05;
		a3_15 = a3_32 & 0x05;
		if ((a3_32 & 0x05) != 0x05)
			goto l2306ED5C;
		a4_24 = (a3_32 & 0x05)->t0004;
		if ((a3_32 & 0x05) != 0x00)
		{
			a5 &= 0x00FF;
			a3_15 = (struct Eq_398920 *) 0x007F;
			if ((a5 & 0x00FF) == 0x007F)
				goto l2306ED5C;
			a0_12 = a4_24;
l2306ED9E:
			a2Out = a2;
			a3Out = a3_15;
			a4Out = a4_24;
			a5Out = a5;
			return a0_12;
		}
	}
l2306ED5C:
	word32 a4_42 = (word32) g_w4202682E;
	g_w4202682E = (word16) (a4_42 + 0x01);
	a2Out = a2;
	a3Out = a3_15;
	a4Out = a4_42 + 0x01;
	a5Out.u0 = 0x420267F0;
	return a0_12;
}

// 2306EDA0: void ip4_input(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack word32 dwArg9C, Stack Eq_2 dwArgA8, Stack word32 dwArgB4, Stack Eq_2 dwArgB8, Stack word32 dwArgBC, Stack Eq_2 dwArgC8, Stack word32 dwArgD0, Stack word32 dwArgD4, Stack Eq_2 dwArgD8, Stack word32 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack word32 dwArg0178)
// Called from:
//      ethernet_input
void ip4_input(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s8, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, word32 dwArg9C, Eq_2 dwArgA8, word32 dwArgB4, Eq_2 dwArgB8, word32 dwArgBC, Eq_2 dwArgC8, word32 dwArgD0, word32 dwArgD4, Eq_2 dwArgD8, word32 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, word32 dwArg0178)
{
	g_w42026822 = (word16) ((word32) g_w42026822 + 0x01);
	Eq_2 s3_30 = *((word32) a0 + 4);
	uint32 s6_32 = (word32) *s3_30;
	Eq_2 a4_33 = s6_32 >> 0x04;
	if (s6_32 >> 0x04 != 0x04)
	{
		struct Eq_399119 * s1_749;
		word32 a2_1496;
		word32 a3_1497;
		word32 a4_1498;
		word32 a1_1495;
		word32 a5_1499;
		word32 s4_1503;
		word32 a0_1494;
		word32 s0_1493;
		word32 mstatus_1507;
		word32 s8_1506;
		word32 s6_1505;
		word32 s5_1504;
		word32 s3_1502;
		word32 s2_1501;
		word32 a7_1500;
		pbuf_free(ra, a0, a3, s6_32 >> 0x04, s4, mstatus, dwArgF8, out s0_1493, out s1_749, out a0_1494, out a1_1495, out a2_1496, out a3_1497, out a4_1498, out a5_1499, out a7_1500, out s2_1501, out s3_1502, out s4_1503, out s5_1504, out s6_1505, out s8_1506, out mstatus_1507);
		s1_749->w0044 = (word16) ((word32) s1_749->w0044 + 0x01);
		s1_749->w0036 = (word16) ((word32) s1_749->w0036 + 0x01);
		goto l2306EDF2;
	}
	Eq_2 ra_244;
	int32 s6_169 = (s6_32 & 0x0F) << 2;
	word32 a5_1492;
	Eq_2 a0_41 = lwip_htons((word32) *((word32) s3_30 + 2) | (word32) (*((word32) s3_30 + 3)) << 8, out a5_1492);
	Eq_2 s2_35 = a0;
	Eq_2 s4_122 = a1;
	Eq_2 s1_48 = (word32) (word16) s6_169;
	Eq_2 s5_49 = a0_41;
	ra_244 = ra;
	if (a0_41 < (word32) (*((word32) a0 + 8)))
	{
		word32 s8_1510;
		word32 a5_1509;
		word32 a2_1508;
		ra_244 = pbuf_realloc(ra, 0x420267F0, a0, a0_41, a3, s6_32 >> 0x04, a0, s3_30, a1, mstatus, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_48, out a2_1508, out a3, out a4_33, out a5_1509, out s2_35, out s3_30, out s4_122, out s5_49, out s6_169, out s8_1510, out mstatus);
	}
	struct Eq_399174 * s0_567;
	if ((word32) *((word32) s2_35 + 0x0A) < s1_48 || ((word32) (*((word32) s2_35 + 8)) < s5_49 || s1_48 <= 0x13))
	{
		word32 a0_1512;
		word32 a1_1513;
		word32 a2_1514;
		word32 a3_1515;
		word32 s1_1511;
		word32 a4_1516;
		word32 a5_1517;
		word32 a7_1518;
		word32 s4_1521;
		word32 s5_1522;
		word32 s6_1523;
		word32 s2_1519;
		word32 s3_1520;
		word32 s8_1524;
		word32 mstatus_1525;
		pbuf_free(ra_244, s2_35, a3, a4_33, s4_122, mstatus, dwArgF8, out s0_567, out s1_1511, out a0_1512, out a1_1513, out a2_1514, out a3_1515, out a4_1516, out a5_1517, out a7_1518, out s2_1519, out s3_1520, out s4_1521, out s5_1522, out s6_1523, out s8_1524, out mstatus_1525);
		s0_567->w003A = (word16) ((word32) s0_567->w003A + 0x01);
		goto l2306EE68;
	}
	Eq_2 a3_92;
	Eq_2 a4_93;
	word32 a5_1527;
	word32 a2_1526;
	Eq_2 a0_124 = inet_chksum(s3_30, s1_48, a4_33, out a2_1526, out a3_92, out a4_93, out a5_1527);
	if (a0_124 != 0x00)
	{
		word32 a2_1531;
		word32 a5_1534;
		word32 a0_1529;
		word32 a1_1530;
		word32 s1_1528;
		word32 a7_1535;
		word32 a3_1532;
		word32 mstatus_1542;
		word32 s4_1538;
		word32 s3_1537;
		word32 s5_1539;
		word32 s6_1540;
		word32 s8_1541;
		word32 s2_1536;
		word32 a4_1533;
		pbuf_free(ra_244, s2_35, a3_92, a4_93, s4_122, mstatus, dwArgF8, out s0_567, out s1_1528, out a0_1529, out a1_1530, out a2_1531, out a3_1532, out a4_1533, out a5_1534, out a7_1535, out s2_1536, out s3_1537, out s4_1538, out s5_1539, out s6_1540, out s8_1541, out mstatus_1542);
		s0_567->w0038 = (word16) ((word32) s0_567->w0038 + 0x01);
		goto l2306EE68;
	}
	Eq_2 s5_133;
	struct Eq_399264 * a5_107 = (word32) *((word32) s3_30 + 19) << 24 | (((word32) (*((word32) s3_30 + 0x0011)) << 8 | (word32) (*((word32) s3_30 + 16))) | (word32) (*((word32) s3_30 + 18)) << 16);
	a5_107->dw0014 = 0x42026918;
	Eq_2 a3_116 = (word32) *((word32) s3_30 + 0x0D) << 8 | (word32) (*((word32) s3_30 + 0x0C)) | (word32) (*((word32) s3_30 + 0x0E)) << 16;
	((word32) *((word32) s3_30 + 0x0F) << 24 | a3_116)->dw0010 = 0x42026918;
	struct Eq_399324 * s1_102 = &g_t42026918;
	Eq_2 a4_121 = 224;
	if ((a5_107 & 0x00F0) == 224)
	{
		ui32 a5_148 = (word32) *((word32) s4_122 + 65);
		if ((a5_148 & 32) == 0x00)
			goto l2306EEEE;
		a0_124 = igmp_lookfor_group(s4_122, 224, a5_148 & 32);
		if (a0_124 != 0x00)
		{
			s1_102 = *(struct Eq_399324 **) 0x00F0;
			if (a3_116 == 0x010000E0)
			{
				s5_133 = s4_122;
				if (false)
				{
l2306EF42:
					ui32 a4_213 = (word32) *((word32) s3_30 + 7);
					if (((word32) *((word32) s3_30 + 6) & 63 | a4_213 << 8) != 0x00)
					{
						word32 s1_1558;
						word32 a5_1564;
						word32 a0_1559;
						word32 a1_1560;
						word32 a2_1561;
						word32 a3_1562;
						word32 a7_1565;
						word32 a4_1563;
						word32 s2_1566;
						word32 s4_1568;
						word32 s3_1567;
						word32 s6_1570;
						word32 mstatus_1572;
						word32 s8_1571;
						word32 s5_1569;
						pbuf_free(ra_244, s2_35, a3_116, a4_213 << 8, s4_122, mstatus, dwArgF8, out s0_567, out s1_1558, out a0_1559, out a1_1560, out a2_1561, out a3_1562, out a4_1563, out a5_1564, out a7_1565, out s2_1566, out s3_1567, out s4_1568, out s5_1569, out s6_1570, out s8_1571, out mstatus_1572);
						s0_567->w0042 = (word16) ((word32) s0_567->w0042 + 0x01);
l2306EE68:
						s0_567->w0036 = (word16) ((word32) s0_567->w0036 + 0x01);
						goto l2306EDF2;
					}
					s1_102->t0000 = s5_133;
					s1_102->t0004 = s4_122;
					s1_102->t0008 = s3_30;
					s1_102->w000C = (word16) (((word32) *s3_30 & 0x0F) << 2);
					Eq_2 a0_261;
					Eq_2 a2_263;
					Eq_2 s3_271;
					Eq_2 s5_273;
					Eq_2 s6_274;
					Eq_2 s8_276;
					Eq_2 s0_268;
					Eq_2 s2_270;
					Eq_2 s4_272;
					Eq_2 s1_269;
					Eq_2 ra_279 = raw_input(ra_244, s2_35, s4_122, dwArgF8, out s0_268, out s1_269, out a0_261, out a2_263, out s2_270, out s3_271, out s4_272, out s5_273, out s6_274, out s8_276);
					if (a0_261 != s8_276)
					{
						word32 a5_1575;
						word32 a1_1573;
						word32 a4_1574;
						Eq_2 a3_286;
						Eq_2 a0_283 = pbuf_remove_header(s2_270, s6_274, a2_263, out a1_1573, out a3_286, out a4_1574, out a5_1575);
						Eq_2 a5_288 = (word32) *((word32) s3_271 + 9);
						Eq_2 a4_289 = 0x02;
						if (a5_288 == 0x02)
						{
							s1_269 = igmp_input(ra_279, s1_269, s2_270, s4_272, 0x4202692C, a3_286, 0x02, s4_272, mstatus, dwArgC8, dwArgF8);
							goto l2306F070;
						}
						if (a5_288 <= 0x02)
						{
							if (a5_288 == s8_276)
							{
								s1_269 = icmp_input(ra_279, s2_270, s4_272, a3_286, s4_272, mstatus, s0, dwArg48, s5, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8);
								goto l2306F070;
							}
						}
						else
						{
							if (a5_288 == 0x06)
							{
								s1_269 = tcp_input(ra_279, s0_268, s2_270, s3_271, s5_273, s6_274, a0_261, s10, s11, mstatus, s8, s6, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, s5, s3, ra, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgDC, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178);
								goto l2306F070;
							}
							a4_289.u0 = 0x11;
							if (a5_288 == 0x11)
							{
								s1_269 = udp_input(ra_279, s2_270, s4_272, a2_263, s5_273, mstatus, dwArg08, dwArg18, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArgB4, dwArgB8, dwArgD0, dwArgD4, dwArgF8);
								goto l2306F070;
							}
						}
						if (a0_261 != 0x02)
						{
							struct Eq_399727 * a5_448;
							if (ip4_addr_isbroadcast_u32(a0_283, s5_273, out a3_286, out a4_289, out a5_448) == null)
							{
								Eq_2 s1_450 = a5_448->t0014;
								a4_289.u0 = 224;
								if ((a5_448 & 0x00F0) != 224)
								{
									Eq_2 a4_462;
									word32 s1_1591;
									ra_279 = icmp_dest_unreach(ra_279, s0_268, s1_450, pbuf_header_force(s2_270, s6_274, a2_263, out a4_462), a4_462, a0_261, mstatus, s8, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0_268, out s1_1591, out a3_286, out a4_289, out s2_270, out s4_272, out mstatus);
								}
							}
							*((word32) s0_268 + 64) = (word16) ((word32) *((word32) s0_268 + 64) + 0x01);
							*((word32) s0_268 + 54) = (word16) ((word32) *((word32) s0_268 + 54) + 0x01);
						}
						word32 mstatus_1590;
						word32 a4_1581;
						word32 s8_1589;
						word32 a5_1582;
						word32 a7_1583;
						word32 s3_1585;
						word32 s4_1586;
						word32 s5_1587;
						word32 s6_1588;
						word32 s2_1584;
						word32 a3_1580;
						word32 a0_1577;
						word32 a1_1578;
						word32 a2_1579;
						word32 s0_1576;
						pbuf_free(ra_279, s2_270, a3_286, a4_289, s4_272, mstatus, dwArgF8, out s0_1576, out s1_269, out a0_1577, out a1_1578, out a2_1579, out a3_1580, out a4_1581, out a5_1582, out a7_1583, out s2_1584, out s3_1585, out s4_1586, out s5_1587, out s6_1588, out s8_1589, out mstatus_1590);
					}
l2306F070:
					*s1_269 = 0x00;
					*((word32) s1_269 + 4) = 0x00;
					*((word32) s1_269 + 8) = 0x00;
					*((word32) s1_269 + 0x0C) = 0x00;
					*((word32) s1_269 + 16) = 0x00;
					*((word32) s1_269 + 20) = 0x00;
					goto l2306EDF2;
				}
			}
			goto l2306EF1C;
		}
	}
	else
	{
		a0_124 = ip4_input_accept(s4_122, 224, out a3_116, out a4_121);
		if (a0_124 == 0x00)
		{
			a4_121 = (word32) g_t4202692C;
			if (a4_121 != 0x007F)
			{
				s5_133 = g_t420267E8;
				while (s5_133 != 0x00)
				{
					if (s5_133 != s4_122)
					{
						a0_124 = ip4_input_accept(s5_133, a4_121, out a3_116, out a4_121);
						if (a0_124 != 0x00)
							goto l2306EF1E;
					}
					s5_133 = *s5_133.u0;
				}
			}
		}
		else if (s4_122 != 0x00)
		{
l2306EF1C:
			s5_133 = s4_122;
			goto l2306EF1E;
		}
	}
l2306EEEE:
	a4_121 = (word32) *((word32) s3_30 + 9);
	if (a4_121 == 0x11)
	{
		struct Eq_399414 * a4_172 = (word32) s3_30 + s6_169;
		a3_116 = (word32) a4_172->b0002;
		a4_121.u0 = 0x04000400;
		if (((word32) a4_172->b0003 << 8 | a3_116) == 0x04000400)
		{
			s5_133 = s4_122;
l2306EFBC:
			if (s5_133 == 0x00)
			{
				g_w42026826 = (word16) ((word32) g_w42026826 + 0x01);
				word32 a5_1599;
				word32 mstatus_1607;
				word32 a7_1600;
				word32 s2_1601;
				word32 s4_1603;
				word32 s5_1604;
				word32 s6_1605;
				word32 s8_1606;
				word32 s3_1602;
				word32 a4_1598;
				word32 s0_1592;
				word32 a0_1594;
				word32 a1_1595;
				word32 a2_1596;
				word32 a3_1597;
				word32 s1_1593;
				pbuf_free(ra_244, s2_35, a3_116, a4_121, s4_122, mstatus, dwArgF8, out s0_1592, out s1_1593, out a0_1594, out a1_1595, out a2_1596, out a3_1597, out a4_1598, out a5_1599, out a7_1600, out s2_1601, out s3_1602, out s4_1603, out s5_1604, out s6_1605, out s8_1606, out mstatus_1607);
l2306EDF2:
				0x00 = (int8) dwArg0128;
				return;
			}
			goto l2306EF42;
		}
	}
	s5_133.u0 = 0x00;
l2306EF1E:
	s1_102 = (struct Eq_399324 *) *((word32) a0_124 + 16);
	if (a0_124 != 0x00)
	{
		struct Eq_399438 * a5_198;
		if (ip4_addr_isbroadcast_u32(a0_124, s4_122, out a3_116, out a4_121, out a5_198) != null)
		{
l2306EF36:
			word32 a2_1546;
			word32 s1_1543;
			word32 a0_1544;
			word32 a3_1547;
			word32 s5_1554;
			word32 a7_1550;
			word32 s6_1555;
			word32 s8_1556;
			word32 a5_1549;
			word32 s2_1551;
			word32 s3_1552;
			word32 s4_1553;
			word32 a4_1548;
			word32 a1_1545;
			word32 mstatus_1557;
			pbuf_free(ra_244, s2_35, a3_116, a4_121, s4_122, mstatus, dwArgF8, out s0_567, out s1_1543, out a0_1544, out a1_1545, out a2_1546, out a3_1547, out a4_1548, out a5_1549, out a7_1550, out s2_1551, out s3_1552, out s4_1553, out s5_1554, out s6_1555, out s8_1556, out mstatus_1557);
			goto l2306EE68;
		}
		s1_102 = a5_198->ptr0010;
		a4_121.u0 = 224;
		if ((a5_198 & 0x00F0) == 224)
			goto l2306EF36;
	}
	goto l2306EFBC;
}

