pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306F33A: Register Eq_2 ip4_addr_isbroadcast_u32(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_396386 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      etharp_input
//      etharp_query
//      etharp_output
//      ip4_input_accept
//      ip4_input
//      raw_input
//      tcp_input
//      udp_input
//      icmp_input
Eq_2 ip4_addr_isbroadcast_u32(Eq_2 a0, Eq_2 a1, union Eq_396386 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a0_11;
	Eq_2 a5_10 = ~0x02;
	if (a0 <= 0x02)
	{
		a5_10 = (word32) *((word32) a1 + 65);
		a0_11 = a5_10 & 2;
		if ((a5_10 & 2) != 0x00)
		{
			a0_11.u0 = 0x00;
			if (a5_10 != a0)
			{
				a5_10 = (a5_10 ^ a0) & (word32) a0 - 1;
				if (a5_10 == 0x00)
				{
					Eq_396386 a3_17 = ~((word32) a0 - 1);
					a3Out = a3_17;
					a4Out.u0 = <invalid>;
					a5Out = a5_10;
					return (word32) ((a3_17 & a0) - a3_17 < 1);
				}
			}
		}
	}
	else
		a0_11.u0 = 0x01;
	a3Out = (word32) a0 - 1;
	a4Out.u0 = <invalid>;
	a5Out = a5_10;
	return a0_11;
}

// 2306F374: Register word32 ip4addr_aton(Register Eq_2 a0, Register (ptr32 Eq_389890) a1, Register out Eq_389965 a0Out, Register out Eq_389966 a3Out, Register out (ptr32 Eq_389967) a4Out, Register out (ptr32 Eq_389968) a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      dns_gethostbyname
//      ipaddr_addr
//      dhcpd_start
//      bl_cipstart
//      set_if
word32 ip4addr_aton(Eq_2 a0, struct Eq_389890 * a1, union Eq_389965 & a0Out, union Eq_389966 & a3Out, struct Eq_389967 & a4Out, struct Eq_389968 & a5Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_389968 * a5_102 = (word32) *a0;
	struct Eq_389967 * a4_10 = fp + -32;
	while (true)
	{
		Eq_389965 s0_114;
		ui32 a3_24 = (word32) a5_102->b230CB5B1;
		Eq_389966 a3_117 = a3_24 & 0x04;
		if ((a3_24 & 0x04) == 0x00)
			break;
		word32 a7_177 = 0x0A;
		if (a5_102 == (struct Eq_389968 *) 48)
		{
			a5_102 = (word32) *((word32) a0 + 1);
			if ((a5_102 & 223) != 88)
			{
				a0 = (word32) a0 + 1;
				a7_177 = 0x08;
			}
			else
			{
				a5_102 = (word32) *((word32) a0 + 2);
				a7_177 = 0x10;
				a0 = (word32) a0 + 2;
			}
		}
		Eq_2 a2_138 = a0;
		Eq_2 a0_103 = 0x00;
l2306F3C4:
		a3_117 = (word32) a5_102->b230CB5B1;
		if ((a3_117 & 4) != 0x00)
		{
			a0_103 = (char *) (a5_102 + ((word32) a0_103 + a7_177) / 588035506) - 48;
			goto l2306F3DE;
		}
		if (a7_177 == 0x10 && (a3_117 & 0x0044) != 0x00)
		{
			ui32 a0_142 = a0_103 << 4;
			Eq_400630 a5_143 = (char *) a5_102 + 0x0A;
			Eq_400633 t1_144 = 97;
			if ((a3_117 & 0x03) != 0x02)
				t1_144.u0 = 65;
			a0_103 = a0_142 | a5_143 - t1_144;
l2306F3DE:
			a5_102 = (word32) *((word32) a2_138 + 1);
			a2_138 = (word32) a2_138 + 1;
			goto l2306F3C4;
		}
		if (a5_102 != (struct Eq_389968 *) 46)
		{
			if (a5_102 != null)
			{
				a3_117 &= 0x08;
				s0_114.u0 = 0x00;
				if ((a3_117 & 0x08) == 0x00)
					goto l2306F458;
			}
			s0_114 = (a4_10 - (fp + -32) >> 2) + 0x01;
			a5_102 = (struct Eq_389968 *) 0x02;
			if (s0_114 == 0x02)
			{
				a5_102 = (struct Eq_389968 *) 0x01000000;
				s0_114.u0 = 0x00;
				if (a0_103 >= 0x01000000)
					goto l2306F458;
				a4_10 = (struct Eq_389967 *) 0x00FF;
				if (true)
					goto l2306F458;
				a5_102 = null;
				goto l2306F4AA;
			}
			if (s0_114 <= 0x02)
			{
				if (s0_114 == 0x00)
					goto l2306F458;
				goto l2306F44A;
			}
			ui32 a5_84;
			if (s0_114 != 0x03)
			{
				a5_102 = (struct Eq_389968 *) 0x04;
				if (s0_114 != 0x04)
					goto l2306F44A;
				s0_114.u0 = 0x00;
				if (a0_103 > 0x00FF || false)
					goto l2306F458;
				s4 = dwArg74;
				if (a3_117 > 0x00FF)
					goto l2306F458;
				s8 = dwArg94;
				if (a4_10 > (struct Eq_389967 *) 0x00FF)
					goto l2306F458;
				a3_117 <<= 16;
				a5_84 = a3_117 | 0x04000000;
				a4_10 <<= 8;
			}
			else
			{
				a5_102 = (struct Eq_389968 *) 0x10000000;
				s0_114.u0 = 0x00;
				if (a0_103 >= 0x10000000)
					goto l2306F458;
				a3_117.u0 = 0x00FF;
				if (true)
					goto l2306F458;
				s4 = dwArg94;
				if (a4_10 > (struct Eq_389967 *) 0x00FF)
					goto l2306F458;
				a5_84 = 0x00;
				a4_10 <<= 16;
			}
			a5_102 = a5_84 | a4_10;
l2306F4AA:
			a0_103 |= a5_102;
l2306F44A:
			s0_114.u0 = 0x01;
			if (a1 != null)
				*lwip_htonl(a0_103, out a3_117, out a4_10, out a5_102) = a1;
			goto l2306F458;
		}
		if (a4_10 == fp + -20)
			break;
		++a4_10;
		a4_10[0x03FF] = (struct Eq_389967) a0_103;
		a5_102 = (word32) *((word32) a2_138 + 1);
		a0 = (word32) a2_138 + 1;
	}
	s0_114.u0 = 0x00;
l2306F458:
	a0Out = s0_114;
	a3Out = a3_117;
	a4Out = a4_10;
	a5Out = a5_102;
	s4Out = s4;
	s8Out = s8;
	return dwArgE4;
}

// 2306F4D2: Register Eq_2 ipaddr_addr(Register Eq_2 a0, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      bl_rx_sm_disconnect_ind
//      wifi_sta_ip_set_cmd
//      iperf_server_udp
//      iperf_client_udp
//      iperf_client_tcp
//      cipsta_ip
//      http_url_req
Eq_2 ipaddr_addr(Eq_2 a0, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a3_10;
	ptr32 s4_23;
	ptr32 s8_24;
	word32 a5_57;
	word32 a4_56;
	ptr32 a0_25;
	Eq_2 s0_14 = ip4addr_aton(a0, fp + ~0x13, out a0_25, out a3_10, out a4_56, out a5_57, out s4_23, out s8_24);
	if (a0_25 == 0x00)
		a0_25 = ~0x00;
	a0Out = a0_25;
	a3Out = a3_10;
	s4Out = s4_23;
	s8Out = s8_24;
	return s0_14;
}

// 2306F4EA: Register (ptr32 Eq_120729) ip4addr_ntoa_r(Register (ptr32 Eq_120729) a1, Register int32 a2, Register out (ptr32 Eq_120731) a3Out, Register out (ptr32 Eq_120729) a4Out, Register out (ptr32 Eq_120731) a5Out)
// Called from:
//      wifi_sta_ip_set_cmd
//      ip4addr_ntoa
//      tcp_accept_callback
struct Eq_120729 * ip4addr_ntoa_r(struct Eq_120729 * a1, int32 a2, struct Eq_120731 & a3Out, struct Eq_120729 & a4Out, struct Eq_120731 & a5Out)
{
	struct Eq_120729 * t4_42 = a1;
	int32 a0_10 = 0x00;
	struct Eq_120731 * a3_11 = &fp->bFFFFFFF8 + 4;
	do
	{
		uint32 a6_18 = (word32) a3_11->b0000;
		struct Eq_120731 * a5_19 = null;
		while (true)
		{
			Mem31[fp + a5_19 + 0x0FF8:byte] = SLICE((a6_18 & 0x0A) + 48, byte, 0);
			int32 t3_27 = a5_19 + 1;
			uint32 a4_29 = a6_18 >> 0x0A;
			if (a6_18 <= 0x09)
				break;
			a6_18 = a4_29 & 0x00FF;
			a5_19 = t3_27 & 0x00FF;
		}
		a3_11->b0000 = (byte) (a4_29 & 0x00FF);
		int32 a6_40 = a0_10;
		struct Eq_120729 * a4_43 = t4_42;
		while (true)
		{
			struct Eq_120729 * a0_62;
			++a0_10;
			if (a5_19 == (struct Eq_120731 *) 0x00FF)
				break;
			word32 a7_48 = a5_19 + -1;
			if (a6_40 >= a2)
				goto l2306F582;
			++a4_43;
			Mem60[a4_43 + 0x0FFF:byte] = SLICE(CONVERT(Mem55[a5_19 + fp + -8:byte], byte, word32), byte, 0);
			a6_40 = a0_10;
			a5_19 = a7_48 & 0x00FF;
		}
		if (a6_40 >= a2)
		{
l2306F582:
			a0_62 = null;
			goto l2306F556;
		}
		a4_43->b0000 = 0x2E;
		++a3_11;
		a5_19 = fp;
		t4_42 = a4_43 + 1;
	} while (a3_11 != fp);
	a4_43->b0000 = 0x00;
	a0_62 = a1;
l2306F556:
	a3Out = a3_11;
	a4Out = a4_43;
	a5Out = a5_19;
	return a0_62;
}

// 2306F586: Register word32 ip4addr_ntoa(Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      wifiprov_wifi_state_get
//      wifi_sta_ip_info
//      netif_status_callback
//      ota_tcp_cmd
//      iperf_server
//      cipsta_ip_get
//      ap_sta_get
//      cwjap_info
//      domain_name_resolution
//      httpc_get_file
word32 ip4addr_ntoa(ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_7;
	ptr32 a4_8;
	ptr32 a5_9;
	word32 a0_6 = ip4addr_ntoa_r(&g_t4201B0B8.b000A + 0x00E6, 0x10, out a3_7, out a4_8, out a5_9);
	a2Out = 0x10;
	a3Out = a3_7;
	a4Out = a4_8;
	a5Out = a5_9;
	return a0_6;
}

// 2306F594: void mem_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
// Called from:
//      lwip_init
void mem_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	g_t4200F614.u0 = 0x42045FC0;
	*(word32 *) 0x02000000 = 0x42045FC0;
	g_b42045FC4 = 0x00;
	g_t4200F618.u0 = 1141137344;
	*(word32 *) 0x20002000 = 1141137344;
	*(byte *) 0x44045FC4 = 0x01;
	g_t4200F60C.u0 = 0x42045FC0;
	g_w4202789E = 0x00;
	sys_mutex_new(ra, 0x4200F610, 0x4200F000, 0x02000000, 0x42027000, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178);
}

// 2306F5E2: Register Eq_384410 mem_free(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198, Register out Eq_384410 s1Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_400916 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s8Out)
// Called from:
//      pbuf_free
//      dhcp_server_recv
//      dhcp_server_stop
//      httpc_free_state
//      altcp_mbedtls_free
//      altcp_mbedtls_free_config
Eq_384410 mem_free(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0198, union Eq_384410 & s1Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_400916 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s8Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		return s0;
	}
	Eq_384410 s1_207;
	Eq_2 s2_208 = 0x420267F0;
	s1_207 = s1;
	if ((a0 & 3) != 0x00)
	{
l2306F606:
		word32 a2_446;
		word32 a4_447;
		sys_arch_protect(a4, mstatus, out a2_446, out a4_447);
		*((word32) s2_208 + 0x00B4) = (word16) ((word32) *((word32) s2_208 + 0x00B4) + 0x01);
		Eq_2 a4_245;
		Eq_400916 a5_246;
		Eq_2 a3_244 = sys_arch_unprotect(a3, mstatus, out a4_245, out a5_246);
		s1Out = s1_207;
		a1Out = a1;
		a3Out = a3_244;
		a4Out = a4_245;
		a5Out = a5_246;
		a7Out = a7;
		s2Out = s2_208;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		s8Out = s4;
		return s1;
	}
	s1_207 = (word32) a0 - 8;
	if ((word32) a0 - 8 < g_t4200F614)
		goto l2306F606;
	a3 = g_t4200F618;
	a4 = (word32) a0 + 0x0C;
	s3.u0 = 0x4200F618;
	if (a3 < (word32) a0 + 0x0C)
		goto l2306F606;
	Eq_2 s1_42;
	struct Eq_400975 * s2_43;
	union Eq_2 * s3_44;
	union Eq_2 * s4_45;
	word32 a1_448;
	Eq_2 a4_194;
	struct Eq_400980 * s0_41 = sys_mutex_lock(a3, (word32) a0 + 0x0C, 0x420267F0, mstatus, s4, dwArg24, s3, dwArgD8, dwArg0118, out s1_42, out a1_448, out a4_194, out s2_43, out s3_44, out s4_45);
	Eq_2 a5_129 = (word32) s0_41->bFFFFFFFC;
	if (a5_129 != 0x00)
	{
		up32 a1_50 = (word32) s0_41->wFFFFFFF8;
		a5_129.u0 = 0x02000000;
		if (a1_50 > 0x02000000)
			goto l2306F662;
		a4_194 = (word32) s0_41->wFFFFFFFA;
		if (a4_194 <= 0x02000000)
		{
			a5_129 = *s4_45;
			Eq_2 a2_56 = (word32) (word16) (s1_42 - a5_129);
			if (a2_56 != a4_194)
			{
				a4_194 = CONVERT(Mem19[a4_194 + a5_129:uint16], uint16, word32);
				if (a4_194 != a2_56)
					goto l2306F662;
			}
			Eq_2 a6_61 = *s3_44;
			Eq_2 a4_64 = (word32) a5_129 + a1_50;
			if (a4_64 != a6_61)
			{
				a4_194 = (word32) *((word32) a4_64 + 2);
				if (a4_194 != a2_56)
					goto l2306F662;
			}
			Eq_2 a3_69 = g_t4200F60C;
			s0_41->b0FFC = 0x00;
			Eq_2 a4_126 = 0x4200F60C;
			if (s1_42 < a3_69)
				s1_42->u0 = 0x4200F60C;
			s2_43->w00B0 = (word16) ((word32) a2_56 + ((word32) s2_43->w00B0 - a1_50));
			Eq_2 a3_93 = (word32) a5_129 + (word32) s0_41->wFFFFFFF8;
			if (s1_42 != a3_93)
			{
				Eq_2 a1_95 = (word32) *((word32) a3_93 + 4);
				if (a1_95 == 0x00 && a6_61 != a3_93)
				{
					a4_126 = *a1_95;
					if (a3_93 == a1_95)
						*s1_42 = a4_126;
					s0_41->w0FF8 = (word16) (word32) *a3_93;
					ptr32 a3_105 = (word32) *a3_93;
					if (a3_105 != 0x02000000)
						(word32) a5_129 + a3_105 + 2 = (word32) (word16) a2_56;
				}
			}
			word32 a2_113 = (word32) s0_41->wFFFFFFFA;
			Eq_2 a3_115 = (word32) a5_129 + a2_113;
			if (s1_42 != a3_115)
			{
				Eq_2 a1_118 = (word32) *((word32) a3_115 + 4);
				if (a1_118 == 0x00)
				{
					Eq_401136 a4_119 = *a1_118;
					if (s1_42 == a1_118)
						*a3_115 = a4_119;
					*a3_115 = (word16) (word32) s0_41->wFFFFFFF8;
					a4_126 = (word32) s0_41->wFFFFFFF8;
					if (a4_126 != 0x02000000)
					{
						a5_129 += a4_126;
						*((word32) a5_129 + 2) = (word16) a2_113;
					}
				}
			}
			ptr32 a1_169;
			Eq_2 a3_171;
			Eq_2 a4_172;
			Eq_400916 a5_173;
			ptr32 a7_175;
			Eq_384410 s1_177;
			Eq_2 s2_178;
			Eq_2 s3_179;
			Eq_2 s4_180;
			ptr32 s5_181;
			ptr32 s6_182;
			Eq_2 s8_183;
			Eq_384410 s0_176 = sys_mutex_unlock(0x4200F610, a4_126, a5_129, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_177, out a1_169, out a3_171, out a4_172, out a5_173, out a7_175, out s2_178, out s3_179, out s4_180, out s5_181, out s6_182, out s8_183);
			s1Out = s1_177;
			a1Out = a1_169;
			a3Out = a3_171;
			a4Out = a4_172;
			a5Out = a5_173;
			a7Out = a7_175;
			s2Out = s2_178;
			s3Out = s3_179;
			s4Out = s4_180;
			s5Out = s5_181;
			s6Out = s6_182;
			s8Out = s8_183;
			return s0_176;
		}
	}
l2306F662:
	word32 s8_451;
	word32 a5_449;
	word32 s4_450;
	sys_mutex_unlock(0x4200F610, a4_194, a5_129, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_207, out a1, out a3, out a4, out a5_449, out a7, out s2_208, out s3, out s4_450, out s5, out s6, out s8_451);
	goto l2306F606;
}

// 2306F74E: Register uint32 mem_trim(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s8Out)
// Called from:
//      pbuf_realloc
uint32 mem_trim(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s8Out)
{
	Eq_2 s0_24 = (word32) (word16) ((word32) a1 + 3 & ~0x03);
	Eq_2 a5_180 = 11;
	Eq_2 s4_187 = a0;
	if (s0_24 > 11)
	{
		a5_180.u0 = 0x02000000;
		if (s0_24 > 0x02000000)
			goto l2306F778;
	}
	else
		s0_24.u0 = 0x0C;
	if (s0_24 >= a1)
	{
		s5 = 0x4200F614;
		a5_180 = g_t4200F614;
		if (a0 < a5_180)
		{
l2306F79E:
			word32 a2_443;
			word32 a4_444;
			sys_arch_protect(a4, mstatus, out a2_443, out a4_444);
			g_w420268A4 = (word16) ((word32) g_w420268A4 + 0x01);
			a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5_180);
			goto l2306F7B8;
		}
		a4 = g_t4200F618;
		if (a0 >= a4)
			goto l2306F79E;
		uint32 s2_44 = (word32) *((word32) a0 - 8) + ~0x07 << 16;
		s1 = (word32) (word16) ((word32) a0 - 8 - a5_180);
		s2 = s2_44 >> 0x10;
		s3 = (word32) (word16) ((s2_44 >> 0x10) - s1);
		if (s3 >= s0_24)
		{
			if (s3 == s0_24)
			{
l2306F7B8:
				0x00 = (int8) dwArgA8;
				a0Out = s4_187;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5_180;
				s2Out = s2;
				s3Out = s3;
				s4Out = dwArg04;
				s5Out = s5;
				s6Out = s6;
				s8Out = s4;
				return s1;
			}
			Eq_2 a4_117;
			up32 s0_110;
			struct Eq_401291 * a1_58;
			up32 s1_65;
			up32 s2_66;
			up32 s3_67;
			struct Eq_401295 * s4_68;
			word32 a4_445;
			struct Eq_400980 * s0_64 = sys_mutex_lock(a3, a4, s2_44 >> 0x10, mstatus, s4, dwArg24, s3, dwArgD8, dwArg0118, out s1_65, out a1_58, out a4_445, out s2_66, out s3_67, out s4_68);
			Eq_2 a5_148 = g_t4200F614;
			Eq_2 a2_74 = (word32) a5_148 + (word32) s4_68->wFFFFFFF8;
			if ((word32) *((word32) a2_74 + 4) == 0x00)
			{
				a4_117 = (word32) (word16) (s0_64 + (s1_65 + 8) / 0x0FFD);
				word32 a6_118 = (word32) *a2_74;
				word32 a3_119 = a5_148 + a4_117;
				if (g_t4200F60C == a2_74)
					a3_119->t0000.u1 = 0x4200F60C;
				a3_119->b0004 = 0x00;
				a3_119->t0000 = (word16) a6_118;
				a3_119->w0002 = (word16) s1_65;
				s4_68->w0FF8 = (word16) a4_117;
				int32 a3_130 = (word32) a3_119->t0000;
				if (a3_130 != 0x02000000)
					(word32) a5_148 + a3_130 + 2 = (int32) (word16) a4_117;
				s0_110 = s0_64 + ((s1_65 - s2_66) + (word32) g_w420268A0) / 0x0FFD;
			}
			else
			{
				a4_117 = &s0_64->bFFFFFFFC + 24;
				if (s3_67 < &s0_64->bFFFFFFFC + 24)
					goto l2306F86E;
				a4_117 = (word32) (word16) (s0_64 + (s1_65 + 8) / 0x0FFD);
				Eq_401391 a2_81 = a1_58->t0000;
				word32 a3_83 = a5_148 + a4_117;
				if (a3_83 < a1_58)
					a3_83->t0000 = a2_81;
				a3_83->b0004 = 0x00;
				word32 a2_88 = (word32) s4_68->wFFFFFFF8;
				a3_83->w0002 = (word16) s1_65;
				a3_83->t0000 = (word16) a2_88;
				s4_68->w0FF8 = (word16) a4_117;
				struct Eq_401419 * a3_94 = (word32) a3_83->t0000;
				if (a3_94 != (struct Eq_401419 *) 0x02000000)
					Mem98[a5_148 + a3_94 + 2:word16] = SLICE(a4_117, word16, 0);
				s0_110 = s0_64 + ((s1_65 - s2_66) + (word32) g_w420268A0) / 0x0FFD;
			}
			g_w420268A0 = (word16) s0_110;
			a5_148.u0 = 0x420267F0;
l2306F86E:
			word32 a7_447;
			word32 a1_446;
			word32 s8_448;
			sys_mutex_unlock(0x4200F610, a4_117, a5_148, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1, out a1_446, out a3, out a4, out a5_180, out a7_447, out s2, out s3, out s4_187, out s5, out s6, out s8_448);
			goto l2306F7B8;
		}
	}
l2306F778:
	s4_187.u0 = 0x00;
	goto l2306F7B8;
}

