pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306F8D8: Register Eq_2 mem_malloc(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArg94, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_394817 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_394821 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      dhcp_start
//      pbuf_alloc
//      dhcp_server_recv
//      dhcp_server_start
//      httpc_init_connection_common.constprop.5
//      altcp_mbedtls_alloc_config
Eq_2 mem_malloc(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg34, Eq_2 dwArg94, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_394817 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_394821 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	ptr32 s0_18;
	if (a0 != 0x00)
	{
		s1 = (word32) (word16) ((word32) a0 + 3 & ~0x03);
		a5.u0 = 11;
		if (s1 > 11)
		{
			a5.u0 = 0x02000000;
			s0_18 = 0x00;
			if (s1 > 0x02000000)
				goto l2306F8FA;
		}
		else
			s1.u0 = 0x0C;
		s0_18 = 0x00;
		if (s1 < a0)
		{
l2306F8FA:
			a0Out = s0_18;
			a1Out = a1;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			a7Out = a7;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s8Out = s8;
			return s1;
		}
		up32 s1_42;
		word32 s2_408;
		word32 s3_409;
		word32 s4_410;
		word32 a1_406;
		word32 a4_407;
		struct Eq_400980 * s0_41 = sys_mutex_lock(a3, a4, s2, mstatus, s0, dwArg34, ra, dwArgE8, dwArg0128, out s1_42, out a1_406, out a4_407, out s2_408, out s3_409, out s4_410);
		Eq_2 a6_124 = g_t4200F60C;
		Eq_2 a7_52 = g_t4200F614;
		up32 a3_57 = (word32) (word16) (a6_124 - a7_52);
		up32 a4_59 = 0x02000000 - s1_42;
		while (a3_57 < a4_59)
		{
			Eq_2 s0_64 = (word32) a7_52 + a3_57;
			up32 a5_67 = (word32) *s0_64;
			if ((word32) *((word32) s0_64 + 4) == 0x00)
			{
				up32 a2_70 = ~0x07 - a3_57 + a5_67;
				if (a2_70 >= s1_42)
				{
					Eq_2 a5_111;
					Eq_2 a4_126 = 0x420267F0;
					if (a2_70 >= s1_42 + 20)
					{
						word32 a5_90 = (word32) (word16) (s1_42 + 8 + a3_57);
						struct Eq_401589 * a2_91 = (word32) a7_52 + a5_90;
						a2_91->b0004 = 0x00;
						word32 a1_93 = (word32) *s0_64;
						a2_91->w0002 = (word16) a3_57;
						a2_91->w0000 = (word16) a1_93;
						s0_64->u2 = (word16) a5_90;
						*((word32) s0_64 + 4) = 0x01;
						ptr32 a3_99 = (word32) a2_91->w0000;
						if (a3_99 != 0x02000000)
							(word32) a7_52 + a3_99 + 2 = (word32) (word16) a5_90;
						a5_111 = (word32) g_w420268A2;
						Eq_2 s1_112 = (word32) (word16) (s1_42 + ((word32) g_w420268A0 + 0x08));
						g_w420268A0 = (word16) s1_112;
						if (a5_111 < s1_112)
							g_w420268A2 = (word16) s1_112;
					}
					else
					{
						*((word32) s0_64 + 4) = 0x01;
						Eq_2 a3_83 = (word32) g_w420268A2;
						a5_111 = (word32) (word16) (a5_67 + (word32) g_w420268A0 - a3_57);
						g_w420268A0 = (word16) a5_111;
						if (a3_83 < a5_111)
							g_w420268A2 = (word16) a5_111;
					}
					if (a6_124 == s0_64)
					{
						a5_111 = g_t4200F618;
						while (true)
						{
							a4_126 = (word32) *((word32) a6_124 + 4);
							if (a4_126 == 0x00 || a5_111 == a6_124)
								break;
							a6_124 = (word32) a7_52 + (word32) (*a6_124);
						}
						g_t4200F60C = a6_124;
					}
					s0_18 = (word32) sys_mutex_unlock(&s0_41->bFFFFFFFC + 1556, a4_126, a5_111, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1, out a1, out a3, out a4, out a5, out a7, out s2, out s3, out s4, out s5, out s6, out s8) + 8;
					goto l2306F8FA;
				}
			}
			a3_57 = a5_67;
		}
		word32 a4_194 = (word32) g_w4202689C;
		g_w4202689C = (word16) (a4_194 + 0x01);
		sys_mutex_unlock(&s0_41->bFFFFFFFC + 1556, a4_194 + 0x01, 0x420267F0, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1, out a1, out a3, out a4, out a5, out a7, out s2, out s3, out s4, out s5, out s6, out s8);
	}
	s0_18 = 0x00;
	goto l2306F8FA;
}

// 2306FA34: Register Eq_2 mem_calloc(Register Eq_2 ra, Register word32 a0, Register Eq_401688 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg74, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_401688 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      altcp_mbedtls_alloc
//      altcp_mbedtls_alloc_config
Eq_2 mem_calloc(Eq_2 ra, word32 a0, Eq_401688 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg74, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_401688 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 a2_5 = (word32) a1 + a0;
	Eq_2 s0_11 = 0x00;
	Eq_2 a5_13 = (word32) (word16) a2_5;
	if (a2_5 == a5_13)
	{
		Eq_2 a0_20;
		word32 a7_121;
		word32 s8_122;
		s1 = mem_malloc(ra, 0x00, a5_13, a3, a4, s2, mstatus, dwLoc0C, dwArg14, dwArg74, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0168, out a0_20, out a1, out a3, out a4, out a5_13, out a7_121, out s2, out s3, out s4, out s5, out s6, out s8_122);
		s0_11 = a0_20;
		if (a0_20 != 0x00)
		{
			word32 t1_123;
			word32 a0_124;
			word32 a2_125;
			ra = memset(ra, a0_20, 0x00, a2_5, out t1_123, out a0_124, out a1, out a2_125, out a3, out a4, out a5_13);
		}
	}
	s0Out = s0_11;
	s1Out = s1;
	a0Out = s0_11;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_13;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	return ra;
}

// 2306FA68: Register Eq_2 do_memp_malloc_pool(Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      memp_malloc
Eq_2 do_memp_malloc_pool(Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	struct Eq_401768 * a4_16;
	word32 a2_71;
	Eq_2 a0_14 = sys_arch_protect(a4, mstatus, out a2_71, out a4_16);
	Eq_2 a5_19 = *s1;
	if (s1 != 0x00)
	{
		s1 = a4_16->t0000;
		a4_16->t0000 = a5_19;
		struct Eq_401787 * a5_28 = (word32) a4_16->w0004;
		a4_16->w0004 = (word16) ((char *) a5_28 + 1);
		a3 = a0_14;
		up32 a4_32 = (word32) a5_28->w0005;
		if ((word32) a5_28->w0007 < a4_32)
			a5_28->w0007 = (word16) a4_32;
	}
	else
		a4_16->t0000 = (word16) ((word32) a4_16->t0000 + 0x01);
	ptr32 a4_42;
	ptr32 a5_43;
	Eq_2 a3_41 = sys_arch_unprotect(a3, mstatus, out a4_42, out a5_43);
	a0Out = s1;
	a2Out = dwArg10;
	a3Out = a3_41;
	a4Out = a4_42;
	a5Out = a5_43;
	return s1;
}

