pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306FAC0: Register (ptr32 Eq_401830) memp_init_pool(Register Eq_401831 a5)
// Called from:
//      memp_init
struct Eq_401830 * memp_init_pool(Eq_401831 a5)
{
	*a5 = 0x00;
	struct Eq_401830 ** a4_14 = null;
	struct Eq_401838 * a0_11 = *((word32) a5 + 8);
	word32 a5_10 = a5 + 0x03 & ~0x03;
	while (true)
	{
		struct Eq_401830 ** a3_13 = (word32) a0_11->w0006;
		if (a4_14 >= a3_13)
			break;
		struct Eq_401830 * a3_17 = *a3_13;
		a3_17->ptr0000 = a5_10;
		a0_11 = a3_17->ptr000C;
		a5_10->ptr0000 = a3_17;
		a4_14 = (struct Eq_401830 **) ((char *) a4_14 + 1);
		a5_10 += (word32) a0_11->w0004 / 4;
	}
	struct Eq_401830 * a0_24 = a5_10->ptr0000;
	a5_10->w0002 = (word16) a3_13;
	return a0_24;
}

// 2306FAF2: Register word32 memp_init(Register out ptr32 a2Out)
// Called from:
//      lwip_init
word32 memp_init(ptr32 & a2Out)
{
	struct Eq_401882 * s0_18 = &g_t420267F0;
	word32 s1_19;
	for (s1_19 = 588003048; s1_19 != 3706964308; s1_19 += 0x04)
	{
		Eq_401831 a5_24 = s1_19 + 0x00;
		int32 * s3_26 = *a5_24;
		word32 a0_31 = memp_init_pool(a5_24);
		++s0_18;
		s0_18[45] = (struct Eq_401882) *s3_26;
	}
	a2Out = dwArg48;
	return a0_31;
}

// 2306FB44: Register Eq_2 memp_malloc(Register Eq_2 s1, Register up32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out (ptr32 Eq_387908) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      tcpip_input
//      tcpip_callback
//      tcpip_try_callback
//      igmp_lookup_group
//      pbuf_alloc
//      raw_new_ip_type
//      tcp_listen_with_backlog_and_err
//      tcp_seg_copy
//      tcp_new_ip_type
//      tcp_create_segment
//      sys_timeout
//      udp_new_ip_type
//      recv_udp
//      recv_raw
//      netconn_alloc
//      altcp_alloc
Eq_2 memp_malloc(Eq_2 s1, up32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_387908 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	if (a0 > 0x0E)
	{
		a0Out = null;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = 0x0E;
		return s1;
	}
	else
	{
		struct Eq_387908 * a0_16;
		ptr32 a2_17;
		Eq_2 a3_18;
		Eq_2 a4_19;
		ptr32 a5_20;
		Eq_2 s1_22 = do_memp_malloc_pool(s1, a3, a4, mstatus, out a0_16, out a2_17, out a3_18, out a4_19, out a5_20);
		a0Out = a0_16;
		a2Out = a2_17;
		a3Out = a3_18;
		a4Out = a4_19;
		a5Out = a5_20;
		return s1_22;
	}
}

// 2306FB62: Register word32 memp_free(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_388067) a5Out)
// Called from:
//      tcpip_input
//      tcpip_try_callback
//      igmp_stop
//      igmp_leavegroup_netif
//      pbuf_free
//      raw_remove
//      tcp_seg_free
//      tcp_abort
//      tcp_close
//      sys_untimeout
//      sys_check_timeouts
//      udp_remove
//      netconn_new_with_proto_and_callback
//      netconn_alloc
//      netconn_free
//      netbuf_delete
//      altcp_free
word32 memp_free(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_388067 & a5Out)
{
	if (a0 > 0x0E || a1 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = (struct Eq_388067 *) 0x0E;
		return s1;
	}
	else
	{
		struct Eq_401934 * a4_22;
		word32 a2_71;
		Eq_2 a0_20 = sys_arch_protect(a4, mstatus, out a2_71, out a4_22);
		struct Eq_401941 * a5_25 = (word32) a4_22->w0004;
		a4_22->w0004 = (word16) &a5_25->ptrFFFFFFFF;
		struct Eq_401952 * a5_29 = a5_25->ptrFFFFFFFF;
		a5_29->t0000 = a1;
		word32 s1_31 = a5_29->dw000C;
		*a1 = a5_29;
		Eq_2 a4_39;
		struct Eq_388067 * a5_40;
		Eq_2 a3_38 = sys_arch_unprotect(a3, mstatus, out a4_39, out a5_40);
		a0Out = a0_20;
		a2Out = dwArg10;
		a3Out = a3_38;
		a4Out = a4_39;
		a5Out = a5_40;
		return s1_31;
	}
}

// 2306FBAA: void netif_null_output_ip4()
void netif_null_output_ip4()
{
}

// 2306FBAE: Register Eq_2 netif_issue_reports(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_401978 a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack (ptr32 Eq_64398) dwArg10, Stack Eq_2 dwArg24, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out Eq_401978 a1Out, Register out ptr32 a3Out, Register out Eq_401998 a4Out, Register out Eq_401999 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      netif_do_set_ipaddr
//      netif_set_up
//      netif_set_link_up
Eq_2 netif_issue_reports(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_401978 a1, ptr32 mstatus, Eq_2 dwArg08, struct Eq_64398 * dwArg10, Eq_2 dwArg24, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0188, ptr32 & s1Out, union Eq_401978 & a1Out, ptr32 & a3Out, union Eq_401998 & a4Out, union Eq_401999 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_401998 a4_108 = (word32) *((word32) a0 + 65);
	ptr32 a3_104 = 0x05;
	if ((a4_108 & 5) == 0x05)
	{
		a1 &= 0x01;
		if ((a1 & 0x01) != 0x00)
		{
			Eq_2 a0_15 = *(union Eq_2 *) 0x09;
			Eq_2 s0_16 = a0_15;
			if (true)
			{
				a4_108 &= 0x08;
				if ((a4_108 & 0x08) != 0x00)
				{
					word32 a0_228;
					ra = etharp_request(ra, a0_15, a0_15, mstatus, s0, dwArg08, dwArg24, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB0, dwArgB4, dwArgC8, dwArgD8, dwArg0108, dwArg0188, out s0_16, out s1, out a0_228, out a1, out a3_104, out a4_108, out s2, out s3, out s4, out s5, out s6, out s7, out mstatus);
				}
				ui32 a5_48 = (word32) *((word32) s0_16 + 65);
				a5 = a5_48 & 32;
				if ((a5_48 & 32) != 0x00)
				{
					Eq_401978 a1_61;
					ptr32 a3_63;
					Eq_401998 a4_64;
					Eq_401999 a5_65;
					ptr32 s4_67;
					s1Out = igmp_report_groups(s0, dwArg10, a5_48 & 32, out a1_61, out a3_63, out a4_64, out a5_65, out s4_67);
					a1Out = a1_61;
					a3Out = a3_63;
					a4Out = a4_64;
					a5Out = a5_65;
					s2Out = s2;
					s3Out = s3;
					s4Out = s4_67;
					s5Out = s5;
					s6Out = s6;
					s7Out = s7;
					mstatusOut = mstatus;
					return ra;
				}
			}
			s1Out = s1;
			a1Out = a1;
			a3Out = a3_104;
			a4Out = a4_108;
			a5Out = a5;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s1Out = s1;
	a1Out = a1;
	a3Out = 0x05;
	a4Out = a4_108;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

Eq_2 g_t2306FBBE = 
	{
		-0x007B
	};
// 2306FBF8: Register Eq_2 netif_do_set_ipaddr(Register Eq_2 ra, Register Eq_2 s1, Register ptr32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      netif_set_ipaddr
//      netif_set_addr
Eq_2 netif_do_set_ipaddr(Eq_2 ra, Eq_2 s1, ptr32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 a0_5 = *((word32) a5 + 4);
	ptr32 a1_7 = *a4;
	if (a4 == a5)
	{
		s0Out = s0;
		s1Out = s1;
		a1Out = a1_7;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		*a5 = a2;
		Eq_2 a3_35;
		Eq_2 a4_36;
		Eq_2 a5_37;
		ptr32 mstatus_40;
		word32 s1_42;
		struct Eq_402216 ** s2_45;
		word32 s4_251;
		Eq_2 ra_41 = tcp_netif_ip_addr_changed(ra, a2, fp + ~0x13, a3, a4, s3, s4, s7, mstatus, s2, dwLoc08, dwArg08, dwArg18, dwArg34, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg78, dwArg98, dwArg9C, dwArgA8, dwArgC8, out s1_42, out a3_35, out a4_36, out a5_37, out s2_45, out s4_251, out mstatus_40);
		raw_netif_ip_addr_changed(s1_42, fp + ~0x13, a3_35, a4_36, udp_netif_ip_addr_changed(s1_42, fp + ~0x13, a3_35, a4_36, a5_37));
		*((char *) *s2_45 + 4) = (struct Eq_402216 **) a0_5;
		word32 s4_252;
		ptr32 a1_104;
		Eq_2 a3_102;
		Eq_2 a4_103;
		Eq_2 a5_106;
		ptr32 mstatus_114;
		Eq_2 s1_107;
		Eq_2 s2_116;
		Eq_2 s3_117;
		ptr32 s5_118;
		ptr32 s6_119;
		Eq_2 s7_120;
		Eq_2 ra_115 = netif_issue_reports(ra_41, a0_5, a0_5, 0x01, mstatus_40, s2, dwLoc10, dwArg04, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg90, dwArg94, dwArgA8, dwArgB8, dwArgE8, dwArg0168, out s1_107, out a1_104, out a3_102, out a4_103, out a5_106, out s2_116, out s3_117, out s4_252, out s5_118, out s6_119, out s7_120, out mstatus_114);
		ptr32 s0_99 = *((word32) a5_106 + 28);
		if (a5_106 != 0x00)
			a5_106();
		s0Out = s0_99;
		s1Out = s1_107;
		a1Out = a1_104;
		a3Out = a3_102;
		a4Out = a4_103;
		a5Out = a5_106;
		s2Out = s2_116;
		s3Out = s3_117;
		s4Out = dwArg04;
		s5Out = s5_118;
		s6Out = s6_119;
		s7Out = s7_120;
		mstatusOut = mstatus_114;
		return ra_115;
	}
}

// 2306FC54: void netif_init()
// Called from:
//      lwip_init
void netif_init()
{
}

// 2306FC56: Register word32 netif_set_ipaddr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out Eq_2 s2Out)
// Called from:
//      set_if
word32 netif_set_ipaddr(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0148, union Eq_2 & s1Out, union Eq_2 & s2Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		s2Out = s2;
		return s0;
	}
	else
	{
		word32 s0_42;
		Eq_2 s1_43;
		Eq_2 s2_46;
		word32 a1_155;
		word32 a3_156;
		word32 a4_157;
		word32 a5_158;
		word32 s3_159;
		word32 s4_160;
		word32 s5_161;
		word32 s6_162;
		word32 s7_163;
		word32 mstatus_164;
		netif_do_set_ipaddr(ra, s1, fp + ~0x13, a3, a4, a5, s2, s3, s4, s7, mstatus, dwLoc1C, dwLoc18, dwLoc08, dwArg14, dwArg18, dwArg28, dwArg38, dwArg3C, dwArg54, dwArg58, dwArg68, dwArg70, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArg0148, out s0_42, out s1_43, out a1_155, out a3_156, out a4_157, out a5_158, out s2_46, out s3_159, out s4_160, out s5_161, out s6_162, out s7_163, out mstatus_164);
		s1Out = s1_43;
		s2Out = s2_46;
		return s0_42;
	}
}

// 2306FC74: void netif_set_netmask(Register Eq_2 a0, Register ptr32 a1, Register (ptr32 Eq_402329) a4, Register (ptr32 Eq_402329) a5)
// Called from:
//      set_if
void netif_set_netmask(Eq_2 a0, ptr32 a1, struct Eq_402329 * a4, struct Eq_402329 * a5)
{
	if (a0 != 0x00)
	{
		word32 a0_14 = a4->dw0008;
		if (a5 != a4)
			a5->dw0008 = a0_14;
	}
}

// 2306FC8C: void netif_set_gw(Register Eq_2 a0, Register ptr32 a1, Register (ptr32 Eq_402345) a4, Register (ptr32 Eq_402345) a5)
// Called from:
//      set_if
void netif_set_gw(Eq_2 a0, ptr32 a1, struct Eq_402345 * a4, struct Eq_402345 * a5)
{
	if (a0 != 0x00)
	{
		word32 a0_14 = a4->dw000C;
		if (a5 != a4)
			a5->dw000C = a0_14;
	}
}

// 2306FCA4: Register Eq_2 netif_set_addr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_384689) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_384758) s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_384689) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      netifapi_do_netif_set_addr
//      dhcp_bind
//      dhcp_recv
//      dhcp_stop
//      netif_add
Eq_2 netif_set_addr(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_384689 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArg0128, Eq_2 dwArg0138, struct Eq_384758 & s0Out, union Eq_2 & s1Out, struct Eq_384689 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s2_104 = a2;
	if (a2 == 0x00)
		s2_104.u0 = 588036828;
	if (a3 == 0x00)
		a3.u0 = 588036828;
	Eq_2 a5_102;
	Eq_2 ra_136;
	if (a5 != 0x00)
	{
		a5_102.u0 = 0x00;
		ra_136 = ra;
	}
	else
	{
		word32 a3_517;
		word32 a5_519;
		word32 s0_515;
		word32 a4_518;
		word32 s1_516;
		ra_136 = netif_do_set_ipaddr(ra, a0, fp + -20, a3, a4, a5, s2_104, s3, s4, s7, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg58, s1, ra, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgB8, dwArg0138, out s0_515, out s1_516, out a1, out a3_517, out a4_518, out a5_519, out s2_104, out s3, out s4, out s5, out s6, out s7, out mstatus);
		a2 = dwArg74;
		a5_102.u0 = 0x01;
	}
	Eq_2 a4_106 = *s2_104.u0;
	word32 s1_111 = *((word32) a2 + 8);
	if (a4_106 != a2)
		*((word32) a4_106 + 8) = s1_111;
	Eq_2 a3_115 = *a4_106;
	Eq_2 s1_116 = *((word32) a3_115 + 0x0C);
	if (a4_106 != a3_115)
		*((word32) a4_106 + 0x0C) = s1_116;
	if (a5_102 == 0x00)
	{
		word32 s0_520;
		ra_136 = netif_do_set_ipaddr(ra_136, s1_116, fp + -20, a3_115, a4_106, a5_102, s2_104, s3, s4, s7, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg58, s1, ra, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgB8, dwArg0138, out s0_520, out s1_116, out a1, out a3_115, out a4_106, out a5_102, out s2_104, out s3, out s4, out s5, out s6, out s7, out mstatus);
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_116;
	a1Out = a1;
	a2Out = dwArg0100;
	a3Out = a3_115;
	a4Out = a4_106;
	a5Out = a5_102;
	s2Out = s2_104;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra_136;
}

// 2306FD1A: Register Eq_2 netif_add(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_384626) a1, Register word32 a2, Register word32 a3, Register word32 a5, Register int32 a6, Register word32 s4, Register word32 s7, Register word32 mstatus, Stack word32 dwArg14, Stack word32 dwArg18, Stack word32 dwArg28, Stack word32 dwArg38, Stack word32 dwArg3C, Stack word32 dwArg44, Stack word32 dwArg48, Stack word32 dwArg58, Stack word32 dwArg68, Stack word32 dwArg74, Stack word32 dwArg88, Stack word32 dwArgB4, Stack word32 dwArgF8, Stack word32 dwArg0108, Stack word32 dwArg0128)
// Called from:
//      netifapi_do_netif_add
Eq_2 netif_add(Eq_2 ra, Eq_2 a0, struct Eq_384626 * a1, word32 a2, word32 a3, word32 a5, int32 a6, word32 s4, word32 s7, word32 mstatus, word32 dwArg14, word32 dwArg18, word32 dwArg28, word32 dwArg38, word32 dwArg3C, word32 dwArg44, word32 dwArg48, word32 dwArg58, word32 dwArg68, word32 dwArg74, word32 dwArg88, word32 dwArgB4, word32 dwArgF8, word32 dwArg0108, word32 dwArg0128)
{
	Eq_2 s0_148;
	if (a0 != 0x00 && a5 != 0x00)
	{
		struct Eq_384626 * s1_18 = a1;
		word32 s2_20 = a2;
		if (a1 == null)
			s1_18 = (struct Eq_384626 *) &g_ptr230CBADC;
		if (a2 == 0x00)
			s2_20 = 588036828;
		g_t2306FBBE = a0;
		*((word32) a0 + 4) = 0x00;
		*((word32) a0 + 8) = 0x00;
		*((word32) a0 + 0x0C) = 0x00;
		((word32) a0 + 56)->u0 = 0x00;
		*((word32) a0 + 65) = 0x00;
		word32 a3_70;
		struct Eq_402488 * a4_71;
		word32 a5_72;
		word32 t1_514;
		word32 a0_515;
		word32 a2_517;
		word32 a1_516;
		Eq_2 ra_73 = memset(ra, (word32) a0 + 40, 0x00, 0x0C, out t1_514, out a0_515, out a1_516, out a2_517, out a3_70, out a4_71, out a5_72);
		a4_71->t0024 = a0;
		word32 a4_80 = (word32) g_b4200F658;
		0x00 = dwArg74;
		*((word32) a0 + 16) = a6;
		*((word32) a0 + 0x0044) = (byte) a4_80;
		*((word32) a0 + 28) = 0x00;
		((word32) a0 + 32)->u0 = 0x00;
		((word32) a0 + 72)->u0 = 0x00;
		word32 a1_107;
		word32 a2_108;
		word32 a3_109;
		word32 a4_110;
		<anonymous> * a5_111;
		word32 mstatus_114;
		word32 s1_117;
		word32 s3_121;
		word32 s4_122;
		word32 s7_125;
		word32 a0_138;
		ptr32 mstatus_146;
		word32 ra_147;
		byte * s3_153;
		a5_111();
		if (a0_138 == 0x00)
		{
			Eq_2 a2_168 = g_t420267E8;
l2306FDDC:
			if ((word32) *((byte) s0_148.u0 + 0x0044) == 0x00FF)
				((byte) s0_148.u0 + 0x0044)->u0 = 0x00;
			int32 a5_178 = (word32) *((byte) s0_148.u0 + 0x0044);
			Eq_2 a3_181 = a2_168;
			while (a3_181 != 0x00)
			{
				if ((word32) *((word32) a3_181 + 0x0044) == a5_178)
				{
					*((byte) s0_148.u0 + 0x0044) = (byte) (a5_178 + 0x01);
					goto l2306FDDC;
				}
				a3_181 = *a3_181;
			}
			Eq_2 a3_191 = 0x00;
			if (a5_178 != 0x00FE)
				a3_191 = a5_178 + 0x01 & 0x00FF;
			ui32 a5_196 = (word32) *((byte) s0_148.u0 + 65);
			*a2_168 = s0_148;
			*s3_153 = (byte) a3_191;
			g_t420267E8 = s0_148;
			if ((a5_196 & 32) != 0x00)
				igmp_start(ra_147, s0_148, a3_191, 0x42026000, a5_196 & 32, mstatus_146, dwLoc08);
l2306FD2A:
			0x00 = dwArg0128;
			return s0_148;
		}
	}
	s0_148.u0 = 0x00;
	goto l2306FD2A;
}

// 2306FE30: void netif_set_default(Register Eq_2 a0)
// Called from:
//      wifi_mgmr_sta_enable
//      wifi_mgmr_ap_enable
void netif_set_default(Eq_2 a0)
{
	g_t420267E4 = a0;
}

// 2306FE3A: Register Eq_2 netif_set_up(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack (ptr32 Eq_64398) dwArg10, Stack Eq_2 dwArg24, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0188, Register out ptr32 a1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_sta_enable
//      wifi_mgmr_ap_enable
//      dhcpd_start
Eq_2 netif_set_up(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, struct Eq_64398 * dwArg10, Eq_2 dwArg24, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0188, ptr32 & a1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		s2Out = s2;
		s3Out = s3;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		ui32 a5_9 = (word32) *((word32) a0 + 65);
		Eq_2 s0_10 = a0;
		if ((a5_9 & 1) != 0x00)
		{
			a1Out = a1;
			s2Out = s2;
			s3Out = s3;
			mstatusOut = mstatus;
			return ra;
		}
		else
		{
			*((word32) a0 + 65) = (byte) (a5_9 | 1);
			word32 a0_17 = (a5_9 | 1)->dw001C;
			if ((a5_9 | 1) != 0x00)
			{
				word32 a5_22;
				word32 a4_23;
				word32 a2_24;
				word32 a1_25;
				word32 a3_67;
				word32 s1_68;
				word32 s4_69;
				word32 s8_70;
				word32 t3_71;
				word32 tp_72;
				word32 a6_73;
				word32 a7_74;
				word32 s2_75;
				word32 s3_76;
				word32 s5_77;
				word32 s6_78;
				word32 s7_79;
				word32 s9_80;
				word32 t0_81;
				word32 t1_82;
				word32 t4_83;
				word32 t5_84;
				word32 t6_85;
				(a5_9 | 1)();
			}
			ptr32 a1_40;
			ptr32 mstatus_50;
			ptr32 s2_52;
			ptr32 s3_53;
			word32 s7_178;
			word32 s6_177;
			word32 s5_176;
			word32 s4_175;
			word32 a5_174;
			word32 a4_173;
			word32 a3_172;
			word32 s1_171;
			Eq_2 ra_51 = netif_issue_reports(ra, s0, s0_10, 0x03, mstatus, dwArg08, dwArg10, dwArg24, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB0, dwArgB4, dwArgC8, dwArgD8, dwArg0108, dwArg0188, out s1_171, out a1_40, out a3_172, out a4_173, out a5_174, out s2_52, out s3_53, out s4_175, out s5_176, out s6_177, out s7_178, out mstatus_50);
			a1Out = a1_40;
			s2Out = s2_52;
			s3Out = s3_53;
			mstatusOut = mstatus_50;
			return ra_51;
		}
	}
}

