pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306FE74: Register Eq_2 netif_set_down(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg10, Stack Eq_2 dwArgE8)
// Called from:
//      netif_remove
Eq_2 netif_set_down(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg10, Eq_2 dwArgE8)
{
	if (a0 == 0x00)
		return s0;
	ui32 a5_9 = (word32) *((word32) a0 + 65);
	Eq_2 s0_10 = a0;
	if ((a5_9 & 1) == 0x00)
		return s0;
	*((word32) a0 + 65) = (byte) (a5_9 & -2);
	if ((a5_9 & 0x08) != 0x00)
		s0_10 = etharp_cleanup_netif(ra, a0, a3, s4, mstatus, dwArg08, dwArgE8, out s4);
	<anonymous> * t1_30 = *((word32) s0_10 + 28);
	if (t1_30 == null)
		return s0;
	Eq_2 s0_47;
	word32 a5_49;
	word32 a4_50;
	word32 t1_51;
	word32 a6_56;
	word32 s1_57;
	word32 s2_58;
	word32 s3_59;
	word32 s8_60;
	word32 t3_61;
	t1_30();
	return s0_47;
}

// 2306FEB4: void netif_remove(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_402757) a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack word32 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8)
void netif_remove(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 a4, struct Eq_402757 * a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, word32 dwArg00, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgD8)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_12 = a5->t0004;
	Eq_2 s0_101 = a0_12;
	if (a5 != null)
	{
		Eq_2 a5_29;
		word32 s1_34;
		word32 s2_368;
		ra = tcp_netif_ip_addr_changed(ra, (word32) a0_12 + 4, 0x00, a3, a4, s3, s4, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg44, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArgA8, dwArgAC, dwArgB8, dwArgD8, out s1_34, out a3, out a4, out a5_29, out s2_368, out s4, out mstatus);
		raw_netif_ip_addr_changed(s1_34, 0x00, a3, a4, udp_netif_ip_addr_changed(s1_34, 0x00, a3, a4, a5_29));
	}
	ui32 a5_63 = (word32) *((word32) a0_12 + 65);
	if ((a5_63 & 32) != 0x00)
		ra = igmp_stop(ra, a0_12, a3, a4, a5_63 & 32, mstatus, dwArg28, out a3);
	if (((word32) *((word32) a0_12 + 65) & 0x01) != 0x00)
		s0_101 = netif_set_down(ra, a0_12, a0_12, a3, s4, mstatus, dwLoc08, dwArg00, dwArgD8);
	if (g_t420267E4 == s0_101)
		g_t420267E4.u0 = 0x00;
	Eq_2 a5_115 = g_t420267E8;
	if (a5_115 == s0_101)
		g_t420267E8 = a5_115;
	else
	{
		while (a5_115 != 0x00)
		{
			word32 a5_120 = g_dw42026000;
			if (s0_101 == 0x42026000)
			{
				g_dw42026000 = a5_120;
				return;
			}
			a5_115.u0 = 0x42026000;
		}
	}
}

// 2306FF3C: void netif_set_status_callback(Register (ptr32 Eq_126409) a0, Register (ptr32 Eq_126427) a1)
// Called from:
//      bl606a0_wifi_netif_init
void netif_set_status_callback(struct Eq_126409 * a0, struct Eq_126427 * a1)
{
	if (a0 != null)
		a1->ptr001C = a0;
}

// 2306FF42: void netif_set_link_up(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack (ptr32 Eq_64398) dwArg00, Stack Eq_2 dwArg04, Stack word32 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0178)
void netif_set_link_up(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 a0, Eq_2 s4, Eq_2 s5, ptr32 mstatus, struct Eq_64398 * dwArg00, Eq_2 dwArg04, word32 dwArg10, Eq_2 dwArg14, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0178)
{
	if (a0 == 0x00)
		return;
	ui32 a5_9 = (word32) *((word32) a0 + 65);
	if ((a5_9 & 4) != 0x00)
		return;
	*((word32) a0 + 65) = (byte) (a5_9 | 4);
	ptr32 mstatus_26;
	Eq_2 s0_28;
	word32 s1_51;
	word32 s4_52;
	word32 mstatus_58;
	word32 s5_62;
	word32 a1_210;
	word32 a3_211;
	word32 a4_212;
	word32 a5_213;
	word32 s2_214;
	word32 s3_215;
	word32 s6_216;
	word32 s7_217;
	Eq_2 ra_59 = netif_issue_reports(dhcp_network_changed(ra, a0, s1, a5_9 | 4, s4, s5, mstatus, dwArg04, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, out s0_28, out mstatus_26), s0_28, s0_28, 0x03, mstatus_26, dwLoc08, dwArg00, dwArg14, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA0, dwArgA4, dwArgB8, dwArgC8, dwArgF8, dwArg0178, out s1_51, out a1_210, out a3_211, out a4_212, out a5_213, out s2_214, out s3_215, out s4_52, out s5_62, out s6_216, out s7_217, out mstatus_58);
	Eq_2 t1_71 = *((word32) s0_28 + 32);
	if (t1_71 == 0x00)
		return;
	word32 a5_85;
	word32 a4_86;
	word32 a1_87;
	word32 t1_88;
	word32 a3_94;
	word32 a6_95;
	word32 a7_96;
	word32 s2_97;
	word32 s3_98;
	word32 s6_99;
	word32 s8_100;
	word32 t0_101;
	word32 t3_102;
	word32 t4_103;
	word32 t5_104;
	word32 t6_105;
	word32 tp_106;
	word32 s7_107;
	word32 s9_108;
	t1_71();
}

// 2306FF86: void netif_set_link_down(Register (ptr32 Eq_402968) a0)
void netif_set_link_down(struct Eq_402968 * a0)
{
	if (a0 == null)
		return;
	ui32 a4_5 = (word32) a0->b0041;
	if ((a4_5 & 4) == 0x00)
		return;
	<anonymous> * t1_7 = a0->ptr0020;
	a0->b0041 = (byte) (a4_5 & ~0x04);
	if (t1_7 == null)
		return;
	word32 a4_12;
	word32 a3_13;
	word32 t1_14;
	t1_7();
}

