pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2306FFA4: Register Eq_2 netif_get_by_index(Register Eq_2 a0, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      raw_send
//      tcp_output_control_segment
//      tcp_output
//      udp_sendto
//      altcp_tcp_connect
Eq_2 netif_get_by_index(Eq_2 a0, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_14 = 0x00;
	if (a0 != 0x00)
	{
		a5_14 = g_t420267E8;
		while (a5_14 != 0x00)
		{
			a4 = (word32) *((word32) a5_14 + 0x0044) + 0x01 & 0x00FF;
			if (a4 == a0)
				break;
			a5_14 = *a5_14;
		}
	}
	a4Out = a4;
	a5Out = a5_14;
	return a5_14;
}

// 2306FFC8: Register Eq_2 netif_find(Register Eq_2 a0, Register out (ptr32 Eq_385919) a4Out, Register out (ptr32 Eq_385920) a5Out)
// Called from:
//      lwip_setsockopt_callback
Eq_2 netif_find(Eq_2 a0, struct Eq_385919 & a4Out, struct Eq_385920 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a5_136;
		word32 a2_133;
		word32 a3_134;
		word32 a4_135;
		word32 a1_132;
		Eq_2 a0_11 = atoi((word32) a0 + 2, out a1_132, out a2_133, out a3_134, out a4_135, out a5_136);
		struct Eq_385919 * a4_26 = &g_dw42026000;
		Eq_2 a0_28 = g_t420267E8;
		while (a0_28 != 0x00)
		{
			a4_26 = (word32) *((word32) a0_28 + 0x0044);
			if (a4_26 == (a0_11 & 0x00FF))
			{
				a4_26 = (word32) *((byte) a0_28.u0 + 66);
				if ((word32) *a0 == a4_26)
				{
					a4_26 = (word32) *((byte) a0_28.u0 + 67);
					if ((word32) *((word32) a0 + 1) == a4_26)
						goto l2306FFEC;
				}
			}
			a0_28 = *a0_28.u0;
		}
		a0_28.u0 = 0x00;
l2306FFEC:
		a4Out = a4_26;
		a5Out = a0_11 & 0x00FF;
		return a0_28;
	}
	else
	{
		a4Out = a4;
		a5Out = a5;
		return 0x00;
	}
}

// 23070018: void pbuf_skip_const(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 word16) a2)
// Called from:
//      pbuf_take_at
//      pbuf_try_get_at
//      pbuf_put_at
void pbuf_skip_const(Eq_2 a0, Eq_2 a1, word16 * a2)
{
	while (a0 != 0x00)
	{
		Eq_2 a5_5 = (word32) *((word32) a0 + 0x0A);
		if (a1 < a5_5)
			break;
		a1 = (word32) (word16) (a1 - a5_5);
		a0 = *a0;
	}
	if (a2 != null)
		*a2 = (word16) a1;
}

// 23070034: void pbuf_free_ooseq_callback(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArgE8)
void pbuf_free_ooseq_callback(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArgE8)
{
	word32 a4_65;
	word32 a2_64;
	sys_arch_protect(a4, mstatus, out a2_64, out a4_65);
	g_b420267EC = 0x00;
	Eq_2 a4_16;
	word32 a5_66;
	Eq_2 a3_15 = sys_arch_unprotect(a3, mstatus, out a4_16, out a5_66);
	Eq_2 a0_19 = g_t42026904;
	while (a0_19 != 0x00)
	{
		struct Eq_403124 * a0_23 = g_ptr42027074;
		if (true)
		{
			word32 a0_67;
			word32 a2_68;
			word32 a3_69;
			word32 a4_70;
			tcp_free_ooseq(ra, a3_15, a4_16, 0x42027000, s4, mstatus, dwArgE8, out a0_67, out a2_68, out a3_69, out a4_70);
			return;
		}
		a0_19 = a0_23->t000C;
	}
}

// 23070068: Register Eq_2 pbuf_add_header_impl(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_403158) a2, Register out Eq_2 a1Out, Register out (ptr32 Eq_403158) a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      pbuf_add_header
//      pbuf_header
//      pbuf_header_force
Eq_2 pbuf_add_header_impl(Eq_2 a0, Eq_2 a1, struct Eq_403158 * a2, union Eq_2 & a1Out, struct Eq_403158 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a0_17;
	if (a0 != 0x00)
	{
		a4 = 0x10000000;
		a0_17.u0 = 0x01;
		if (a1 < 0x10000000)
		{
			a0_17.u0 = 0x00;
			if (a1 != 0x00)
			{
				a3 = (word32) (word16) a1;
				a4 = (word32) (word16) ((word32) *((word32) a0 + 8) + a3);
				a0_17.u0 = 0x01;
				if (a4 >= a3)
				{
					Eq_2 a1_22;
					Eq_2 a5_21;
					if ((int32) *((word32) a0 + 0x0C) < 0x00)
					{
						a5_21 = a2->t0004;
						a1_22 = a2 - a1;
						if (a1_22 < (word32) a5_21 + 16)
						{
							a1Out = a1_22;
							a2Out = (word32) a5_21 + 16;
							a3Out = a3;
							a4Out = a4;
							a5Out = a5_21;
							return 0x01;
						}
						goto l230700B2;
					}
					a0_17.u0 = 0x01;
					if (a2 != null)
					{
						a5_21 = a2->t0004;
						a1_22 = a2 - a1;
l230700B2:
						struct Eq_403158 * a2_29 = (word32) *((word32) a5_21 + 0x0A);
						*((word32) a1_22 + 4) = a5_21;
						*((word32) a5_21 + 8) = (word16) a4;
						ptr32 a3_35 = a2_29 + a3 / 8;
						((word32) a5_21 + 0x0A)->u2 = (word16) a3_35;
						a1Out = a1_22;
						a2Out = a2_29;
						a3Out = a3_35;
						a4Out = a4;
						a5Out = a5_21;
						return 0x00;
					}
				}
			}
		}
	}
	else
		a0_17.u0 = 0x01;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a0;
	return a0_17;
}

// 230700CA: Register Eq_2 pbuf_alloc_reference(Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 bArg44, Register out Eq_2 s1Out, Register out (ptr32 Eq_403239) a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s8Out)
// Called from:
//      pbuf_alloc
Eq_2 pbuf_alloc_reference(Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 bArg44, union Eq_2 & s1Out, struct Eq_403239 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s8Out)
{
	Eq_2 s0_27 = a0;
	struct Eq_403239 * a0_19;
	ptr32 a3_22;
	ptr32 a4_23;
	ptr32 a2_21;
	ptr32 a5_20;
	Eq_2 s1_24 = memp_malloc(s1, 0x0D, a3, a4, mstatus, out a0_19, out a2_21, out a3_22, out a4_23, out a5_20);
	if (a0_19 != null)
	{
		a0_19->dw0000 = 0x00;
		*((word32) a1 + 4) = a0_19;
		a0_19->w0008 = (word16) a1;
		a0_19->w000A = (word16) a1;
		a0_19->b000C = (byte) dwArg44;
		a0_19->b000D = 0x00;
		a0_19->w000E = 0x01;
		a2_21 = dwArg44;
		s0_27 = a1;
		a5_20 = 0x01;
	}
	s1Out = s1_24;
	a0Out = a0_19;
	a2Out = a2_21;
	a3Out = a3_22;
	a4Out = a4_23;
	a5Out = a5_20;
	s8Out = a2;
	return s0_27;
}

// 23070106: Register Eq_2 pbuf_alloced_custom(Register Eq_2 a0, Register ptr32 a1, Register int32 a2, Register Eq_2 a3, Register (ptr32 Eq_107009) a4, Register ptr32 a5, Register out (ptr32 Eq_107009) a4Out, Register out ptr32 a5Out)
// Called from:
//      tcpip_stack_input
Eq_2 pbuf_alloced_custom(Eq_2 a0, ptr32 a1, int32 a2, Eq_2 a3, struct Eq_107009 * a4, ptr32 a5, struct Eq_107009 & a4Out, ptr32 & a5Out)
{
	Eq_403293 a0_5 = (word32) a0 + 3 & ~0x03;
	if (a5 < (word32) a0_5 + a1)
	{
		a4Out = a4;
		a5Out = a5;
		return 0x00;
	}
	else
	{
		if (a4 != null)
			a4 += a0_5;
		*((word32) a3 + 0x0D) = 0x02;
		*a3 = 0x00;
		a4->t0004 = a3;
		*((word32) a3 + 8) = (word16) a1;
		*((word32) a3 + 0x0A) = (word16) a1;
		*((word32) a3 + 0x0C) = (byte) a2;
		((word32) a3 + 0x0E)->u2 = 0x01;
		a4Out = a4;
		a5Out = 0x01;
		return a3;
	}
}

