pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0006.c
// 2307013C: Register Eq_2 pbuf_add_header(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_400032 a3Out, Register out Eq_400033 a4Out, Register out ptr32 a5Out)
// Called from:
//      ip4_output_if_opt
//      raw_send
//      tcp_create_segment
//      udp_sendto
//      ethernet_output
//      icmp_input
Eq_2 pbuf_add_header(Eq_2 a0, Eq_2 a1, ptr32 & a1Out, ptr32 & a2Out, union Eq_400032 & a3Out, union Eq_400033 & a4Out, ptr32 & a5Out)
{
	ptr32 a5_7;
	Eq_400033 a4_8;
	Eq_400032 a3_9;
	ptr32 a1_10;
	ptr32 a2_11;
	Eq_2 a0_6 = pbuf_add_header_impl(a0, a1, null, out a1_10, out a2_11, out a3_9, out a4_8, out a5_7);
	a1Out = a1_10;
	a2Out = a2_11;
	a3Out = a3_9;
	a4Out = a4_8;
	a5Out = a5_7;
	return a0_6;
}

// 23070142: Register Eq_2 pbuf_remove_header(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a1Out, Register out (ptr32 Eq_399647) a3Out, Register out (ptr32 Eq_399647) a4Out, Register out Eq_2 a5Out)
// Called from:
//      ip4_input
//      pbuf_header
//      pbuf_header_force
//      pbuf_free_header
//      raw_send
//      tcp_receive
//      tcp_input
//      udp_input
//      ethernet_input
//      icmp_input
//      altcp_mbedtls_bio_recv
Eq_2 pbuf_remove_header(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a1Out, struct Eq_399647 & a3Out, struct Eq_399647 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a0_14;
	if (a0 != 0x00)
	{
		a4 = (struct Eq_399647 *) 0x10000000;
		a0_14.u0 = 0x01;
		if (a1 < 0x10000000)
		{
			a0_14.u0 = 0x00;
			if (a1 != 0x00)
			{
				a4 = (word32) *((word32) a0 + 0x0A);
				a3 = (word32) (word16) a1;
				a0_14.u0 = 0x01;
				if (a4 >= a3)
				{
					Eq_2 a5_17 = *((word32) a2 + 4);
					*((word32) a5_17 + 0x0A) = (word16) (a4 - a3);
					word32 a4_19 = (word32) *((word32) a5_17 + 8);
					word32 a1_20 = a1 + a2;
					*((word32) a1_20 + 4) = a5_17;
					struct Eq_399647 * a4_22 = a4_19 - a3;
					((word32) a5_17 + 8)->u2 = (word16) a4_22;
					a1Out = a1_20;
					a3Out = a3;
					a4Out = a4_22;
					a5Out = a5_17;
					return 0x00;
				}
			}
		}
	}
	else
		a0_14.u0 = 0x01;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a0;
	return a0_14;
}

// 23070180: Register Eq_2 pbuf_header(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out ptr32 a3Out, Register out ptr32 a5Out)
// Called from:
//      bl_output
Eq_2 pbuf_header(Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 & a3Out, ptr32 & a5Out)
{
	if (a1 >= 0x00)
	{
		ptr32 a5_7;
		ptr32 a3_9;
		word32 a1_30;
		word32 a2_31;
		word32 a4_32;
		Eq_2 a0_6 = pbuf_add_header_impl(a0, a1, null, out a1_30, out a2_31, out a3_9, out a4_32, out a5_7);
		a3Out = a3_9;
		a5Out = a5_7;
		return a0_6;
	}
	else
	{
		Eq_2 a1_12 = 0x00 - a1;
		ptr32 a5_15;
		ptr32 a3_17;
		word32 a1_28;
		word32 a4_29;
		Eq_2 a0_14 = pbuf_remove_header(a0, a1_12, a2, out a1_28, out a3_17, out a4_29, out a5_15);
		a3Out = a3_17;
		a5Out = a5_15;
		return a0_14;
	}
}

// 23070192: Register word32 pbuf_header_force(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out ptr32 a4Out)
// Called from:
//      ip4_input
//      udp_input
word32 pbuf_header_force(Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 & a4Out)
{
	if (a1 >= 0x00)
	{
		ptr32 a4_8;
		word32 a3_9;
		word32 a1_29;
		word32 a2_30;
		word32 a5_31;
		pbuf_add_header_impl(a0, a1, (struct Eq_403158 *) 0x01, out a1_29, out a2_30, out a3_9, out a4_8, out a5_31);
		a4Out = a4_8;
		return a3_9;
	}
	else
	{
		Eq_2 a1_12 = 0x00 - a1;
		ptr32 a4_16;
		word32 a3_17;
		word32 a1_27;
		word32 a5_28;
		pbuf_remove_header(a0, a1_12, a2, out a1_27, out a3_17, out a4_16, out a5_28);
		a4Out = a4_16;
		return a3_17;
	}
}

// 230701A4: Register Eq_2 pbuf_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_106019) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_106026 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_106032) s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_txdatacfm
//      get_dns_request
//      lwip_recv_tcp
//      free_socket
//      dns_check_entry
//      dns_recv
//      dhcp_select
//      dhcp_recv
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_renew
//      dhcp_coarse_tmr
//      dhcp_stop
//      etharp_free_entry
//      etharp_input
//      etharp_request
//      etharp_query
//      igmp_send
//      igmp_input
//      ip4_input
//      pbuf_alloc
//      pbuf_realloc
//      pbuf_free_header
//      raw_send
//      tcp_seg_free
//      tcp_pcb_purge
//      tcp_recv_null
//      tcp_input
//      tcp_create_segment
//      tcp_output_control_segment
//      tcp_split_unsent_seg
//      udp_input
//      udp_sendto
//      ethernet_input
//      recv_udp
//      recv_raw
//      recv_tcp
//      netconn_drain
//      netbuf_delete
//      netbuf_alloc
//      netbuf_free
//      icmp_input
//      icmp_dest_unreach
//      dhcp_server_recv
//      iperf_server_udp_recv_fn
//      sntp_recv
//      sntp_dns_found
//      cb_altcp_recv_fn
//      tcp_receive_callback
//      udp_send_data
//      udp_receive_callback
//      httpc_free_state
//      httpc_tcp_recv
//      httpc_tcp_connected
//      altcp_tcp_write
//      altcp_tcp_shutdown
//      altcp_tcp_recv
//      altcp_mbedtls_bio_recv
//      altcp_mbedtls_dealloc
//      altcp_mbedtls_handle_rx_appldata
//      altcp_mbedtls_lower_recv
Eq_2 pbuf_free(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0128, struct Eq_106019 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_106026 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, struct Eq_106032 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	struct Eq_403453 * sp_124 = fp + -48;
	Eq_2 s0_115 = 0x00;
	if (a0 != 0x00)
	{
		a1 = a0;
		s0_115.u0 = 0x00;
		s2.u0 = 0x02;
		s3.u0 = 0x01;
		do
		{
			sp_124->t0084 = a1;
			word32 a4_259;
			word32 a2_258;
			sys_arch_protect(a4, mstatus, out a2_258, out a4_259);
			word32 s1_30 = (word32) *((word32) a1 + 0x0E);
			s1 = s1_30 + ~0x00 & 0x00FF;
			*((word32) a1 + 0x0E) = (byte) s1;
			a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5);
			if (s1 != 0x00)
				break;
			ptr32 s8_109;
			struct Eq_106032 * s6_108;
			ptr32 s5_107;
			ptr32 a7_106;
			Eq_2 s4_104;
			Eq_2 a3_103;
			Eq_2 a4_102;
			ptr32 mstatus_101;
			Eq_106026 a5_98;
			ui32 a5_39 = (word32) *((word32) a1 + 0x0D);
			Eq_2 a1_40 = *(s1_30 + ~0x00 & 0x00FF);
			if ((a5_39 & 0x02) != 0x00)
			{
				word32 a1_85 = (a5_39 & 0x02)->dw0010;
				word32 a6_105;
				word32 t0_110;
				word32 t1_111;
				word32 t4_112;
				word32 t5_113;
				word32 t6_114;
				(a5_39 & 0x02)();
				a5 = a5_98;
				mstatus = mstatus_101;
				a4 = a4_102;
				a3 = a3_103;
				s4 = s4_104;
				a7 = a7_106;
				s5 = s5_107;
				s6 = s6_108;
				s8 = s8_109;
				goto l230701EA;
			}
			ui32 a5_42 = (word32) *((word32) a1_40 + 0x0C);
			Eq_2 a0_43 = 0x0E;
			a5 = a5_42 & 0x0F;
			if ((a5_42 & 0x0F) != s2)
			{
				if ((a5_42 & 0x0F) == s3)
				{
					a0_43.u0 = 0x0D;
					goto l23070216;
				}
				if ((a5_42 & 0x0F) == 0x00)
				{
					word32 a1_262;
					s0_115 = mem_free(a1_40, a3, a4, s2, s3, s4, mstatus, sp_124->t0004, sp_124->t0008, sp_124->t0024, sp_124->t0084, sp_124->t00A4, sp_124->t00D8, sp_124->t00F8, sp_124->t0118, sp_124->t0138, sp_124->t0158, sp_124->t0178, sp_124->t0198, out s1, out a1_262, out a3, out a4, out a5, out a7, out s2, out s3, out s4, out s5, out s6, out s8);
				}
			}
			else
			{
l23070216:
				word32 a2_261;
				word32 a0_260;
				s1 = memp_free(a0_43, a1_40, a3, a4, mstatus, out a0_260, out a2_261, out a3, out a4, out a5);
			}
l230701EA:
			s0_115 = (byte) s0_115.u0 + 1 & 0x00FF;
			a1 = s1;
		} while (s1 != 0x00);
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1;
	a0Out = s0_115;
	a1Out = a1;
	a2Out = dwArg0100;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a7Out = a7;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s8Out = s8;
	mstatusOut = mstatus;
	return ra;
}

// 23070226: Register Eq_2 pbuf_alloc(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_347775 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg44, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_347789) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      get_dns_request
//      dns_check_entry
//      dhcp_create_msg
//      etharp_request
//      igmp_send
//      pbuf_clone
//      raw_send
//      tcp_output_alloc_header_common.constprop.6
//      tcp_split_unsent_seg
//      tcp_send_fin
//      udp_sendto
//      netbuf_alloc
//      icmp_input
//      icmp_dest_unreach
//      dhcp_server_recv
//      sntp_dns_found
//      udp_send_data
//      httpc_init_connection_common.constprop.5
//      altcp_tcp_write
//      altcp_mbedtls_handle_rx_appldata
Eq_2 pbuf_alloc(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_347775 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg44, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, struct Eq_347789 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	if (a2 == 65)
	{
l230702D0:
		Eq_2 a0_232;
		ptr32 a2_233;
		Eq_2 a3_234;
		Eq_2 a4_235;
		Eq_2 a5_236;
		Eq_2 s1_238;
		ptr32 s8_239;
		s0Out = pbuf_alloc_reference(s1, a1, a3, a4, mstatus, dwArg44, out s1_238, out a0_232, out a2_233, out a3_234, out a4_235, out a5_236, out s8_239);
		s1Out = s1_238;
		a0Out = a0_232;
		a1Out = a1;
		a2Out = a2_233;
		a3Out = a3_234;
		a4Out = a4_235;
		a5Out = a5_236;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8_239;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 a5_101;
	Eq_2 s1_103;
	if (a2 <= 65)
	{
		a5_101.u0 = 0x01;
		if (a2 != 0x01)
			goto l23070246;
		0x00 = (int8) dwArg0128;
		goto l230702D0;
	}
	word32 s0_22 = (word32) (word16) a0;
	if (a2 == 386)
	{
		s3.u0 = 0x00;
		s1_103.u0 = 0x00;
		s4.u0 = 760;
		s2.u0 = 0x10000082;
		do
		{
			Eq_2 a0_36;
			Eq_2 a4_40;
			word32 a2_491;
			word32 a5_492;
			s1_103 = memp_malloc(s1_103, 0x0E, a3, a4, mstatus, out a0_36, out a2_491, out a3, out a4_40, out a5_492);
			if (a0_36 == 0x00)
			{
				word32 a2_482;
				word32 a4_483;
				sys_arch_protect(a4_40, mstatus, out a2_482, out a4_483);
				ui32 s2_87 = (word32) g_b420267EC;
				g_b420267EC = 0x01;
				s2 = s2_87 & 0x00FF;
				a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5_101);
				if ((s2_87 & 0x00FF) == 0x00)
				{
					word32 a0_97;
					struct Eq_403756 * s0_111 = tcpip_try_callback(0x23070034, 0x00, a3, a4, mstatus, dwArgA8, dwArgE8, dwArg0128, out s1_103, out a0_97, out a1, out a3, out a4, out a5_101, out a7, out s2, out s3, out s4, out s5, out s6);
					if (a0_97 != 0x00)
					{
						word32 a4_485;
						word32 a2_484;
						sys_arch_protect(a4, mstatus, out a2_484, out a4_485);
						s0_111->b07EC = 0x00;
						a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5_101);
					}
				}
				if (s1_103 != 0x00)
				{
					word32 s8_490;
					word32 a2_489;
					word32 s0_486;
					word32 s1_487;
					word32 a0_488;
					ra = pbuf_free(ra, s1_103, a3, a4, s4, mstatus, dwArgF8, out s0_486, out s1_487, out a0_488, out a1, out a2_489, out a3, out a4, out a5_101, out a7, out s2, out s3, out s4, out s5, out s6, out s8_490, out mstatus);
				}
				goto l23070246;
			}
			Eq_2 a5_48 = 760 - (s0_22 + 3 & ~0x03);
			a4 = a5_48;
			if (a1 < (word32) ((word16) a5_48))
				a4 = a1;
			a0_36->u0 = 0x00;
			((word32) a0_36 + s0_22 + 0x13 & ~0x03)->t0004 = a0_36;
			*((word32) a0_36 + 8) = (word16) a1;
			*((word32) a0_36 + 0x0A) = (word16) a4;
			*((word32) a0_36 + 0x0C) = 0x10000082;
			uint32 a5_59 = a4 << 0x10;
			a5_101 = a5_59 >> 16;
			if (s1_103 != 0x00)
				*s3.u0 = a0_36;
			else
				s1_103 = a0_36;
			a1 = (word32) (word16) (a1 - (a5_59 >> 16));
			s0_22 = 0x00;
			s3 = a0_36;
		} while (a1 != 0x00);
l23070248:
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_103;
		a0Out = s1_103;
		a1Out = a1;
		a2Out = dwArg0100;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_101;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = dwArg58;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		a5_101.u0 = 640;
		if (a2 == 640)
		{
			a5_101 = (word32) a1 + 3 & ~0x03;
			Eq_2 s0_173 = (word32) (word16) ((byte) a5_101.u0 + (s0_22 + 0x03 & ~0x03));
			s2 = a0;
			uint32 a0_176 = (word32) s0_173 + 16 << 16;
			if (s0_173 >= a5_101 && a0_176 >> 16 >= a5_101)
			{
				Eq_2 a0_182;
				word32 s8_481;
				mem_malloc(ra, s0_173, a0_176 >> 16, a3, a4, a0, mstatus, s0, dwArg04, ra, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0158, out a0_182, out a1, out a3, out a4, out a5_101, out a7, out s2, out s3, out s4, out s5, out s6, out s8_481);
				s1_103 = a0_182;
				if (a0_182 != 0x00)
				{
					*a0_182 = 0x00;
					s2 = s2 + a0_182 + 0x13 & -4;
					*((word32) a0_182 + 4) = s2;
					*((word32) a0_182 + 8) = (word16) a1;
					*((word32) a0_182 + 0x0A) = (word16) a1;
					*(union Eq_2 *) 0x1000008C = a0_182;
					a5_101.u0 = 0x10000080;
				}
				goto l23070248;
			}
		}
l23070246:
		s1_103.u0 = 0x00;
		goto l23070248;
	}
}

